[
    {
        "Rating": 4,
        "Review": "Great value, considering you don't have to do housekeeping, and as a junior or senior you can easily obtain your own room.",
        "Author": "Recent Alumnus",
        "Date": "2016-08-29T13:46:24Z"
    },
    {
        "Rating": 5,
        "Review": "I love my dorm, the building is beautiful and the people are wonderful. Each dorm has its own culture and because of that, all types of people can find their place and the type of people they want to surround themselves with.",
        "Author": "College Sophomore",
        "Date": "2016-08-03T17:05:38Z"
    },
    {
        "Rating": 4,
        "Review": "I got my third choice of dorm, but it is working out OK.",
        "Author": "College Freshman",
        "Date": "2016-07-19T20:13:30Z"
    },
    {
        "Rating": 4,
        "Review": "I am very satisfied with my current dorm - Simmons Hall.  Great building and people who reside in it.",
        "Author": "College Sophomore",
        "Date": "2016-07-10T19:45:44Z"
    },
    {
        "Rating": 4,
        "Review": "I live on the east side of campus, which could not be more convenient--very close to classes and to the T (subway). In my dorm, specific halls form close communities with decades of traditions. This is fun and engaging, but people tend to form groups/cliques and are often rude to each other because we have no explicit rules about how to treat other members of our hall.",
        "Author": "College Senior",
        "Date": "2016-06-24T00:44:30Z"
    },
    {
        "Rating": 4,
        "Review": "Despite the occasional fire alarm, living in a dorm was great. You get to choose who you live near in some of the dorms and form a strong community with the people around you. Each section or lounge gets funds to spend however they want to help facilitate that. The dorms are larger than at any other school.",
        "Author": "College Junior",
        "Date": "2016-06-17T04:55:58Z"
    },
    {
        "Rating": 3,
        "Review": "The communities are great, but the housing is super expensive.",
        "Author": "College Junior",
        "Date": "2016-06-06T02:51:07Z"
    },
    {
        "Rating": 4,
        "Review": "The community atmosphere is exceptional, the facilities can leave some to be desired.",
        "Author": "College Sophomore",
        "Date": "2016-06-03T21:54:07Z"
    },
    {
        "Rating": 4,
        "Review": "It's clean, nice, and social",
        "Author": "College Sophomore",
        "Date": "2016-03-30T00:12:41Z"
    },
    {
        "Rating": 5,
        "Review": "MIT's housing is unusual in that it emphasizes community",
        "Author": "College Sophomore",
        "Date": "2016-02-22T21:54:33Z"
    },
    {
        "Rating": 5,
        "Review": "Housing is very easy to choose and there is a guaranteed place for everyone.",
        "Author": "College Freshman",
        "Date": "2016-02-01T22:46:21Z"
    },
    {
        "Rating": 3,
        "Review": "The most frustrating thing about the dorms is their distance from the main campus.  However, each dorm has its own social community which really makes it feel like a home.  The dorms could all use more laundry options since the machines seem to always be in use or out of order.  The kitchens in MacGregor suck, but I still love the rooms in MacGregor.  Burton Connor is generally falling apart and dirty, but the social atmosphere there is great.  Front desk security people are lazy and rude many times, so I do not like dealing with them.  I also hate the process for checking in 'guests' into your dorm, and I personally think that if a guest is another MIT student with ID this should be much easier.",
        "Author": "College Freshman",
        "Date": "2016-01-16T13:02:36Z"
    },
    {
        "Rating": 5,
        "Review": "My dorm is amazing. The community is tight-knit and the staff are really nice.",
        "Author": "College Senior",
        "Date": "2015-12-31T03:06:26Z"
    },
    {
        "Rating": 4,
        "Review": "The aspects of campus housing are largely dependent on the dorm you choose. That being said, as opposed to most other colleges, housing options are much more lenient and students are given much more freedom to choose where they feel the most comfortable living and whom they would like to live with.",
        "Author": "College Freshman",
        "Date": "2015-12-29T19:38:16Z"
    },
    {
        "Rating": 3,
        "Review": "The housing is a bit expensive, but reasonable priced for the area. There was a lack of community in my dorm but I have heard positive things about other dorms",
        "Author": "College Freshman",
        "Date": "2015-12-29T16:47:06Z"
    },
    {
        "Rating": 5,
        "Review": "My dorm is nice and warm and roomy. Awesome people",
        "Author": "College Sophomore",
        "Date": "2015-12-29T16:38:16Z"
    },
    {
        "Rating": 3,
        "Review": "The best part is that you have a lot to choose from. Each dorm has a unique culture, and you'll probably find a niche if you look hard enough. Some dorms are a bit far from main campus, though, and some dorms have notable construction issues while others are right in the middle of campus (the East side) and/or are super crisp and attractive (Maseeh, Simmons, Next).",
        "Author": "College Freshman",
        "Date": "2015-12-24T01:48:49Z"
    },
    {
        "Rating": 5,
        "Review": "They are so many different options. It all depends on what kind of dorm atmosphere you are looking for.",
        "Author": "College Sophomore",
        "Date": "2015-06-09T18:16:50Z"
    },
    {
        "Rating": 4,
        "Review": "I find that the students in my dorm are all very friendly, and the cost is somewhat manageable.",
        "Author": "College Freshman",
        "Date": "2015-05-27T14:59:56Z"
    },
    {
        "Rating": 5,
        "Review": "It's great to live on campus since that's where a majority of your friends and classmates are. Each dorm has its own culture and atmosphere, and I think it's quite easy to find one that fits your personality",
        "Author": "College Junior",
        "Date": "2015-05-25T06:49:06Z"
    },
    {
        "Rating": 5,
        "Review": "Really clean, great community, great facilities",
        "Author": "College Freshman",
        "Date": "2015-03-16T15:20:01Z"
    },
    {
        "Rating": 5,
        "Review": "Housing is amazing: you can select from 11 unique dorms with wide-ranging cultures and amenities, and later have the option to change dorms.  The dorms all have their perks, such as East Campus, which builds roller coaters attatched to 3 story dance arenas (and many other things) to Simmons, which has spacious lounges, is new and well maintained, and inclusive government.  There is really a huge variety, and people seem to always find an environment they're happy in.",
        "Author": "College Freshman",
        "Date": "2015-03-01T01:31:08Z"
    },
    {
        "Rating": 4,
        "Review": "If you do not get the dorm that is too far away from campus it is great. and get one where you don't have to clean your own bathroom, it makes life easier.",
        "Author": "College Freshman",
        "Date": "2015-01-12T15:34:45Z"
    },
    {
        "Rating": 5,
        "Review": "MIT operates on a residential housing system, and because of this each dorm has it's own culture that, for the most part, remains the same over the years. Because of this, it is easy to find the dorm you want to live in and the lottery is generally very fair in giving you one of your top three choices.",
        "Author": "College Freshman",
        "Date": "2014-11-19T13:58:02Z"
    },
    {
        "Rating": 3,
        "Review": "Expensive and not very convenient, unless you live in an off-campus sorority or fraternity. In the summer, I looked for an apartment off-campus, but the dorms MIT kept open for summer living were just more convenient.",
        "Author": "College Sophomore",
        "Date": "2014-11-13T13:54:56Z"
    },
    {
        "Rating": 3,
        "Review": "Living on campus is quite expensive, and many students are upset about the new enforced security. However, most students do live on campus.",
        "Author": "College Junior",
        "Date": "2014-08-25T12:53:11Z"
    },
    {
        "Rating": 3,
        "Review": "There are a few off-campus communities. I have not lived in them, but the people who do are very tight-knit communities and almost always satisfied with their housing.",
        "Author": "College Junior",
        "Date": "2014-08-25T12:51:50Z"
    },
    {
        "Rating": 4,
        "Review": "Living off-campus has many pros in terms of being closer to cheaper restaurants and places to shop, but many students stay on campus.",
        "Author": "College Senior",
        "Date": "2014-08-14T22:00:47Z"
    },
    {
        "Rating": 4,
        "Review": "I love our campus housing. It allows us so much more freedom than your typical university, and the dorms are really hubs of MIT student culture.",
        "Author": "College Senior",
        "Date": "2014-08-14T21:43:20Z"
    },
    {
        "Rating": 4,
        "Review": "There's lots of places to live in Cambridge or Boston if you want to move off campus after Freshman year. MIT does not impose any restrictions on living off campus so it is an option that many students take. With Greek life a big part of the MIT social scene, many affiliated people move into their respective sorority and fraternity houses while other students move into apartments.",
        "Author": "College Junior",
        "Date": "2014-08-03T12:55:34Z"
    },
    {
        "Rating": 3,
        "Review": "Some of the dorms are very nice and new while others are super old, and run down. What this allows for is dorm-based culture that includes a great deal of freedom and things such as painting murals on walls. The social atmosphere also varies a lot between the dorms, some are all about the social scene while others are much more quiet and chill.",
        "Author": "College Junior",
        "Date": "2014-08-03T12:40:58Z"
    },
    {
        "Rating": 5,
        "Review": "MIT has a unique housing system, with everyone living together for all four years.",
        "Author": "College Senior",
        "Date": "2014-06-23T21:19:33Z"
    },
    {
        "Rating": 4,
        "Review": "If you count fraternities, almost half of us live off campus.  Extra freedom is nice.",
        "Author": "College Senior",
        "Date": "2014-06-23T21:16:19Z"
    },
    {
        "Rating": 4,
        "Review": "Dorms, predictably, determine the social scene and ultimately your social life. There's very little mixing between dorms so once you get into a dorm, there's a high chance you'll stay there forever (by choice) just because your friends are there. That being said, there's plenty of variety. The main split is between east and west campus, with east campus being the strange kids, the dye-our-hair-pink kids, the hackers, the clothing-optional kids, etc. West campus is more \"mainstream\". In terms of location, east campus is right in the center of everything. Some kids don't even have to see daylight to get their classes because of the tunnel systems linking that part of campus. As for west campus, the unfortunate part is that it's laid out on a single road (Amherst Alley, along Mem Drive). So if you live at the very far end, it will take you a good 10-15 minutes to walk to class. Additionally, because there's few obstructions on this street, you may have to fight your way to class against the strong wings that come from time to time.",
        "Author": "Recent Alumnus",
        "Date": "2014-05-27T14:18:22Z"
    },
    {
        "Rating": 3,
        "Review": "Quality of housing varies wildly but it's true that there's something for everyone.",
        "Author": "College Freshman",
        "Date": "2014-05-02T19:42:50Z"
    },
    {
        "Rating": 3,
        "Review": "Generally it's better to live on campus for proximity to everything.",
        "Author": "College Freshman",
        "Date": "2014-05-02T19:37:18Z"
    },
    {
        "Rating": 3,
        "Review": "Off campus housing is great if u can afford it. There are off campus living groups that are affordable but private housing is expensive.",
        "Author": "College Freshman",
        "Date": "2014-03-26T01:07:00Z"
    },
    {
        "Rating": 3,
        "Review": "Most people who live off-campus live at their fraternity/sorority house. Independent options are limited, and Boston is on the expensive end.",
        "Author": "College Sophomore",
        "Date": "2014-01-23T10:09:13Z"
    },
    {
        "Rating": 4,
        "Review": "I like it a lot. I've really gotten to know and get close to the people I live with.",
        "Author": "College Freshman",
        "Date": "2014-01-21T18:29:09Z"
    },
    {
        "Rating": 3,
        "Review": "Some buildings are old and the facilities aren't completely updated but the dorms provided a social environment and a culture for their students.",
        "Author": "College Freshman",
        "Date": "2014-01-08T13:33:52Z"
    },
    {
        "Rating": 5,
        "Review": "I love where I live",
        "Author": "College Freshman",
        "Date": "2013-12-31T01:07:30Z"
    },
    {
        "Rating": 5,
        "Review": "I love my dorm. It's one of the further ones from campus, but it's nice.",
        "Author": "College Freshman",
        "Date": "2013-12-27T12:30:55Z"
    },
    {
        "Rating": 5,
        "Review": "MIT dorm life is crazy and fun and different than anywhere else. Every dorm is different, and every floor/entry/house within each dorm has its own culture as well. Housing process is pretty involved for freshmen - you get placed in a temporary room, then have the option of switching dorms, then have the option of doing a 'floor rush'.",
        "Author": "College Sophomore",
        "Date": "2013-11-12T15:35:26Z"
    },
    {
        "Rating": 3,
        "Review": "If you are in need of an apartment, you'll have no trouble finding one, but the price might scare you far from your ideal location. My dorm closed down this year and I managed to find a 4 bedroom, 2 bath flat 10 minute walking distance from campus within the 3 days of searching. The flat ended up being quite affordable because we are fitting 6 people (2 in massive living room), and I have a roommate. Otherwise, I would say the flat was quite expensive for building quality and location (Central Square is not the best of neighborhoods).",
        "Author": "College Senior",
        "Date": "2013-08-21T11:58:21.71Z"
    },
    {
        "Rating": 4,
        "Review": "Each dorm has its own unique culture and usually, you can find the dorm that's right for you. Being required to live on campus your freshman year is a good thing since it allows you to assimilate to college life and helps you meet other freshmen and upperclassmen.",
        "Author": "College Freshman",
        "Date": "2013-05-30T12:51:45.597Z"
    },
    {
        "Rating": 3,
        "Review": "Off-campus housing at MiT is often done through frats/sororities making it very easy and still somewhat dorm-like. On the other hand though, I've never heard of anyone having trouble finding an apartment off campus or roommates.",
        "Author": "College Freshman",
        "Date": "2013-05-15T13:42:16.207Z"
    },
    {
        "Rating": 3,
        "Review": "It's the cheapest way to live at MIT if you're not in a fraternity or sorority.  Although all of the dorms differ significantly, most rooms have plenty of space.  Most dorms are located on prime property on the Charles River.",
        "Author": "College Junior",
        "Date": "2013-03-10T09:32:32.27Z"
    },
    {
        "Rating": 5,
        "Review": "A Place for Everybody and Everybody Always in Multiple Places – most students live on campus all four years for a reason. few have meal plans, so it's a lot of cooking on your own, and there are constantly study breaks, dorm awesomeness, dormwide hacking, and East Campus vs West Campus shenanigans. i can't imagine a more lively, more communal, more amazing place to spend 4 years of sleep (or lack thereof)",
        "Author": "College Sophomore",
        "Date": "2012-08-13T23:58:58.553Z"
    },
    {
        "Rating": 3,
        "Review": "The housing process is great; administration does everything possible to make sure you end up where you want to be.\r\nSimmons is a very nice dorm with big rooms, good cooking and lounge spaces, and friendly people. It's costly, though, and the in-house dining hall isn't as good as some of the others.",
        "Author": "College Freshman",
        "Date": "2012-02-11T14:35:29.967Z"
    },
    {
        "Rating": 5,
        "Review": "MIT is MIT... unless you're a student here, you won't really get us from outside. It's a nerdy place yes, but the stereotypes of a bunch of kids who only study is bogus. Yeah, we do a lot of work, but here, the unofficial motto is \"work hard play hard\". Why else would the BU and Wellesey people always crash the MIT parties. Dorm culture is super unique to MIT. And it makes dorm life awesome. There is no real dining hall and most of campus is OK with this. Social atmosphere is literally what any kid who actually gets into MIT will want. We are all dedicated to our work, but we have SO much more than that to do in college, and it makes for a great place.",
        "Author": "College Sophomore",
        "Date": "2012-01-19T09:15:47.353Z"
    },
    {
        "Rating": 4,
        "Review": "Dorms for Any Type of Person – Each dorm at MIT can be perfect for any type of person. MIT doesn't separate freshmen and upperclassmen in different dorms, and I think that's a great way to get freshman to know and talk to upperclassmen. Also, every dorm is different, so there are a few places each type of person can comfortably live at. Most dorms at MIT have hall and dorm culture, so everyone on a specific hall can be close to those people that they live next to or near each other. In my opinion, I think that is really cool, and something that I feel is a positive thing. But there are some dorms that don't strive to achieve that sort of close dorm culture. Anyways, because MIT does have greek life, some people can also move into their fraternity or sorority's house, though most of those are off-campus and take some time to commute to. I think the housing process is pretty great for freshman trying to find the best fit for themselves, but it can sort of be difficult for those people who want to move out of their current dorm, and are on the waitlist to a dorm that they really want to get into.",
        "Author": "College Sophomore",
        "Date": "2012-01-19T01:04:17.11Z"
    },
    {
        "Rating": 5,
        "Review": "Good Living on Campus – Each dorm has its own personality. It is very unique and most of the people live in the dorm they fit at.",
        "Author": "College Freshman",
        "Date": "2012-01-19T00:09:14.52Z"
    },
    {
        "Rating": 3,
        "Review": "Available but No Need – A lot of students live off campus in fraternities and/or sororities, but these houses are still owned and partially funded by MIT.  MIT guarantees housing throughout your undergraduate education, so there's really no need to live off-camps, except during the summer.  Also, the dorms are each unique, so you can live in one that feels more like an apartment (no dining hall and kitchens everywhere) or choose the typical dorm with a dining hall.  Boston in general is expensive, so it's really not worth it.",
        "Author": "College Sophomore",
        "Date": "2011-11-07T21:56:19.253Z"
    },
    {
        "Rating": 4,
        "Review": "Awesome and Totally Dependent on Culture – It's great. Each dorm has its own culture and that really helps freshmen determine where they belong.",
        "Author": "College Freshman",
        "Date": "2011-03-23T01:47:27.267Z"
    },
    {
        "Rating": 4,
        "Review": "Either a Greek House or a Really  Expensive Apartment – Apartments near campus are really easy to find in Boston - they are all over the place. However, the better option for off campus housing is a frat or sorority. Apartments are really expensive and sometimes don't have certain amenities (like a washer and dryer).",
        "Author": "College Sophomore",
        "Date": "2010-10-04T17:21:23.99Z"
    },
    {
        "Rating": 3,
        "Review": "Housing on Campus – each dorm on campus has its own community, making it easy for students to find where they fit in. although not all of the dorms have dining halls, there are campus food options within walking distance. some of the dorms are situated a little far from main campus, which is rough during the winter.",
        "Author": "College Sophomore",
        "Date": "2010-10-04T14:29:36.21Z"
    },
    {
        "Rating": 3,
        "Review": "Very Nice but Too Expensive – Off-campus housing at MIT is way too expensive for most people. An apartment on University Park behind campus runs for much more a month than any dormitory. On-campus housing is more convenient because of the proximity to classes and the many resources available at dorms.",
        "Author": "College Sophomore",
        "Date": "2010-05-27T19:04:07.807Z"
    }
]