{
    "Overall%20Experience": [
        {
            "Rating": 5,
            "Review": "Unfortunately, I haven't had the opportunity to attend yet, but the onboarding process has been rewarding. I have been assigned a degree program and given the steps to complete the application process.",
            "Author": "Other",
            "Date": "2025-02-12T19:10:32.721044Z"
        },
        {
            "Rating": 5,
            "Review": "Cal-Tech is a cool place with great alumni who have had great impact in the world. Their student body are also friendly to international students that makes us feel a little bit relieved and we feel at home.",
            "Author": "Freshman",
            "Date": "2024-12-29T17:11:20.564888Z"
        },
        {
            "Rating": 5,
            "Review": "I did things and experienced things that had previously not been within my subjective world of possibilities. It is a very supportive place, well-endowed with resources, not least of which is the dedicated, highly competent, bleeding edge community. For someone whose interest in science, technology, and the frontiers of human cognition verges on obsession, it exists in the foremost tier of locations and institutions.",
            "Author": "Other",
            "Date": "2024-10-31T21:32:04.075016Z"
        },
        {
            "Rating": 5,
            "Review": "Caltech is amazing. It often gets put into the box of being for weird nerds, but in general people are really normal. There’s a lot of fun events and outgoing people. It’s certainly challenging academically but having most assignments be collaborative it isn’t too stressful. Caltech is definitely a unique college experience, but everyone will have a different college experience wherever they go so that’s no a huge factor. The professors are great and most really care about their students. Overall, Caltech is a great school I would highly recommend.",
            "Author": "Freshman",
            "Date": "2024-10-23T19:53:53.000543Z"
        },
        {
            "Rating": 4,
            "Review": "Seem to be very accommodating to different students needs which I found to be very good and helpful.",
            "Author": "Freshman",
            "Date": "2024-09-14T04:14:56.093915Z"
        },
        {
            "Rating": 5,
            "Review": "I like the campus most , students activities , diverse programs of alumni and dorms and libraries . overall experiences are very good .",
            "Author": "Other",
            "Date": "2024-05-01T15:20:17.520911Z"
        },
        {
            "Rating": 5,
            "Review": "It will be a lovely experience for me to study there and also enjoy the beautiful state and learn more about the society",
            "Author": "Works Here",
            "Date": "2024-01-18T04:21:07.555544Z"
        },
        {
            "Rating": 4,
            "Review": "I was in the Class of 1996.  I had such a difficult time due to personal issues.  I wish someone had been able to explain to me that it is okay to take a break.  That would have been better than failing out and then taking a break.  Also, peer support at the counseling center would have made a difference.",
            "Author": "Alum",
            "Date": "2023-08-16T23:26:19.700135Z"
        },
        {
            "Rating": 4,
            "Review": "It’s amazing amazing school full of people who are at the top of their field and passionate about sharing their knowledge with the students.",
            "Author": "Freshman",
            "Date": "2023-06-17T07:13:35.034987Z"
        },
        {
            "Rating": 5,
            "Review": "Great school, amazing opportunities provided by all the faculty. Beautiful campus perfect for anyone around :)",
            "Author": "Freshman",
            "Date": "2023-03-07T18:27:31.249533Z"
        },
        {
            "Rating": 3,
            "Review": "The stereotype of ‘Caltech is lot of work and a lot of theory’ is not exaggerated. Good if you really enjoy doing math and science, but genuinely do not go here if you value your free time.",
            "Author": "Sophomore",
            "Date": "2023-02-20T00:18:35.483081Z"
        },
        {
            "Rating": 5,
            "Review": "It's a challenging school, but one with lots of opportunities to be taken advantage of, and a research student's dream come to life.",
            "Author": "Sophomore",
            "Date": "2022-08-05T22:43:16.289655Z"
        },
        {
            "Rating": 5,
            "Review": "Great academic and research environment. Amazing people all around, from students to faculty. Only problem is the administration.",
            "Author": "Junior",
            "Date": "2021-12-30T21:53:00.944499Z"
        },
        {
            "Rating": 5,
            "Review": "Incredible place. The brightest minds working together to advance scientific progress all in a beautiful, warm neighborhood.",
            "Author": "Alum",
            "Date": "2021-09-22T14:32:16.301789Z"
        },
        {
            "Rating": 3,
            "Review": "The campus isn't very friendly. It's hard to meet people. The college doesn't do much to support mental health. It could do a lot more.",
            "Author": "Sophomore",
            "Date": "2021-04-06T17:17:05.687532Z"
        },
        {
            "Rating": 5,
            "Review": "One of the greatest school a student can go to. For engineers, scientists, and mathematicians, Caltech is the place to be.",
            "Author": "Freshman",
            "Date": "2021-03-23T22:35:06.128519Z"
        },
        {
            "Rating": 2,
            "Review": "Unless you are super super into the sciences and doing research as an undergrad, do not come here!!! The workload is just not worth it... About half of the courses you take will be unrelated to your major because of the ridiculous core requirements. The gym is lame and super far away from the dorms. Terribly party scene...\n\nReally great food though imo",
            "Author": "Sophomore",
            "Date": "2021-02-13T00:03:01.377285Z"
        },
        {
            "Rating": 5,
            "Review": "What I liked was the striking environment and the involvement of the students.  For first year Physics lab they had us run through a few standard labs just to experience and then they turned us loose to do other labs.  One of our labs was with two friends.  We managed to get a key to the old astronomy building where a solar telescope was removed leaving a many storied hole in the building.  We managed to rig a pendulum to measure the latitude.  It was fascinating.  We were measuring the precession but got an interesting effect.  The pendulum which started as a line drag  showed that it was an eclipse with an increasing minor axis. Not a perfect result but one which required learning a lot.  Where else would they just give a bunch of teens the keys to play with the building.",
            "Author": "Alum",
            "Date": "2020-05-23T03:47:06.154021Z"
        },
        {
            "Rating": 4,
            "Review": "My experience so far at Caltech has been that yes, the rumors are true: it's really hard. However, if you are willing to put in the work, you'll be okay. I really like it's spirit of collaboration: students work together on problem sets, and then TAs and professors are there to help if you still can't get it. It's a pretty positive learning environment.",
            "Author": "Sophomore",
            "Date": "2020-01-03T12:06:54.370451Z"
        },
        {
            "Rating": 5,
            "Review": "Some of the best (and worse) people you will ever meet. Nurses here take care of you super well, especially if you encounter the Freshman Plague. Professors go really fast and expect you to know a lot more than you're taught in high school. The emphasis on honor code makes this school truly unique.",
            "Author": "Freshman",
            "Date": "2019-10-18T00:31:56.699155Z"
        },
        {
            "Rating": 5,
            "Review": "The size and academic rigor of this institution makes it the perfect place for a STEM-focused student to go and grow.",
            "Author": "Sophomore",
            "Date": "2019-09-07T19:26:30.177472Z"
        },
        {
            "Rating": 5,
            "Review": "The best school in the country, period. Great research opportunities, faculty and resources make up Caltech. But it is the incredible people around that make it such a worthwhile experience.",
            "Author": "Freshman",
            "Date": "2019-06-18T21:02:05.143499Z"
        },
        {
            "Rating": 5,
            "Review": "I love Caltech! The collaborative environment here is amazing and I am learning a lot! The challenge is there, but for people who love the sciences, this is the best school in the country.",
            "Author": "Freshman",
            "Date": "2019-05-17T02:44:48.688492Z"
        },
        {
            "Rating": 5,
            "Review": "The place is no different from HELL.\nYou have all the access to the top of the top of any field. But you have to work hard.  you are going to take the same class with first year grad students from your junior year.   By the time you finish your four year inmate life, you get extremely well prepared for grad school, or you will become too full of the subjects; you do not want to see the subject which once you liked.  GOOD LUCK",
            "Author": "Alum",
            "Date": "2019-05-16T12:35:02.600372Z"
        },
        {
            "Rating": 4,
            "Review": "Caltech is a very work hard play hard mentality. Academically, it has the most rigorous and intense coursework I've ever experienced. Alumni agree that any job after graduation pales in comparison to the Caltech workload. The professors are amazingly competent, and it's treated as no big deal to take a course taught by a Nobel-prize winner. I would say the classes are very theoretical with an emphasis on proofs, so it's not very industry-oriented (unless you study computer programming). Socially, although there's no Greek life, all students are sorted into one of eight dorm houses, which are essentially fraternities. There are parties, you just need to know where to look for them. The food is terrible, eating out or cooking your own is both cheaper and tastier. The dorms are old, but no major issues. Caltech isn't perfect, but it'll challenge  you academically and get you a good job after graduation.",
            "Author": "Alum",
            "Date": "2019-04-11T01:40:13.906979Z"
        },
        {
            "Rating": 5,
            "Review": "Not just 'small', intimate. Imagine a top-tier university where many classes have 15 or 20 students (or less) AND do not get cancelled. This is true of English lit (Falkner and Fitzgerald), Entrepreneurship, Poly Sci, Anthro or Macro and even science intro classes. This is simply a small but spectacular place. A student body of UNDER a thousand students, and these will be a thousand of the brightest stars you will ever hope to meet. You will personally know almost all of your classmates (there will be only ~270 TOTAL, including all majors in your class), plus your professors typically teach only one or two classes (except for freshman lectures) and are personal. Research opportunities abound. My upper division classes had 8 students. Really. Every course I took opened my eyes and inspired me. Caltech is full service: my graduating class included a business, econ and even a journalism major.  I took fencing (epee) and beginning golf classes. Each had maybe 6 students(!)",
            "Author": "Alum",
            "Date": "2019-03-26T23:18:59.774876Z"
        },
        {
            "Rating": 5,
            "Review": "I loved the campus when I went on my tour! The trees and greenery really draw you in and give you a feeling on inclusion. Can't wait to apply to this wonderful small university!",
            "Author": "Niche User",
            "Date": "2018-10-30T12:36:54.32187Z"
        },
        {
            "Rating": 5,
            "Review": "Tough, Good for research and general science. Expect to work hard, but feel very rewarded. Houses system is a plus.",
            "Author": "Alum",
            "Date": "2018-05-27T21:15:41.854635Z"
        },
        {
            "Rating": 5,
            "Review": "Great academics and opportunities, beautiful weather. Very demanding but also a very supportive community.",
            "Author": "Freshman",
            "Date": "2018-05-04T23:18:01.958481Z"
        },
        {
            "Rating": 5,
            "Review": "If you like science and tech, this is the place to go. Small school makes professors, research, work study, and other opportunities more available. You learn to work with others to get through the academics which are tough, but you ultimately come out with a great sense of accomplishment. It is not the right school for everyone but if you want to major in science or engineering, it would be hard to find a better place.",
            "Author": "Alum",
            "Date": "2018-04-26T13:40:33.780424Z"
        },
        {
            "Rating": 5,
            "Review": "You can do things here no one else can.  Research and professors and classes all incredible.  Hardest school in the world.  Work is insane.",
            "Author": "Sophomore",
            "Date": "2017-07-28T18:22:02.694627Z"
        },
        {
            "Rating": 5,
            "Review": "Great school. Really tough to get in, even tougher to get out, but well worth it, overall. Can't get an education like it anywhere else.",
            "Author": "Alum",
            "Date": "2017-04-23T08:23:18.346533Z"
        },
        {
            "Rating": 4,
            "Review": "As a freshman in the second term, the experience here has been pretty positive. The coursework is definitely challenging, but it keeps me motivated to pursue higher goals. I am extremely grateful for finding such a like-minded community of scholars who are supportive and caring.",
            "Author": "Freshman",
            "Date": "2017-01-31T08:22:07.867862Z"
        },
        {
            "Rating": 4,
            "Review": "Good school for science - but just that. It is a technical school. The House System is good - IF you get into the house you want. There are a few students who are placed into houses they rated very poorly; for these individuals, House Life is poor.",
            "Author": "Freshman",
            "Date": "2016-10-20T02:20:32.786039Z"
        },
        {
            "Rating": 5,
            "Review": "Caltech is a place of wonderful innovation and the students really do care about one another.",
            "Author": "College Freshman",
            "Date": "2015-06-29T17:34:48Z"
        },
        {
            "Rating": 3,
            "Review": "Working with students is the bomb-diggity. Profs aren't really chosen for their teaching ability, though.",
            "Author": "College Sophomore",
            "Date": "2014-07-14T19:45:40Z"
        },
        {
            "Rating": 5,
            "Review": "So far it has been perfect. I am sure in my future, it will only get better and better. As I gain what I need to complete my courses.",
            "Author": "College Junior",
            "Date": "2014-01-23T18:47:50Z"
        },
        {
            "Rating": 4,
            "Review": "I love that we have more interaction time with the teachers.",
            "Author": "College Junior",
            "Date": "2014-01-03T12:31:49Z"
        }
    ],
    "Student%20Life": [
        {
            "Rating": 4,
            "Review": "They're very flexible about drinking -- \"just put it in a cup so we don't know\" is a common theme.",
            "Author": "College Freshman",
            "Date": "2015-05-14T00:56:15Z"
        },
        {
            "Rating": 4,
            "Review": "The only school policy that is really prevalent is the honor code.",
            "Author": "College Freshman",
            "Date": "2015-04-18T01:05:52Z"
        },
        {
            "Rating": 1,
            "Review": "Not a big part of Caltech :/",
            "Author": "College Freshman",
            "Date": "2015-04-07T22:13:06Z"
        },
        {
            "Rating": 4,
            "Review": "Caltech's honor code is great!",
            "Author": "College Freshman",
            "Date": "2015-04-07T22:10:51Z"
        },
        {
            "Rating": 3,
            "Review": "Nothing too glaring here. Ratio could definitely improve to increase number of girls in attendance.",
            "Author": "College Junior",
            "Date": "2014-07-07T17:04:31Z"
        },
        {
            "Rating": 3,
            "Review": "No glaring issues in this realm of campus life. Attendance might be helpful to be more strict with, but the standard of teaching needs to improve, first.",
            "Author": "College Junior",
            "Date": "2014-07-07T17:02:24Z"
        },
        {
            "Rating": 3,
            "Review": "Athletics are going through a revolution, so it is hard to tell at this time. There are many students who want to play competitive sports, and others who are there to have fun. This difference in attitude and motivation can be hard to deal with within a single team, as well as for coaches.",
            "Author": "College Junior",
            "Date": "2014-07-07T16:59:07Z"
        },
        {
            "Rating": 3,
            "Review": "I have never heard anyone talk about this.",
            "Author": "College Junior",
            "Date": "2014-01-23T18:39:55Z"
        },
        {
            "Rating": 5,
            "Review": "Institute of Technology, well it is a great place to go to school. They are very strict when it comes to over all values. they give each student respect and have all the tools on hand to help you meet your goals. Everyone is wonderful and help students and other.  I enjoy going to school their. I get up early and leave my house at 6:45 each morning to get their in time, and to get to class on time. I like being a little early so I can slip into the class mode. Institute of Technology has made learning fun.",
            "Author": "College Junior",
            "Date": "2014-01-23T18:13:22Z"
        },
        {
            "Rating": 5,
            "Review": "At Caltech, we lose most of our games in every sport (except fencing), but the athletes keep working hard and having fun.  It's the kind of sportsmanly behavior you don't get often with more successful teams.",
            "Author": "College Sophomore",
            "Date": "2013-11-07T00:59:34Z"
        },
        {
            "Rating": 3,
            "Review": "The woman seem to be friendly, and so are the men. Everyone seems very dedicated and that's contagious",
            "Author": "College Junior",
            "Date": "2013-03-07T15:23:01.71Z"
        },
        {
            "Rating": 4,
            "Review": "Security doesn't crack down on students like the police on a drug raid. Instead, they are understanding and helpful. While the guards do not encourage underage drinking, they are always willing to help an intoxicated student whether he/she is legal to drink or not. Usually no severe consequence occur because security does not want to discourage students from asking for help when they need it.",
            "Author": "College Freshman",
            "Date": "2013-01-09T17:43:21.6Z"
        },
        {
            "Rating": 3,
            "Review": "For the guys, yes there are a lot of them, but you have to be prepared. It is a geeky school and not many of them were the quarterback/homecoming king/most coveted boy in school. Actually none of them are. But most of them are super nice! and some of them are pretty good looking. The girls are sparse but everyone is really nice. the 60/40 ratio pretty much guarantees that if a guy tries hard enough he can get a girlfriend",
            "Author": "College Freshman",
            "Date": "2012-12-05T12:12:59.977Z"
        },
        {
            "Rating": 3,
            "Review": "The school has a wide range of ethnic backgrounds and the student body is even more so. many people from many walks of life can be found in the students, staff, and student body.",
            "Author": "Recent Alumnus",
            "Date": "2012-10-12T17:52:50.17Z"
        },
        {
            "Rating": 5,
            "Review": "Extremely accepting team of individuals. They all are very welcoming and have your best interests in mind. They are very easy to talk to and can be your best friend.",
            "Author": "Recent Alumnus",
            "Date": "2012-10-12T17:48:30.183Z"
        },
        {
            "Rating": 2,
            "Review": "Housing Can Be Unreasonable – As far as I know, academic violations are dealt with reasonably, but housing can be a bit ridiculous at times (this may apply more to Avery House, since it's a much newer residence hall). We were threatened with fines for drawing with chalk and window markers, both of which are easily removable. Also, Caltech has had issues with incidents of \"hazing,\" which in my opinion some members of the administration did not mediate very well; the punishments were widely viewed among the students and unreasonably severe.",
            "Author": "College Sophomore",
            "Date": "2012-08-04T17:36:06.893Z"
        },
        {
            "Rating": 1,
            "Review": "Not Much Support – Students are generally too busy and uninterested to come to sporting events, and a perpetually losing team doesn't help. About 5 or 10 people show up for most home sporting events.",
            "Author": "College Freshman",
            "Date": "2012-03-11T18:47:51.89Z"
        },
        {
            "Rating": 2,
            "Review": "If You Want to Be in a Sport, No One Will Stop You – If you're willing to show up and participate, a team won't turn you away. The quality is not very high, but it's a friendly environment. The gym is nice, we have a good training staff, and the coaches are quite good. Fan support is lacking. There is no women's soccer team, though women can play on the male-dominated co-ed team.",
            "Author": "Recent Alumnus",
            "Date": "2011-09-29T12:29:30.81Z"
        },
        {
            "Rating": 3,
            "Review": "There are no real restrictions.  Low enforcement.  Friends are always watching out for each other, but there is really nothing restrictive at all.  Just don't vandalize campus.",
            "Author": "College Sophomore",
            "Date": "2011-09-21T01:00:49.517Z"
        },
        {
            "Rating": 3,
            "Review": "Mostly Asian and Caucasian – Asians and white students make up over 90 percent of the student population. However, the students here are very open and accepting.",
            "Author": "College Freshman",
            "Date": "2011-02-23T00:33:49.12Z"
        }
    ],
    "Academics": [
        {
            "Rating": 5,
            "Review": "I'm working at JPL for the summer. It's pretty ballin.",
            "Author": "College Sophomore",
            "Date": "2014-07-14T19:44:18Z"
        },
        {
            "Rating": 4,
            "Review": "Most people get awarded SURF money, if they apply.",
            "Author": "College Sophomore",
            "Date": "2014-07-14T19:44:18Z"
        },
        {
            "Rating": 3,
            "Review": "I like my major, but I think there should be more tracks, so that people can specialize. I'm hoping to go to med school, but others with the same major will go into industry, but all of us still do the same work. That should change",
            "Author": "College Junior",
            "Date": "2014-07-07T16:56:46Z"
        },
        {
            "Rating": 3,
            "Review": "Academics are tough most of the time, but I have been told that people appreciate the education they received, many years after they graduate. Registration usually goes smoothly because it's a small school. Come prepared to work hard.",
            "Author": "College Junior",
            "Date": "2014-07-07T16:56:46Z"
        },
        {
            "Rating": 3,
            "Review": "The curriculum is difficult and professors are often focusing on their own research too much to be of major assistance. This can get frustrating.",
            "Author": "College Junior",
            "Date": "2014-07-07T16:53:59Z"
        },
        {
            "Rating": 5,
            "Review": "Institute of Technology is the best.... I value anything they are doing to help me change my live.",
            "Author": "College Junior",
            "Date": "2014-01-23T18:44:13Z"
        },
        {
            "Rating": 5,
            "Review": "Caltech is probably the best place for geology in the country.  There are lots of field trips, brilliant professors (the tops in their fields), and it's easy even for freshman to find research opportunities.",
            "Author": "College Sophomore",
            "Date": "2013-11-07T01:04:01Z"
        },
        {
            "Rating": 4,
            "Review": "Most of the classes are great, but some are poorly taught.  There are also a lot of humanities requirements for a science school, which would be less of an issue if it weren't a small school with very few people who care about humanities.  The choices for humanities end up being rather slim.",
            "Author": "College Sophomore",
            "Date": "2013-11-07T01:04:01Z"
        },
        {
            "Rating": 5,
            "Review": "awesome. excellent education. everyone in all options have job/internship opportunities over the summer through the university. I'm only a frosh, but there are lots of mentors to explain the different options",
            "Author": "College Freshman",
            "Date": "2012-12-05T12:09:30.033Z"
        },
        {
            "Rating": 5,
            "Review": "This is literally the best school in the world. You receive an excellent education. While the classes are hard, it is worth it in the end",
            "Author": "College Freshman",
            "Date": "2012-12-05T12:07:15.983Z"
        },
        {
            "Rating": 5,
            "Review": "Do Whatever Major You Can – Caltech has no application process for majors, so the only thing limiting your ability to graduate with a degree is your ability to do the work to get said degree.",
            "Author": "College Freshman",
            "Date": "2012-03-11T18:49:29.733Z"
        }
    ],
    "Campus": [
        {
            "Rating": 3,
            "Review": "Facilities are fine. We would like more places to work together besides houses and libraries.",
            "Author": "College Junior",
            "Date": "2014-07-07T17:00:26Z"
        },
        {
            "Rating": 5,
            "Review": "Each day is sunny and warm to me! No matter what the weather really is. I am in a great school, doing great things to change my life! What more can I want?",
            "Author": "College Junior",
            "Date": "2014-01-23T18:45:48Z"
        },
        {
            "Rating": 3,
            "Review": "Okay I guess. I don't use this because I drive in from another town.",
            "Author": "College Junior",
            "Date": "2014-01-23T18:38:46Z"
        },
        {
            "Rating": 5,
            "Review": "Everything that they have their is pretty up dated. They keep up with the times.",
            "Author": "College Junior",
            "Date": "2014-01-23T18:36:29Z"
        },
        {
            "Rating": 3,
            "Review": "I am  not into night life that much. When I do stopping down their or eat out. the locals are great. Modesto has alot to offer.",
            "Author": "College Junior",
            "Date": "2014-01-23T18:34:57Z"
        },
        {
            "Rating": 4,
            "Review": "I drive my own car so it doesn't matter if they provide transportation.",
            "Author": "College Junior",
            "Date": "2014-01-03T12:28:36Z"
        },
        {
            "Rating": 4,
            "Review": "The school does not offer a lot of extras but I am there for an education so it does not matter to me.",
            "Author": "College Junior",
            "Date": "2014-01-03T12:27:09Z"
        },
        {
            "Rating": 4,
            "Review": "There is more one on one interaction with all of the teachers.",
            "Author": "College Junior",
            "Date": "2014-01-03T12:27:09Z"
        },
        {
            "Rating": 4,
            "Review": "I have been here for over 10 years and I love it but don't know if I will stay. I have two young children and do not want to raise them around all the crime.",
            "Author": "College Junior",
            "Date": "2014-01-03T12:25:50Z"
        },
        {
            "Rating": 4,
            "Review": "I love California weather. It does get cold in the classroom sometimes.",
            "Author": "College Junior",
            "Date": "2014-01-03T12:21:50Z"
        },
        {
            "Rating": 4,
            "Review": "There are no permit costs and I have never gotten a ticket. I can always find a parking spot close to my classroom.",
            "Author": "College Junior",
            "Date": "2014-01-03T12:19:20Z"
        },
        {
            "Rating": 5,
            "Review": "Where I live, It's kind of a small town so you can ride your bike easily to places and there are lots of buses to be able to get where you need to go. I live here and have my own car, and I know traffic really well so it's super easy for me to get around and be able to judge how long it where take me to get from point A to point B.",
            "Author": "College Senior",
            "Date": "2013-10-10T17:55:18Z"
        },
        {
            "Rating": 4,
            "Review": "Caltech's student life is great! As a community of undergraduate students we know how to work hard and play hard. Of course, this involves pulling pranks and doing crazy things with each other and upholding traditions that have been going on for decades. However, recently administration has been cracking down on the students' activities so that's why I wouldn't give this an A+. If we were allowed to really express ourselves then I'd give it an A+. Because who doesn't want to live in houses like in Harry Potter?",
            "Author": "College Junior",
            "Date": "2013-05-21T22:12:25.007Z"
        },
        {
            "Rating": 5,
            "Review": "The computer system at the school is one of the best that I have had the pleasure of being able to use. The systems are fast up kept and they rarely have issues.",
            "Author": "College Junior",
            "Date": "2013-02-07T20:16:25.287Z"
        },
        {
            "Rating": 5,
            "Review": "The campus is clean, green and filled with amazing professionals to help you achieve.",
            "Author": "College Junior",
            "Date": "2013-01-27T23:08:18.903Z"
        },
        {
            "Rating": 5,
            "Review": "I have been treated with the up most respect. I am also attending another college in order to purse all of my achievements. IOT has helped me aspire my goals as they see how hard I am working to get there.",
            "Author": "College Junior",
            "Date": "2013-01-27T23:03:55.137Z"
        },
        {
            "Rating": 5,
            "Review": "They bend over backwards to help you peruse your goals.",
            "Author": "College Junior",
            "Date": "2013-01-27T22:58:34.067Z"
        },
        {
            "Rating": 4,
            "Review": "The older facilities look a bit boring on the outside, but there is tons of lab space on the interior and all the classrooms and libraries feel well designed. The newer buildings (like Annenberg) are very open, inviting, and well-designed. The athletic facilities are amazing for a Division III school and are pretty new. There are plenty of quads and lots of really interesting trees that make for nice scenery.",
            "Author": "College Freshman",
            "Date": "2013-01-15T12:48:39.147Z"
        },
        {
            "Rating": 3,
            "Review": "Pasadena is pretty little town with a surprisingly large number of diverse restaurants and shops. Students have access to a variety of stores even within walking distance of the campus. It is very safe as Pasadena is a rather small college town, hosting not only Caltech but also Pasadena City College (PCC). For more urban attractions, LA is only a 30 minute drive away and metro/public transportation is also accessible (albeit, a bit more time-consuming).",
            "Author": "College Freshman",
            "Date": "2013-01-09T17:58:16.617Z"
        },
        {
            "Rating": 5,
            "Review": "There is wireless access all over the campus so students can work anywhere they would like, indoors or outdoors. The wifi is quite reliable and fast although occasional short-term breaks will occur. The libraries carry enough computers all with the latest softwares in the typical format of large clusters and in the format of individual workstations. Each house has its own computer room equipped with color printers.",
            "Author": "College Freshman",
            "Date": "2013-01-09T17:54:49.237Z"
        },
        {
            "Rating": 5,
            "Review": "I love the atmosphere. The staff is very friendly and are willing to help you in any way possible. They provide a lot of resources for their students in order to make sure they are a success in their field of study. The students are also very friendly and welcoming as well. I would highly recommend this school to anyone interested in furthering their education.",
            "Author": "College Senior",
            "Date": "2012-11-28T00:19:12.67Z"
        },
        {
            "Rating": 3,
            "Review": "The weather is usually pretty decent but in the summer it can be very hot in the kitchens.",
            "Author": "Recent Alumnus",
            "Date": "2012-10-12T17:50:41.143Z"
        },
        {
            "Rating": 4,
            "Review": "The student career services go out of their way to make sure the students are happy with placement.",
            "Author": "College Senior",
            "Date": "2012-10-08T22:49:38.793Z"
        },
        {
            "Rating": 5,
            "Review": "Mixed diversity, friendly environment, Excellent teachers.",
            "Author": "College Senior",
            "Date": "2012-10-08T22:45:50.647Z"
        },
        {
            "Rating": 4,
            "Review": "No Need for Transport on Campus – Campus is 1 sq mile. You really don't need any transport to get around. For going outside, there are buses and the metro is not too far away. Going to LA is easy with Metro Gold Line, though going to other cities may be a hassle because the LA/ Pasadena public transport system is not  the best.",
            "Author": "Recent Alumnus",
            "Date": "2011-09-29T12:31:46.56Z"
        },
        {
            "Rating": 4,
            "Review": "Great Network and Computer Availability – Every house has its own computer lab along with available computers at the libraries.  For enrolled students there is wireless internet available that is extremely fast.  Likewise, for guests and visitors it is easy to access free wifi.  Personal Computers are necessary to access the web with ease.  But computer labs and printers are easily available.",
            "Author": "College Sophomore",
            "Date": "2011-09-21T00:57:01.73Z"
        },
        {
            "Rating": 4,
            "Review": "Southern California – The weather is amazing here - it never snows, and rarely rains. 60 degrees is considered cold here, although the summers can get really hot.",
            "Author": "College Freshman",
            "Date": "2011-02-23T00:34:59.443Z"
        }
    ],
    "Value": [
        {
            "Rating": 5,
            "Review": "Bro, it's Caltech. Coming back here to get his PhD in physics was some kid's fallback plan.",
            "Author": "College Sophomore",
            "Date": "2014-07-14T19:45:40Z"
        },
        {
            "Rating": 5,
            "Review": "These Ladies are awesome. It was simple and easy. They answer any questions you have, if they don't know the answer. They find it. Most of all it was very comfortable to do.",
            "Author": "College Junior",
            "Date": "2014-01-23T18:24:05Z"
        },
        {
            "Rating": 3,
            "Review": "They don't give much direction in the way of getting scholarships.",
            "Author": "College Junior",
            "Date": "2014-01-03T12:27:57Z"
        },
        {
            "Rating": 4,
            "Review": "From What I Hear – Financial aid is fair and readily available.  Work Studies are available and do not affect school work.  But I have no experience",
            "Author": "College Sophomore",
            "Date": "2011-09-21T01:03:57.243Z"
        }
    ],
    "Food": [
        {
            "Rating": 3,
            "Review": "\"It's ... okay.\" This is the line everyone says, and it's very accurate.",
            "Author": "College Freshman",
            "Date": "2015-05-14T00:54:14Z"
        },
        {
            "Rating": 3,
            "Review": "Decent, basically only Lake accessible without a car",
            "Author": "College Freshman",
            "Date": "2015-04-18T01:07:10Z"
        },
        {
            "Rating": 4,
            "Review": "Lots of options in Chandler (and the South kitchen), but dinner is subpar",
            "Author": "College Freshman",
            "Date": "2015-04-18T01:00:50Z"
        },
        {
            "Rating": 4,
            "Review": "Food in Pasadena is expensive, but good.",
            "Author": "College Freshman",
            "Date": "2015-04-07T22:11:41Z"
        },
        {
            "Rating": 3,
            "Review": "Handful of restaurants in the area give us decent variety. Not a lot of options late night.",
            "Author": "College Junior",
            "Date": "2014-07-07T17:01:17Z"
        },
        {
            "Rating": 5,
            "Review": "their are many places to buy food around the school area, and it is not just fast food. They have many sit down dining places in that area.",
            "Author": "College Junior",
            "Date": "2014-01-23T18:15:28Z"
        },
        {
            "Rating": 3,
            "Review": "For college students, there's not much food available after 9pm on the weekdays, which is when we're studying and actually want food. Otherwise, the variety of food is not very good. If you have a car, it's much easier to find good food in neighboring cities. I do have to say that Corner Bakery has great food and caters!",
            "Author": "College Junior",
            "Date": "2013-05-21T22:06:59.093Z"
        },
        {
            "Rating": 3,
            "Review": "At the institute of technology they offer a few stocked vending machines with snacks soda .They do provide free bottled water for refreshments during the study hours.",
            "Author": "College Junior",
            "Date": "2013-02-07T20:18:47.56Z"
        },
        {
            "Rating": 3,
            "Review": "There are multiple restraunts with in a four block radius of the college. there is apple-bees, logans road house, Marie calenders, pizza hut, round table,holiday inn, cattleman, inter-national house of pan cakes, Denny, jack in the box, black bear dinner, burger-king McDonald, carls jr. these all are great establishments with very reasonable prices, great family atmosphere. I would rec amend all these establishments for a fine dinning exsperiance",
            "Author": "College Junior",
            "Date": "2013-02-07T20:08:18.12Z"
        },
        {
            "Rating": 3,
            "Review": "The break room has a lot of choices. It is also very convenient. I really enjoy it.",
            "Author": "College Senior",
            "Date": "2012-11-28T00:12:58.02Z"
        },
        {
            "Rating": 3,
            "Review": "Acommodating for Vegetarians – If you live on campus, you have to eat in the dining halls. In the last couple of years, the school has been making an effort to make it vegetarian and vegan-friendly, with special chefs preparing vegan food. They have a nice balance of protein etc, though there is not much choice (usually there is one vegan entree per day). But, there is also a good selection of fruit and veggies, so if you're not picky, you really can't complain!",
            "Author": "Recent Alumnus",
            "Date": "2011-09-29T12:26:31.413Z"
        }
    ],
    "Housing": [
        {
            "Rating": 4,
            "Review": "You're guaranteed off-campus housing if you want it. Also, \"off-campus\" means \"across the street from your classes\" still, so you're fine there.",
            "Author": "College Freshman",
            "Date": "2015-05-14T01:06:27Z"
        },
        {
            "Rating": 3,
            "Review": "The House system is fantastic. Really it basically renders the quality of actual on-campus housing irrelevant. :D You have to live on campus for the first year anyway.",
            "Author": "College Freshman",
            "Date": "2015-05-14T00:52:42Z"
        },
        {
            "Rating": 4,
            "Review": "The housing system is definitely unique",
            "Author": "College Freshman",
            "Date": "2015-04-18T00:59:16Z"
        },
        {
            "Rating": 3,
            "Review": "A lot of people like living in the houses on campus, but off campus housing is cheaper and does not force you to be on the board plan, which is really good.",
            "Author": "College Junior",
            "Date": "2014-07-07T16:57:56Z"
        },
        {
            "Rating": 3,
            "Review": "Their are alot of places to live in Modesto. Finding something in your budget should not be to hard.",
            "Author": "College Junior",
            "Date": "2014-01-23T18:21:59Z"
        },
        {
            "Rating": 4,
            "Review": "I live only a few miles away from campus and it is an ok area.",
            "Author": "College Junior",
            "Date": "2014-01-03T12:33:44Z"
        },
        {
            "Rating": 3,
            "Review": "there are multiple apartment complex's reachable. There is a great bus system and all other forms for transportation. The cost is low and very reliable.",
            "Author": "College Junior",
            "Date": "2013-02-07T20:14:34.383Z"
        }
    ]
}