{
    "Overall%20Experience": [
        {
            "Rating": 5,
            "Review": "I love the small community and the people from many different cultures.  I like my dorm right across from the center of campus and its proximity to the football fields, where I train every day. I like the food options available and the student events on the weekends.",
            "Author": "Freshman",
            "Date": "2025-02-24T20:49:27.454847Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth is simply the most wonderful undergraduate experience I could imagine. \nI’m from a large city and attended a public high school where people rarely went off to schools like Dartmouth. When I first arrived on campus, I was nervous. Since then, I’ve found an incredibly beautiful and caring community made up of remarkable individuals. Dartmouth has everything you’d expect it to: incredible faculty, small, (sometimes extremely) rigorous classes, excellent facilities, and an endless number of academic and career opportunities. It also has a many things you wouldn’t expect: its own skiway, outdoor lodges, countless traditions, and a very active social life, to name a few. The result is an experience where you live and learn in an incredibly enriching community, all in the pristine backdrop of the Upper Valley. In every sense, it lives up to its ascribed ideal of the “College on the Hill”.",
            "Author": "Junior",
            "Date": "2025-02-21T16:36:59.711003Z"
        },
        {
            "Rating": 5,
            "Review": "Amazing academic and social college experience. There is always work to be done to improve any institution, but it is very possible to find academic support, funding for opportunities you are passionate about, and great friends here.",
            "Author": "Alum",
            "Date": "2025-02-08T23:04:09.443539Z"
        },
        {
            "Rating": 5,
            "Review": "Overall going to Dartmouth was the best decision I ever made. The undergraduate experience was irreplaceable and now, 2 years out of school, I miss it all the time. It was an incredible campus surrounded by nature and brilliant professors from all over the world. A key memory was taking an Arabic class as a senior with only 3 people in it - Dartmouth is committed to advancing language skills even if class sizes may make it unprofitable for them. The student community is tight-knit and alumni connectivity is unrivalled, if you call, they will answer every time. What I would like to see change is an increase in international student body (currently only 10%).",
            "Author": "Alum",
            "Date": "2025-02-03T19:56:35.267919Z"
        },
        {
            "Rating": 5,
            "Review": "Overall, my experience has been great so far! There are many social events, engaging classes, incredible diversity, and more. Housing is okay, and there's usually construction going on. It's a welcoming community. It's kind of rural — the most to do is party or other (usually Collis-hosted) events.",
            "Author": "Freshman",
            "Date": "2025-01-10T15:44:11.195866Z"
        },
        {
            "Rating": 5,
            "Review": "Loving Dartmouth so far! The best education you can get as an undergraduate and the social scene is top notch!",
            "Author": "Freshman",
            "Date": "2024-12-27T04:17:35.424747Z"
        },
        {
            "Rating": 5,
            "Review": "There is no school quite like Dartmouth College. The blend of a research university with an intense focus on the liberal arts makes Dartmouth unique in it's academic focus. The community is warm and welcoming which makes the college experience all the better.",
            "Author": "Freshman",
            "Date": "2024-12-02T17:17:32.79591Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth has been incredible. It’s a really small school, and that makes the experience so unique - you really get to know your class, and you see your friends everywhere you go on campus. The dedication that the professors have to their students is incredible. They are all there mainly to teach undergraduate students, and you can tell. The profs take their time to learn about you and your individual interests, and the small classes help facilitate this dynamic. While Hanover can feel isolated sometimes, my overall experience at Dartmouth has been better than I could have ever hoped for.",
            "Author": "Sophomore",
            "Date": "2024-12-01T02:50:32.152739Z"
        },
        {
            "Rating": 5,
            "Review": "It was fun. It was fun. It was fun. It was fun. It was fun. It was fun. It was fun. It was fun. It was fun. It was fun.",
            "Author": "Freshman",
            "Date": "2024-10-17T13:19:45.985934Z"
        },
        {
            "Rating": 4,
            "Review": "My overall experience at Dartmouth College has been incredibly enriching. The close-knit community here is something I deeply appreciate. It’s a place where you feel supported, not just by your peers but also by faculty and staff who are genuinely invested in your success. The 10-week term system is fast-paced but keeps you constantly engaged and learning. \n\nWhat I love most about Dartmouth is the access to nature—it’s a place where I can hike, ski, and take advantage of the beautiful outdoors while also diving deep into my studies. The community is diverse and offers the chance to meet people from so many different backgrounds, enriching the overall college experience. From being involved in extracurriculars like the Nathan Smith Society and the Women in Science Project to living with my sorority sisters, there’s never a dull moment. It’s a place where you’re constantly challenged, but in the best way possible.",
            "Author": "Junior",
            "Date": "2024-10-14T03:38:47.896473Z"
        },
        {
            "Rating": 5,
            "Review": "At Dartmouth, undergraduates enjoy the best of both worlds: the supportive, tight-knit environment of a small liberal arts college AND the top-tier resources and opportunities of a larger research institution. If you're undecided about your major, Dartmouth is an ideal choice because you may take classes across any department, including engineering, without needing to go through any administrative hoops or separate admissions processes — a freedom that many schools don't offer.\n\nLike many top-tier universities, Dartmouth’s professors are involved in cutting-edge research. However, what sets Dartmouth apart is its faculty’s commitment to students. In the Engineering Department, for example, professors often offer six hours of office hours per week (even if there are only four students in the class)! This abundance of 1-on-1 support not only enriches one's experience with learning course material, but also allows students to forge strong working relationships with professors.",
            "Author": "Alum",
            "Date": "2024-08-22T10:01:12.259664Z"
        },
        {
            "Rating": 5,
            "Review": "Revolutionized my life. Incredible opportunities and students all around me engaged in creative outlets of their own choice. Dartmouth wants you to be yourself, in the best way possible, and opened up doors for me in the friends I made and the career I've had.",
            "Author": "Alum",
            "Date": "2024-07-20T03:23:11.607935Z"
        },
        {
            "Rating": 4,
            "Review": "I believe that Dartmouth College provides every opportunity to have an enriching and enjoyable experience as long as you advocate for your own interests. In particular, the quantity and quality of activities that utilize the beautiful natural locations all around the campus cannot be understated. It is possible to find a supportive social circle within and outside of the greek system. Academic experiences vary by department, but in general professors are supportive and empathetic while still encouraging intellectual growth.",
            "Author": "Alum",
            "Date": "2024-07-11T18:56:10.993248Z"
        },
        {
            "Rating": 3,
            "Review": "It was actually really challenging academically for me. It depends on your academic background going in. If you went to prep schools, and do a non-STEM major, you may have a better time academically, than if you're pursuing premed studies or are an engineering major or something. \nNew Hampshire is also a very white! And Dartmouth is also in a rural area, that's kinda far from most things to do. If you love outdoors stuff, you'll love it here. Dartmouth is very, very pretty in ALL seasons too. Parties are what most students do on their weekends to wind down, so if that's your vibe, loads of fun! professors are also really nice, eager to help and open!",
            "Author": "Alum",
            "Date": "2024-06-02T01:28:37.480043Z"
        },
        {
            "Rating": 4,
            "Review": "Overall, I had a great experience at Dartmouth. I was very immersed in campus activities including sports and the arts. I was also able to travel abroad. My professors were great overall, and I felt prepared for the professional world for the most part when I graduated.",
            "Author": "Alum",
            "Date": "2024-05-24T22:13:15.059917Z"
        },
        {
            "Rating": 4,
            "Review": "My experience at Dartmouth has been great so far. The education is high quality and so are the professors. There are great opportunities for practical work and research. And the student body and campus life is lively and welcoming. The university is not perfect and the frat culture is very big here, but it is a wonderful place to be.",
            "Author": "Sophomore",
            "Date": "2024-05-13T17:26:08.122407Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth is simply the best place to get an undergraduate education. It's such a special place with so many amazing students and professors. The location means that you'll get really tight knit with your peers. My friends here will definitely be at my wedding; they're so brilliant yet fun and down to earth. The terms go by quickly because they're just so much fun. It's obvious why alums go absolutely crazy for this place: there's truly nowhere else like it.",
            "Author": "Freshman",
            "Date": "2024-03-23T01:04:57.308015Z"
        },
        {
            "Rating": 5,
            "Review": "Transformative experience in every way. It isn't easy to adjust at first but it get's great. Would recommned.",
            "Author": "Freshman",
            "Date": "2024-03-21T02:01:37.172398Z"
        },
        {
            "Rating": 5,
            "Review": "Small discussion based classes taught by brilliant professors who are fully invested in your undergraduate education, fun tight knit community with students who support each other, beautiful campus with limitless outdoor opportunities all around you, best four years of my life.",
            "Author": "Alum",
            "Date": "2024-03-19T23:09:35.017376Z"
        },
        {
            "Rating": 5,
            "Review": "Great school! Not super diverse, but it’s easy to find your people. Profs are for the most part amazing and super inspirational. Definitely less competitive than the other Ivies. I have truly had the best time here and gotten to come out of my shell.",
            "Author": "Freshman",
            "Date": "2024-02-21T07:15:13.25786Z"
        },
        {
            "Rating": 5,
            "Review": "I treasure my time spent at Dartmouth. The College is nestled in a quiet town, surrounded by mountains. It is a close-knit community smaller than my huge public high school, where you could get to know your professors, easily join or start any club, or have a snowball fight with the smartest people you've ever met.",
            "Author": "Alum",
            "Date": "2024-02-04T17:36:15.444916Z"
        },
        {
            "Rating": 5,
            "Review": "Gorgeous campus. Everyone seems really friendly both on campus and off-campus. Excellent school for anyone wishing to dedicate themselves to serious studies.",
            "Author": "Freshman",
            "Date": "2024-01-06T17:50:51.023824Z"
        },
        {
            "Rating": 4,
            "Review": "Sometimes it’s very difficult to keep up with the pace of the 10 week terms— especially in STEM classes. The people/ community are very kind and not overly competitive with each other, which is nice.",
            "Author": "Sophomore",
            "Date": "2024-01-03T01:58:04.178046Z"
        },
        {
            "Rating": 4,
            "Review": "I liked the academic rigor and dedication the college had towards fostering a superior undergraduate learning experience. I would have appreciated greater efforts in creating alternative social spaces that were not related to the fraternity/sorority system.",
            "Author": "Alum",
            "Date": "2023-12-23T01:22:40.813571Z"
        },
        {
            "Rating": 5,
            "Review": "It's a place like no other. My favorite part of this school is the close knit community that you can find. Regardless where you are, you are more than likely to run into someone that you know. I've met some of the most interesting people here - everyone has their own unique background and aspects to make them interesting. As someone extremely outdoorsy, Dartmouth's location and campus culture is perfect for me.",
            "Author": "Freshman",
            "Date": "2023-11-14T04:40:43.360331Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth is a wonderful college. There is such an amazing community here at Dartmouth. Due to the relatively small class size, even though you are a freshman, you can make connections with other people very quickly. Furthermore, our education is remarkable, as it is an Ivy League school. There are numerous class options to pursue and the liberal arts program makes it easy to discover a field you truly love. Finally, there is a number of extracurricular activities that you can participate in, allowing you to explore different options and find something that you enjoy.",
            "Author": "Freshman",
            "Date": "2023-10-28T17:39:17.244817Z"
        },
        {
            "Rating": 4,
            "Review": "I have enjoyed my time there because of the community and friends I have made. I will always remember the incredible professor here too.",
            "Author": "Junior",
            "Date": "2023-10-27T20:22:03.647985Z"
        },
        {
            "Rating": 4,
            "Review": "I like the community of Dartmouth College. Here you feel a strong sense of belonging no matter where you come from. Student are nice and they are little actions that show the strength of the community here like holding a door open for someone, and passing to a person you don't know and say hi. However, education system is something that needs to be changed. Here students targets grade rather than knowledge. This system of education prohibits curiosity and motivation as students only struggles for perfect GPA.",
            "Author": "Freshman",
            "Date": "2023-10-05T12:36:30.587562Z"
        },
        {
            "Rating": 4,
            "Review": "As a Dartmouth student, I've been immersed in a transformative academic environment. The close-knit community fosters meaningful interactions with professors and peers. Experiential learning opportunities have allowed me to apply classroom knowledge in real-world settings. The campus seamlessly blends tradition with innovation, offering top-notch facilities. Beyond academics, a diverse range of student organizations and clubs enrich personal growth. The mentorship of dedicated professors has been invaluable. Dartmouth has not only provided an exceptional education but instilled a lifelong commitment to intellectual curiosity and positive impact. This experience will shape both my career and outlook on life.",
            "Author": "Freshman",
            "Date": "2023-09-10T18:50:33.064682Z"
        },
        {
            "Rating": 5,
            "Review": "I've loved everything about Dartmouth. The community is small and tight knit and it really feels like I am known and cherished by staff and administration alike. Classes are small and offer the ability to form networks with faculty that many other schools do not offer due to size. This has opened many doors for additional education and employment",
            "Author": "Sophomore",
            "Date": "2023-08-30T22:18:50.414324Z"
        },
        {
            "Rating": 4,
            "Review": "The school is in the middle of nowhere. SO, the school community is very close, and the people are very approachable. It is a very walkable town/campus, and so it is easy to get to classes. The town of Hanover has a lot of restaurants, but also a lot of old people. SO, most of the activities are really just on campus. Since Dartmouth owns a lot of land in the area, the outdoor scene is fantastic. If you are into hiking, climbing, kayaking, and anything else outdoors-adjacent, it is the perfect spot.",
            "Author": "Senior",
            "Date": "2023-08-01T21:16:34.694018Z"
        },
        {
            "Rating": 4,
            "Review": "I love the academics at Dartmouth. The professors take education personally; the number of one-on-one office hours and meals I have had with faculty is genuinely amazing. From the advisors to the TAs and the professors, I feel extremely supported in my pursuit of higher education. \nThe athletics at Dartmouth are also a significant part of my experience there. Between classes and studying, I am an epeeist on the Fencing Team and a member of the Triathlon Team. I love taking advantage of the nearby mountains for hiking trips and the river for canoeing with friends. \nOverall, I find Dartmouth to be a nurturing and challenging community for both mind and body.",
            "Author": "Sophomore",
            "Date": "2023-07-18T19:33:40.291214Z"
        },
        {
            "Rating": 5,
            "Review": "best college experience in the country! beautiful, academically challenging, fun… great people and campus life",
            "Author": "Alum",
            "Date": "2023-07-01T16:56:15.465957Z"
        },
        {
            "Rating": 4,
            "Review": "Dartmouth is a challenging and prestigious institution. I cannot speak for all the departments, but both Biology and Environmental Studies are full of esteemed faculty and provide opportunities for challenging coursework that will prepare you for a career in these fields. I was not always the biggest fan of the faculty, many of the older professors who were tenured clearly cared little for their students and did not prioritize our learning or knowledge retention. The student body is mainly composed of people from wealthy or otherwise privileged backgrounds, so it was quite a culture shock to someone coming from a background of lower socioeconomic status, and I found many students could be naïve or ignorant at times. But Dartmouth students are passionate about what they do and will fight desperately for causes they believe in. And Dartmouth supplies many opportunities and resources that you won't find at another institution due to its prestige and resources.",
            "Author": "Alum",
            "Date": "2023-06-12T00:18:40.876274Z"
        },
        {
            "Rating": 4,
            "Review": "Dartmouth College is a close-knit community. As a full-ride recipient, I have experienced first-hand the wonderful resources available to low-income, first-generation, and international students.  One of the standout features of Dartmouth is its commitment to inclusivity and diversity. The college offers a variety of programs and resources to support underrepresented students, such as the First Year Student Enrichment Program and the Office of Pluralism and Leadership. However, the dorms could use some improvement. Another factor to consider is the climate. Dartmouth is located in Hanover, New Hampshire, and can get extremely cold, especially for those not accustomed to the winter weather. It is important to come prepared with appropriate clothing and gear.\nDespite its location, Dartmouth students find ways to have fun and engage with the outdoors. The college is surrounded by natural beauty, with opportunities for hiking, skiing, and other outdoor activities.",
            "Author": "Freshman",
            "Date": "2023-04-24T23:51:01.447062Z"
        },
        {
            "Rating": 5,
            "Review": "Great school :) Middle of nowhere but it's a vibe and can be adjusted to. Good social life and alumni connections.",
            "Author": "Freshman",
            "Date": "2023-04-24T10:05:21.110461Z"
        },
        {
            "Rating": 4,
            "Review": "Dartmouth is a beautiful school surrounded with lots of nature. It has a strong sense of community and truly attributes its success and connection to its students and surrounding communities. I believe Dartmouth is the best school.",
            "Author": "Freshman",
            "Date": "2023-04-19T18:45:25.621906Z"
        },
        {
            "Rating": 4,
            "Review": "Professors are for the most part great, but greek life dominates the social scene. It can be difficult to not be a \"mainstream\" student, and a lot of folks feel like they don't belong.",
            "Author": "Senior",
            "Date": "2023-03-29T02:36:30.881298Z"
        },
        {
            "Rating": 5,
            "Review": "Collaborative, wonderful students. Beautiful environment.  top-notch undergraduate, academics. There’s so much to do every season of the year if you were an active out-doorsy person, you will love Dartmouth! \n\nThe professors are incredible and always available to help. Fun, loving, vibrant student body.",
            "Author": "Freshman",
            "Date": "2023-03-22T02:03:01.88786Z"
        },
        {
            "Rating": 5,
            "Review": "perfect, a really good place if you wanna earn some fast experience in the real world and make many new friends.",
            "Author": "Niche User",
            "Date": "2023-02-11T19:33:49.65629Z"
        },
        {
            "Rating": 5,
            "Review": "absolutely beautiful campus and plenty of things to do outside. The class sizes are small and personal.",
            "Author": "Alum",
            "Date": "2023-01-11T15:46:08.219681Z"
        },
        {
            "Rating": 5,
            "Review": "Such a cute little school with a big emphasis on community and inclusivity. I'm a freshman and currently loving my time here at Dartmouth!",
            "Author": "Freshman",
            "Date": "2022-12-26T05:10:41.632085Z"
        },
        {
            "Rating": 3,
            "Review": "Dartmouth is a very interesting place. It is difficult to have fun if you do not party or like to drink. Dartmouth's aid system is also extremely deceptive and not fun to navigate. I have learned a lot, but Dartmouth is a difficult place to adjust to in my experience.",
            "Author": "Freshman",
            "Date": "2022-12-23T14:32:14.93943Z"
        },
        {
            "Rating": 3,
            "Review": "Dartmouth is a great school in a lot of ways, and I love my professors and many of my peers, but can very much be a culture shock if you aren't a wealthy white New Englander.",
            "Author": "Junior",
            "Date": "2022-12-06T04:10:46.803346Z"
        },
        {
            "Rating": 4,
            "Review": "Very self-driven & self-motivated school - it is what you make of it! But there's a lot to make of it, so many opportunities to succeed and be part of a great community.",
            "Author": "Freshman",
            "Date": "2022-11-28T03:16:45.897327Z"
        },
        {
            "Rating": 4,
            "Review": "Really loved the campus and surrounding mountains. It is situated alongside the Connecticut river and offers beautiful views. My only complaint would be to see more diversity on campus. I was a part of the Native Americans at Dartmouth group and it helped shape my experience and offer a place to meet friends from all across the US.",
            "Author": "Senior",
            "Date": "2022-10-06T22:40:35.908002Z"
        },
        {
            "Rating": 5,
            "Review": "I love Dartmouth College, it has a huge Native American program and provides great resources for my community. However, financial aid is terrible if your family have any assets; even if your family can not those assets at said time of financial aid application.",
            "Author": "Sophomore",
            "Date": "2022-10-05T11:06:52.941421Z"
        },
        {
            "Rating": 5,
            "Review": "As a resident from a low income, Hispanic community, my transition at Dartmouth was not smooth. Location in the middle of the woods helped me embrace the outdoors as it exposed me to a close knit community. The professors care profoundly about their students and invest a lot of time and interest into their profession.",
            "Author": "Graduate Student",
            "Date": "2022-07-30T22:51:19.767941Z"
        },
        {
            "Rating": 4,
            "Review": "Dartmouth is a wonderful place where you can find a community like no other! Its campus is very small; I've been able to walk from one side of campus to the other in only about 15 minutes. The campus's small size allows for students to meet with each other very frequently, allowing for interactions you won't get anywhere else. The campus is also very beautiful, and students are able to access natural bodies of water and landscapes easily. The academics and resources are top notch, with (usually) small class sizes, an undergraduate focus, and a large alumni network. However, there are a few possibly negative things to note before choosing Dartmouth. The weather is very spontaneous and can get down to the negative degrees Fahrenheit in the winter. The area is very rural as well, so you have limited choices on where you can go. Greek Life is very emphasized on campus, but not everybody participates in it. Overall, even though Dartmouth may have its flaws, I don't regret choosing it.",
            "Author": "Freshman",
            "Date": "2022-06-30T02:21:27.368126Z"
        },
        {
            "Rating": 5,
            "Review": "It has definitely been a big adjustment but the school is pretty good overall. Academics are tough and you definitely need to put a lot of study time in.",
            "Author": "Sophomore",
            "Date": "2022-06-20T02:54:30.908933Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth College is a wonderful university. The professors really do care about helping you learn and the study body is, for the most part, more collaborative than competitive. It is a great place to explore both your academic and extracurricular passions.",
            "Author": "Sophomore",
            "Date": "2022-06-16T18:24:41.878212Z"
        },
        {
            "Rating": 5,
            "Review": "I am  a transfer student athlete and am planning to attend Dartmouth in the fall. What I loved on my visit was the family atmosphere amongst the faculty and the close relationships they had with their students. I believe that it is important to put an emphasis on undergraduate education and Dartmouth does that the best in comparison to any other school in the nation. From an athletic standpoint I feel like Dartmouth has all the tools and facilities to help me achieve my athletic goals. Coming from an institution that gives athletic scholarships, Ivy leagues do not have that availability. I felt like the experiences and relationships that I would build would make it worth it to apply for scholarships online. Thank you!",
            "Author": "Junior",
            "Date": "2022-05-24T19:42:33.930065Z"
        },
        {
            "Rating": 5,
            "Review": "beautiful campus and vibe. wish it was closer to boston or any city. difficult academics but great networking.",
            "Author": "Sophomore",
            "Date": "2022-05-24T02:02:59.193242Z"
        },
        {
            "Rating": 5,
            "Review": "The best undergraduate education in the country. Dartmouth professors really care about their students. Amazingly talented and well-rounded student body. Very collaborative environment. Alumni loyalty and network is unparalleled.",
            "Author": "Alum",
            "Date": "2022-04-05T08:06:40.986796Z"
        },
        {
            "Rating": 4,
            "Review": "The students and professors were amazing, but the isolating location and climate were very depressing. There weren't a lot of food options, and over the years, they became less and less.",
            "Author": "Alum",
            "Date": "2022-03-21T21:34:59.189437Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth is such an awesome time. From your intro classes to the most demanding ones, every single one is taught by a professor. My professors cared and knew everyone's name in every one of my classes, save one 300 person lecture. \n\nThe school certainly has a lot of competition and you are pushed to perform, but you will graduate and be well- equipped for life. The school's remote setting means that every person working and studying at Dartmouth is there for the school itself, and ensures that you will receive the best education to become a responsible citizen. \n\nSure, Harvard or Stanford are ranked higher by US News, or have more prestige in the commoners' opinions, but having worked and been surrounded by those alumni, Dartmouth prepares my peers for a life well lived better than most any other school. Maybe it's something in the water in Hanover that makes us love it so much...",
            "Author": "Alum",
            "Date": "2022-03-10T06:31:26.058673Z"
        },
        {
            "Rating": 5,
            "Review": "This was my reach grad scvhool, and I got in- sooo glad I'm here! I wasn't sure about it, do to it's somewhat isolated location, but the education I've received has been outstanding!",
            "Author": "Graduate Student",
            "Date": "2022-02-11T02:28:23.19337Z"
        },
        {
            "Rating": 5,
            "Review": "My professors were amazing and the level of access and commitment was extraordinary.   The campus is beautiful and there is so much to do.   I have remained friends with so many classmates over many many years.  It’s a special bond.",
            "Author": "Alum",
            "Date": "2022-02-05T23:43:01.887328Z"
        },
        {
            "Rating": 4,
            "Review": "I am a current freshman at Dartmouth. I love the atmosphere, the people, and the tight-knit learning environment. The Native American community is also really strong and that is really helpful when being far away from home gets hard. One negative thing is that the median of the classes you take are put into your transcript next to the grade you received. So if you got a grade that is lower than the median, your future employer/grad school admissions will see.",
            "Author": "Freshman",
            "Date": "2021-12-31T07:06:01.016959Z"
        },
        {
            "Rating": 5,
            "Review": "The campus is breathtaking, the friends-terrific overall. While making the decision between Harvard, Dartmouth, Yale or Brown, I am glad I have chose Dartmouth. The college also offers a good business education with a wide array of disciplines that will prepare you for a career in any field of industry you choose.",
            "Author": "Alum",
            "Date": "2021-10-14T15:42:49.74591Z"
        },
        {
            "Rating": 5,
            "Review": "I loved everything about Dartmouth: the community, the location, the people. I would do anything to go back and am a very proud alum.",
            "Author": "Niche User",
            "Date": "2021-01-16T17:45:30.172379Z"
        },
        {
            "Rating": 5,
            "Review": "Would not have wanted to go anywhere else! I have loved my time at Dartmouth. Great education and students.",
            "Author": "Senior",
            "Date": "2020-07-07T13:03:32.777414Z"
        },
        {
            "Rating": 5,
            "Review": "The professors are some of the best in the world. It's a small college in a beautiful setting: close-knit, challenging, and deeply engaged in things that matter.",
            "Author": "Alum",
            "Date": "2020-06-03T03:20:30.805243Z"
        },
        {
            "Rating": 4,
            "Review": "I have really liked Dartmouth so far. I have met some amazing people from my freshmen dorm, and can't wait to return sometime soon. Academics are tough but rewarding, and most profs seem pretty accommodating and helpful.",
            "Author": "Freshman",
            "Date": "2020-04-17T14:08:44.88162Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth, in the Ivy League, is simply different. The atmosphere is more constructive and personal, as the size of the graduating classes are smaller. But this does not mean that there are less opportunities! Dartmouth's graduate schools are incredible, so if you have the desire to study for a graduate degree, there are opportunities to enter into one of these elite graduate schools at the end of your undergraduate study. Socially, it is also an excellent school. I highly recommend Dartmouth if you wish to have a bright future.",
            "Author": "Niche User",
            "Date": "2020-04-04T14:52:10.502556Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth is a great mix of rewarding academics and a close, social community. Being in the small town of Hanover creates a tight knit community, although also fosters a bubble that is often unaware of the \"outside world\". It has easy access to the outdoors and a generally athletic student body.",
            "Author": "Freshman",
            "Date": "2020-03-31T00:43:46.43461Z"
        },
        {
            "Rating": 5,
            "Review": "It is hard to imagine a better college than Dartmouth. The mix of academics, clubs and outdoor activities, and social scene is (in my opinion) unparalleled. Everyone is academically driven, and I feel like I can have an intellectual conversation with anyone on campus. There is a sport, club, or outdoor activity for everyone at the college, as most people I know are heavily involved in at least 2 extracurricular clubs. Lastly, the social scene is fun and inclusive. There are different frats and sororities for different all types of preferences, and every house has an \"open door\" policy. There is little to no social hierarchy that I've noticed (Football players aren't treated differently from comp sci geeks), making it so that anyone can be friends with anyone. \n\nOne additional note: sophomore summer is the best term of all time! Look it up.",
            "Author": "Junior",
            "Date": "2020-02-27T16:36:27.915779Z"
        },
        {
            "Rating": 5,
            "Review": "I am very excited to start at Dartmouth this fall and absolutely love being on campus because it feels like home.",
            "Author": "Freshman",
            "Date": "2020-02-16T01:44:56.395883Z"
        },
        {
            "Rating": 5,
            "Review": "From only being on the campus a few times, I can easily say that the atmosphere on campus is amazing. From sitting on the Green to socializing within the tightly-knit student-body, Dartmouth is one of the best schools within the east coast. I'm so glad I have the opportunity to attend this coming fall!",
            "Author": "Niche User",
            "Date": "2020-02-02T19:37:00.794429Z"
        },
        {
            "Rating": 5,
            "Review": "Diversified Campus. It had the most other Native Americans at the campus compared to other colleges I toured. Very secluded environment and beautiful. Plenty of stuff to do environmentally. Sports are a little lacking but that can be made up for with the academics.",
            "Author": "Freshman",
            "Date": "2020-02-01T04:58:52.098225Z"
        },
        {
            "Rating": 5,
            "Review": "I like the whole student experience. It is a charming little college where you know everyone who goes to school with you. The one thing at dartmouth that I would fix is the need for more food places to eat.",
            "Author": "Sophomore",
            "Date": "2020-01-27T15:32:19.160433Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth has a small teacher to student ratio which encourages intimate learning. The quarter system is however short making it stressful to grasp content",
            "Author": "Freshman",
            "Date": "2020-01-03T08:59:08.63627Z"
        },
        {
            "Rating": 5,
            "Review": "I had high expectations going into Dartmouth at the beginning of freshman year. Now, after just one term, I can say that they were utterly blown away. The College is an amazing school, where academics and connections between professors and students are cherished. I had lunch with a professor earlier and we had a wide-ranging, incredible conversation. The campus itself is astounding in its beauty and traditional nature. Also, the College was accommodating to the utmost degree when I had to return home for a week due to a severe family emergency. But most of all, my fellow classmates and students are what make Dartmouth exceptional. They are all bright, intelligent, thoughtful, and most importantly, filled with compassion. At this moment, I cannot comprehend a better school.",
            "Author": "Freshman",
            "Date": "2019-12-26T13:38:55.071898Z"
        },
        {
            "Rating": 4,
            "Review": "I love the community. Students will build each other up academically, it's not a contest between students. Super inclusive campus",
            "Author": "Sophomore",
            "Date": "2019-12-13T00:23:02.755374Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth is a very prestigious university. There are many resources students can utilize. Additionally, it allows students to come out of their comfort zone since there are so many activities and clubs.",
            "Author": "Niche User",
            "Date": "2019-11-11T04:27:40.625311Z"
        },
        {
            "Rating": 4,
            "Review": "I attended Dartmouth for 2 summers on a college program. I really loved it out there because of how nice everyone was and how beautiful the campus is. The food at the college was great and the dorms were really nice. I got a chance to be able to have a football player and we made a really good bond. I got a chance to meet the head coach train at there field.",
            "Author": "Niche User",
            "Date": "2019-11-05T02:33:53.205044Z"
        },
        {
            "Rating": 3,
            "Review": "There were both positive and negative aspects of my undergraduate years at Dartmouth College. Beginning with enrollment and affordability, Dartmouth College gave me the best financial aid package in comparison to the schools I considered attending. The college did an excellent job of reaching out to answer questions, providing me with peer mentors before enrolling, and giving me the chance to tour the school (without having to pay for it myself). Regarding academics, Dartmouth's student to professor ratio is unmatched by most elite institutions. The ability to meet one on one with professors, enjoy small class sizes, and receive individualized attention in my classes is overall what made my experience and the cost of Dartmouth worth it. However, the college does not do an adequate job preparing or supporting students who come from less rigorous academic backgrounds. Many of the classes my peers had taken were subjects that were not even offered at my high school.",
            "Author": "Alum",
            "Date": "2019-08-01T22:36:30.090835Z"
        },
        {
            "Rating": 4,
            "Review": "Love the tight-knit community; however this isn't a school for everyone, especially for those who prefer big cities and aren't interested in outdoor activities. Professors actually care about you and want you to succeed.",
            "Author": "Senior",
            "Date": "2019-07-25T23:18:03.204342Z"
        },
        {
            "Rating": 5,
            "Review": "Has some awesome people, a very diverse group of individuals that know and accept one another. Very supportive community with awesome professors all around",
            "Author": "Freshman",
            "Date": "2019-06-29T03:24:51.169747Z"
        },
        {
            "Rating": 5,
            "Review": "My experience at Dartmouth was medicinal. It is a luxurious campus surrounded by beautiful nature. The campus is huge, and the student population is small, making for a grand Dead Poet Society experience. This Ivy League school still sticks to traditional values and embraces strong outdoor activities. The courses are challenging and taught by the top minds on the planet. Don’t be surprised to have lunch with a head of state on Tuesday and have drinks with a top scholar on Thursday. This is what a college should be like.",
            "Author": "Alum",
            "Date": "2019-04-10T05:04:47.957923Z"
        },
        {
            "Rating": 5,
            "Review": "Very challenging, but full of people that absolutely love their school. It truly feels like a home and everyone is so welcoming. The social life can be repetitive, but the nightlife is still fun and there are a ton of cool things to do near Hanover. Professors are fantastic, people are smart, and career support is top notch.",
            "Author": "Freshman",
            "Date": "2019-03-30T18:29:45.312697Z"
        },
        {
            "Rating": 4,
            "Review": "One thing that I love about Dartmouth is the tight nit community and the wonderful relationships I have established. I don't like how cutthroat the academic culture is and the unrealistic expectations.",
            "Author": "Senior",
            "Date": "2019-03-26T03:29:49.534359Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth College is more than what I expected when I began here a few years ago.  Because of a health issue, I wasn't able to attend for 2 years and the college was very helpful and encouraging when I was able to return.  Even though I was supposed to graduate in 2018 and now I'll graduate in 2020, I'm still a 2018.  The classes are challenging (of course), but the professors are incredibly motivating and love what they do.",
            "Author": "Junior",
            "Date": "2019-01-22T17:02:46.309679Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth is a great combination of a very rigorous school and a fun place to live with great quality of life. People are extremely dedicated to schoolwork and to their extracurriculars, and students are really exceptional at whatever they do.",
            "Author": "Sophomore",
            "Date": "2018-12-21T23:42:41.434661Z"
        },
        {
            "Rating": 4,
            "Review": "My favorite thing about Dartmouth is that we have a very strong school culture which helped me to transition from high school to college because I had all these weird Dartmouth traditions and practices that made me feel like I was a part of Dartmouth. In the future, I’d like to see Dartmouth make more of an effort to find ways to reach students who aren’t into the quirky Dartmouth traditions, because I think while these traditions are helpful for some students, other students may be a little overwhelmed by it and feel gen more isolated from Dartmouth, in conclusion, I would like to see Dartmouth actively engage students who are often marginalized and on the fringes of Dartmouth community.",
            "Author": "Junior",
            "Date": "2018-09-08T07:44:59.350448Z"
        },
        {
            "Rating": 4,
            "Review": "I am about to embark on college life this fall, and although I have not experienced much of Dartmouth yet, it has been quite rewarding so far. I have already connected with a number of amazing people from all over the world, and have sampled a little of the vast course offerings at Dartmouth. i am super excited to begin my very first term in September!",
            "Author": "Freshman",
            "Date": "2018-08-29T12:27:13.498356Z"
        },
        {
            "Rating": 4,
            "Review": "Dartmouth is providing me with an unmatchable opportunity to pursue a prestigious education that will allow me to excel and exceed any and all expectations while accomplishing my goals.",
            "Author": "Sophomore",
            "Date": "2018-08-15T21:03:36.32882Z"
        },
        {
            "Rating": 5,
            "Review": "Great school. I wish Dartmouth spent more of its endowment on housing. Dorms are pretty old, but there are lots of grants for students to start their own startups etc. Teaching is amazing, probably most undergraduate focused among the Ivies.",
            "Author": "Sophomore",
            "Date": "2018-07-28T18:40:13.928751Z"
        },
        {
            "Rating": 4,
            "Review": "I like the small student body and faculty to student ratio, the small class sizes allow for greater classroom learning from peers and professors.",
            "Author": "Sophomore",
            "Date": "2018-07-20T17:19:11.181312Z"
        },
        {
            "Rating": 4,
            "Review": "I think in the end, I look back and love the time I've spent at this school, because I've grown so much as a person compared to when I first got here: emotionally, socially, and academically. The school has given me many gifts of friendship and maturity, along with many challenges in the classroom and lab that have made me think about myself and my future goals. The professors here are generally amazing and make an honest effort to connect with students, no matter how many there are. Some even memorize everyone's names beforehand!! \nI definitely ran into some really rough spots here, and the pre-med track is incredibly difficult at times, but all of my gratitude still goes to Dartmouth for an amazing four years.",
            "Author": "Senior",
            "Date": "2018-06-14T19:36:34.135817Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth was the best way I could imagine spending my formative years post-high school. The close knit community and sense of belonging I felt at this school was unparalleled, allowing me to connect with students and professors alike to enhance my learning. This is truly a college unlike any other, with traditions and lingo and an experience that is shared by every student who walks through campus. Not only is this what a college should look like, this is what a college should feel like—support at every turn and constant smiling faces around every corner. The College on the Hill is a transformative place.",
            "Author": "Alum",
            "Date": "2018-06-14T01:15:25.44268Z"
        },
        {
            "Rating": 2,
            "Review": "When I was at Dartmouth not too long ago, we were ranked top 10, we had the Aires competing, Greek life was the best, academics was involving and fun, now to see where the school is, is just a pity.",
            "Author": "Alum",
            "Date": "2018-06-13T17:17:47.901711Z"
        },
        {
            "Rating": 5,
            "Review": "I really enjoyed my four years here. The flexibility of the D-plan was a definite plus, and I got to explore way more classes and do a lot more things than I otherwise would have done, including study abroad and research. Also a wide variety of student organizations that are welcoming and allowed me to try many new things.",
            "Author": "Alum",
            "Date": "2018-04-18T08:40:49.802994Z"
        },
        {
            "Rating": 5,
            "Review": "Visiting the campus was a surreal experience. Coming from NYC, walking around Hanover and seeing the close knit community was amazing. Not only is the academics great, the culture and student life is alive and extremely active.",
            "Author": "Niche User",
            "Date": "2018-04-16T19:20:28.51683Z"
        },
        {
            "Rating": 5,
            "Review": "Nothing to change about Dartmouth. I absolutely love this place and people. Despite having a very harsh weather, the atmosphere is very warming.",
            "Author": "Freshman",
            "Date": "2018-04-06T02:26:24.715743Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth is my uncle's alma mater, and I have therefore always visited it since I was a kid when visiting my uncle and aunt. Living in the heart of New Hampshire, it is a bit of a drive to get to the campus but it is always so worth it. His friends that he introduced to us are kind and compassionate people brimming with an intellectual aura. The instructors that walk by whenever I visit are certainly world class professionals. The campus itself is a magnificent architecture of grandeur.",
            "Author": "Niche User",
            "Date": "2018-03-14T00:29:38.910053Z"
        },
        {
            "Rating": 4,
            "Review": "Dartmouth has a great community, with supportive students and professors. The campus is beautiful and there are many resources available to students. I wish there had been less of an emphasis on Greek life and better career and advising services.",
            "Author": "Alum",
            "Date": "2018-01-26T02:32:06.271642Z"
        },
        {
            "Rating": 5,
            "Review": "I loved Dartmouth from the minute I set foot here as a freshman. Very opening and friendly environment, and professors are high caliber educators. Everyone wants you to succeed and there are a variety of extracurriculars to get involved in.",
            "Author": "Junior",
            "Date": "2018-01-19T18:19:14.979829Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth is simply wonderful. It has such a wonderfully cozy and collaborative atmosphere, which combined with the unparalleled focus on undergraduate students makes it the best college there is. The only thing people should be aware of is that there will be a large number of wealthy students, so be prepared to face some new socioeconomic diversity. Overall, it is such a safe and fun college set in a beautiful part of the country!",
            "Author": "Freshman",
            "Date": "2017-12-31T03:48:46.781826Z"
        },
        {
            "Rating": 4,
            "Review": "I am a dual enrollment high school student who has taken one class at Dartmouth and hopes to take another one before I graduate. I had a very good experience in my class. The teacher was really nice and helpful and was willing to spend lots of time with the students to help. She encouraged questions and when she couldn't find time to help she had a TA there to help. One thing that would have made the experience better was there isn't a lot of parking accessible to commuting students so you would have to walk from far away parking lots.",
            "Author": "Niche User",
            "Date": "2017-12-22T22:09:57.709696Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth is a unique place in that many colleges will never give you the freeing chance of focusing entirely on schooling in such a beautiful location. Rural location means fewer distractions and a better overall creative way of entertainment within a community.",
            "Author": "Freshman",
            "Date": "2017-12-20T01:42:18.748468Z"
        },
        {
            "Rating": 4,
            "Review": "The Dartmouth Experience - how we call it - is unlike any other. It allows you to challenge yourself in ways you never though possible. I do wish that mental health was talked about more, as I have struggled the past 2 years and have only recently received support from professors and staff.",
            "Author": "Senior",
            "Date": "2017-11-15T01:49:09.191131Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth has outstanding professors who make it a priority to interact with students.  Dartmouth offers a superb education in a beautiful environment.  The people are hearty, adventurous and authentic.",
            "Author": "Freshman",
            "Date": "2017-10-29T19:15:52.682193Z"
        },
        {
            "Rating": 5,
            "Review": "The atmosphere is extremely homey despite there always being a large workload.  Everyone likes to include the entire student body in activities, and the staff like to get involved as well.",
            "Author": "Niche User",
            "Date": "2017-09-14T00:55:44.145813Z"
        },
        {
            "Rating": 5,
            "Review": "Excellent professors who engage individually with students, beautiful campus, diverse community, increasingly progressive, responsive to students, ideal for top-notch students who prefer nature over urban setting.",
            "Author": "Alum",
            "Date": "2017-08-08T17:13:20.109839Z"
        },
        {
            "Rating": 5,
            "Review": "I thoroughly enjoyed my experience at Dartmouth College. If you are looking for professors who love to teach, a beautiful college campus, and a vibrant student body, Dartmouth is the place for you! There are also many outdoor opportunities to take advantage of.",
            "Author": "Alum",
            "Date": "2017-08-03T07:28:22.658202Z"
        },
        {
            "Rating": 5,
            "Review": "Wow, my time at Dartmouth has gone by so fast! I have absolutely loved the last 3 years and there is still so much I haven't done yet! Everything is amazing here, but the Dorms could be a little better.",
            "Author": "Junior",
            "Date": "2017-05-09T00:09:50.224294Z"
        },
        {
            "Rating": 5,
            "Review": "So far, I have thoroughly enjoyed my time at Dartmouth. The professors are amazing, and the students are genuine and kind. I would highly recommend Dartmouth to anyone who wants a stellar and memorable undergraduate experience. Go Big Green!",
            "Author": "Freshman",
            "Date": "2017-04-21T04:22:41.624257Z"
        },
        {
            "Rating": 5,
            "Review": "Lots of things to do on campus. Homecoming is fall highlight. D plan gives you flexibility for study abroad and internships away from campus.",
            "Author": "Junior",
            "Date": "2016-12-30T13:49:49.363724Z"
        },
        {
            "Rating": 5,
            "Review": "I am a current sophomore ('19), and I had a great freshman year, but I waited for this past Fall term to confirm that Dartmouth is, in fact, one of the best choices I have made in my life. Dartmouth has a small community in which everyone knows each other directly or through one degree of separation (which can be a pro and con at times!), but it's so easy to find a sense of self here and be integrated into a great community as well. Everyone knows stress levels are high, so hiding it does no good, but the community is incredibly supportive regardless.",
            "Author": "Sophomore",
            "Date": "2016-12-01T21:41:16.99025Z"
        },
        {
            "Rating": 5,
            "Review": "Rages, but fire the pres and make the school less PC. The frats are great, perhaps the best in the nation",
            "Author": "Freshman",
            "Date": "2016-11-27T21:11:02.322623Z"
        },
        {
            "Rating": 5,
            "Review": "This College is amazing.  School spirit and the general positive vibe is wonderfully balanced with intense academics.  The highly invested, highly qualified professors and small, interesting classes are unique among peer research universities.",
            "Author": "Sophomore",
            "Date": "2016-11-15T04:54:54.372317Z"
        },
        {
            "Rating": 5,
            "Review": "As a graduate student, I'm very impressed with this research university. As one would expect from an Ivy League school, funding is usually never an issue for research projects or social events. The libraries have some of the rarest books in the world, a very rare and delightful opportunity indeed. The professors are world famous and you'll easily see them on television for interviews. This school is a little more traditional than the other Ivies as can be seen by it still being called Dartmouth College and not Dartmouth University, even though it is a respectable research university make no mistake. Dartmouth is understated elegance, just the way it should be. Since this school is the smallest of the Ivies, it is the easiest to network in and will surely pay off in the long term. Dartmouth opens doors and there is a reason why the Ivies are so sought after on this planet, but you'll just have to find out for yourself exactly what I mean.",
            "Author": "Graduate Student",
            "Date": "2016-10-18T15:33:06.671041Z"
        },
        {
            "Rating": 4,
            "Review": "As I have suggested previously in this survey,  1 out of every three classes I have taken EVERY trimester has been very poor.  Not just \"not great\" but actually very poor!  One teacher out of every three has been a terrible teacher, or extremely difficult to understand and often their tests are extremely unfair and do NOT reflect the material taught in class.  When the entire class performs poorly, the grades are curved so it appears that everyone did adequately, but the reality is that in those classes we have NOT learned, we have lost an opportunity to get excited about a topic probably lost a spark of interest to further explore an academic area.  For the tuition we pay, we should have phenomenal teachers and when students complain about a professor year after year, they should at least NOT be teaching introductory classes.    I am not alone in feeling extremely disappointed in the overall teacher quality, at least during the first two years' introductory level classes.    Don't get me wrong - there have been some very good teachers too - but the ratio of terrible teachers to great teachers is not what it should be at an IVY League school",
            "Author": "College Junior",
            "Date": "2016-09-14T18:57:55Z"
        },
        {
            "Rating": 4,
            "Review": "I would definitely choose Dartmouth again.  I love the spirit of the school, the people, the professors and all  of the non-academic learning experiences that are available.  I think in the Engineering school there is a lot of room for improvement in terms of consistently having consistently good teachers.  For the most part, teachers are good in the entry level classes, occasionally there is a great teacher, but often ( so far 1 class out of three, every trimester) there is one teacher who isvery suboptimal in their ability to teach or communicate well.  Not acceptable at this type  of school.  \r\n\r\nAdditionally, because Dartmouth is out of the way for most companies, their engineering recruiting fairs are extremely lacking in depth and availability.  Much of the fair is online.  Being only 3 hours from Boston, The Thayer school of engineering should host a weekend or trip to Boston for a recruiting fair to coincide with all the other colleges there when there are HUNDREDS of companies available to talk to and connect with.  Students could take a bus to Boston and even make up the classes that are missed at some later point if necessary.   Job hunting and internship opportunities are far inferior than at many other schools, even if they are not as highly ranked as Dartmouth!",
            "Author": "College Junior",
            "Date": "2016-09-14T18:23:58Z"
        },
        {
            "Rating": 5,
            "Review": "The classes are amazing. I picked classes tauht by Dart's best faculty and I can see why they're the best of the best.",
            "Author": "College Freshman",
            "Date": "2016-08-26T08:04:37Z"
        },
        {
            "Rating": 5,
            "Review": "I couldn't be happier. Love my classes, love my teachers, love my peers",
            "Author": "College Freshman",
            "Date": "2016-08-26T07:56:01Z"
        },
        {
            "Rating": 4,
            "Review": "I've met new people from around the country and the world. The classes are a wide range to choose from and so far my professors have been very supportive in helping me pass and be successful in the classroom.",
            "Author": "College Sophomore",
            "Date": "2016-08-03T16:07:26Z"
        },
        {
            "Rating": 4,
            "Review": "The school is a small school and I like how everything is within walking distance. The professors expect highly of its students and generally want to help them as much as they can to be successful.",
            "Author": "College Sophomore",
            "Date": "2016-08-03T15:54:25Z"
        },
        {
            "Rating": 5,
            "Review": "I love Dartmouth. Classes are all informative, though first-level classes are larger than what I'm used to coming out of a small high school. I can't wait to take some more specialized classes. Professors are great and very welcoming.",
            "Author": "College Freshman",
            "Date": "2016-07-29T13:36:38Z"
        },
        {
            "Rating": 5,
            "Review": "I haven't been a Dartmouth student for very long, but I love everything about the school so far. Professors and students alike make you feel welcome.",
            "Author": "College Freshman",
            "Date": "2016-07-29T13:25:41Z"
        },
        {
            "Rating": 4,
            "Review": "My courses are great.  I ama  double major and have a minor.",
            "Author": "College Junior",
            "Date": "2016-07-09T13:08:03Z"
        },
        {
            "Rating": 5,
            "Review": "Lots of opportunities to go abroad, get internships and travel.  I love it.",
            "Author": "College Junior",
            "Date": "2016-07-09T12:55:36Z"
        },
        {
            "Rating": 3,
            "Review": "The class sizes are small for almost all the classes, except intro science courses.",
            "Author": "College Sophomore",
            "Date": "2016-07-08T00:10:33Z"
        },
        {
            "Rating": 3,
            "Review": "Overall, how engaging your professor is really depends on what classes you take. It's difficult for hard science professors to elaborate more certain topics because there is so much to cover; therefore, it can be quite challenging to follow along sometimes, esp. if you're unfamiliar with the material. But the professors do want you to do well, if you feel like you bombed an exam, talk to the professor, see what your options are, and go on from there.",
            "Author": "College Sophomore",
            "Date": "2016-07-07T23:42:05Z"
        },
        {
            "Rating": 4,
            "Review": "My experience with my courses was great. The courses are definitely challenging but the content of the courses are very interesting and the professors care about the students' performance.",
            "Author": "College Sophomore",
            "Date": "2016-07-04T21:42:57Z"
        },
        {
            "Rating": 4,
            "Review": "I have had a great time in the college so far. The quarter system makes the coursework very challenging, but students are more helpful than competitive to each other.",
            "Author": "College Sophomore",
            "Date": "2016-07-04T21:28:33Z"
        },
        {
            "Rating": 5,
            "Review": "I've had professors that are extremely passionate about what they teach and genuinely seem to love what they do.",
            "Author": "College Sophomore",
            "Date": "2016-07-04T15:43:59Z"
        },
        {
            "Rating": 5,
            "Review": "All of the classes I have taken have been quite interesting and the college makes it really easy to explore your passions",
            "Author": "College Sophomore",
            "Date": "2016-07-04T15:33:00Z"
        },
        {
            "Rating": 4,
            "Review": "Dartmouth is academically challenging, but also offers a lot of extracurriculars and outdoor activities to participate in",
            "Author": "College Sophomore",
            "Date": "2016-06-28T09:19:51Z"
        },
        {
            "Rating": 5,
            "Review": "Definitely not the place for everyone, but for people who love to be challenged academically, it's a great place to study",
            "Author": "College Sophomore",
            "Date": "2016-06-28T09:08:58Z"
        },
        {
            "Rating": 4,
            "Review": "Beautiful campus, wonderful students and professors. Very expensive though!",
            "Author": "College Sophomore",
            "Date": "2016-04-27T20:34:51Z"
        },
        {
            "Rating": 5,
            "Review": "Such an amazing institution to be a part of",
            "Author": "College Freshman",
            "Date": "2016-04-24T17:54:34Z"
        },
        {
            "Rating": 5,
            "Review": "Absolutely love everything about it",
            "Author": "College Freshman",
            "Date": "2016-04-24T17:32:45Z"
        },
        {
            "Rating": 5,
            "Review": "The people here are wonderful and it was one of the main reasons I decided to attend here. The location makes it secluded so it allows you to get involved with things on campus and form a bond with the students here.",
            "Author": "College Sophomore",
            "Date": "2016-03-31T18:26:19Z"
        },
        {
            "Rating": 4,
            "Review": "I'd miss New Hampshire so much, that's why I chose Dartmouth. Also, I knew Dartmouth was well-known for its emphasis on educating undergraduates well and I know it's been really the case given all of the great professors I've had! I only wish the school wasn't so expensive, though. My mental health doesn't always feel too good when I'm super stressed by my workload either. I wouldn't give up the friends I've made since freshman year though.",
            "Author": "College Sophomore",
            "Date": "2016-03-20T13:38:19Z"
        },
        {
            "Rating": 5,
            "Review": "The campus is absolutely beautiful, the faculty are impressive and helpful, the students are diverse, extraordinary, and cooperative. The biggest problem ive had with my experience is the reliance of the social scene on frats, but even they're super friendly and welcoming and most of my friends really enjoy them. The opportunities here are endless and I wouldn't wish to go anywhere else.",
            "Author": "College Freshman",
            "Date": "2016-02-02T01:37:41Z"
        },
        {
            "Rating": 4,
            "Review": "In general great, but some professors (especially science) could have been more involved.",
            "Author": "Recent Alumnus",
            "Date": "2016-01-02T00:27:41Z"
        },
        {
            "Rating": 4,
            "Review": "Great community, friendliest of the Ivies. Some professors could have been better in terms of reaching out to the students (especially in the sciences).",
            "Author": "Recent Alumnus",
            "Date": "2016-01-02T00:19:26Z"
        },
        {
            "Rating": 5,
            "Review": "Amazing professors with impressive credentials and CV's a mile long. Teach passionately and effectively.",
            "Author": "College Freshman",
            "Date": "2015-12-30T23:14:46Z"
        },
        {
            "Rating": 5,
            "Review": "Amazing culture; Trips was the best few days of my life by far, no other school has anything like it. Student body is ridiculously amazing and it's super easy to find a niche where you can be yourself and be comfortable and share lots of interests with peers. Upperclassmen and alums are extremely helpful (and jealous that we still have time to be a student at Dartmouth!)",
            "Author": "College Freshman",
            "Date": "2015-12-30T23:06:23Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth fits my interests perfectly - academic-wise, size-wise (4,000 undergrad means you'll always see familiar faces) and extracurricular-wise (especially the diverse outing club)",
            "Author": "College Freshman",
            "Date": "2015-12-29T22:41:36Z"
        },
        {
            "Rating": 5,
            "Review": "The professors are so passionate, the people are diverse, and its a place that I can't wait to spend the rest of my undergraduate years.",
            "Author": "College Freshman",
            "Date": "2015-12-17T12:30:26Z"
        },
        {
            "Rating": 4,
            "Review": "What makes my school unique is the liberal arts experience and the many opportunities that come through that.",
            "Author": "College Freshman",
            "Date": "2015-12-17T12:18:44Z"
        },
        {
            "Rating": 4,
            "Review": "There are a lot of really wealthy kids here, like at all Ivy League schools, so sometimes there can be some socioeconomic barriers, but overall it's a really eye-opening experience with a lot of great people from a variety of backgrounds.",
            "Author": "College Freshman",
            "Date": "2015-12-08T20:28:24Z"
        },
        {
            "Rating": 5,
            "Review": "I love the campus and the people there!",
            "Author": "College Freshman",
            "Date": "2015-11-11T04:15:58Z"
        },
        {
            "Rating": 5,
            "Review": "There's literally something for everyone. During my first week of school, I started working on a the engine of a Formula Hybrid race car, play in a poker tournament, went whitewater kayaking, starting going to the rock climbing gym, and went stupid at a dance party. Whatever your interests, Dartmouth has got you covered.",
            "Author": "College Freshman",
            "Date": "2015-10-18T16:50:00Z"
        },
        {
            "Rating": 4,
            "Review": "Meeting people from all over the world.",
            "Author": "College Sophomore",
            "Date": "2015-07-07T15:21:18Z"
        },
        {
            "Rating": 5,
            "Review": "From my brief experience, the community is excellent, the instruction superb, and the social life-well-poppin'!",
            "Author": "College Freshman",
            "Date": "2015-06-29T01:43:06Z"
        },
        {
            "Rating": 5,
            "Review": "Although Dartmouth has its problem, I've had an amazing time. I've grown as a person in so many respects, learned so much about my field, and have had the opportunity to study abroad twice.",
            "Author": "College Junior",
            "Date": "2015-03-15T16:25:44Z"
        },
        {
            "Rating": 5,
            "Review": "I have been happy with all aspects of Dartmouth. The academics, athletics, professors, coaches etc. are all high level and challenging.",
            "Author": "College Freshman",
            "Date": "2015-01-15T18:28:12Z"
        },
        {
            "Rating": 5,
            "Review": "Could not be happier by any means! School is absolutely amazing. #1 school for undergraduate focus, #1 school for earning and career prospects after school etc. (always in the top 10 or 20 of best schools)!",
            "Author": "College Sophomore",
            "Date": "2014-09-09T09:41:56Z"
        },
        {
            "Rating": 5,
            "Review": "Fantastic school - could not be happier here!! Excellent academics, professors, programs, students, facilities, support, and soooo much more!",
            "Author": "College Sophomore",
            "Date": "2014-09-09T09:38:27Z"
        },
        {
            "Rating": 5,
            "Review": "The quality of my academic experience has been great. I've learned so much more than I had in high school. The profs are high quality, they care, and they push you to learn.",
            "Author": "College Sophomore",
            "Date": "2014-08-04T15:22:25Z"
        },
        {
            "Rating": 5,
            "Review": "I love it here at the BIG GREEN! I would not choose anywhere else.",
            "Author": "College Freshman",
            "Date": "2014-06-13T21:53:41Z"
        },
        {
            "Rating": 5,
            "Review": "I love Dartmouth! Like any institution, it has it's strong sides and faults, but overall, I am in love with my college experience. We have some of the smartest, most athletic, open-minded, motivated individuals, and everyone loves being there and wants to make it better. The traditions we have are amazing, and the academics are top notch. The professors love teaching, and there are a few not so good apples in the mix, but overall, its a fantastic institution.",
            "Author": "College Sophomore",
            "Date": "2014-06-09T18:08:52Z"
        },
        {
            "Rating": 5,
            "Review": "Great 4 years that have left me with many opportunities.",
            "Author": "College Junior",
            "Date": "2014-05-20T20:34:12Z"
        },
        {
            "Rating": 5,
            "Review": "Diverse offerings, ability to take classes outside of your major, the best undergraduate education on earth.",
            "Author": "College Junior",
            "Date": "2014-05-20T20:23:36Z"
        },
        {
            "Rating": 4,
            "Review": "I like my economics department. It is one of the best in the nation. I am also minoring in Chinese and guess what.  Next fall I'll be in China because my school really pushes for students to study abroad (which is a wonderful thing).  As for my career goals I am unsure of. I know it will be in the field of finance and I really don't have any concerns because Dartmouth has an extremely strong network system.",
            "Author": "College Freshman",
            "Date": "2014-04-07T23:13:45Z"
        },
        {
            "Rating": 4,
            "Review": "I really loved my academic experience. The professors and courses were wonderful and really helped me grow intellectually. I was opened to many new topics and learning experiences and they have been applicable to my post-graduate life, even though I am working in a different field from my major.\r\n\r\nThe social scene was a bit difficult for me. As someone who did not partake in drinking or drugs and was not in a sorority, I always felt a bit out of place considering at least 80% of the student population is in a fraternity/sorority. I did, however, make the most of it, and was active within the Afro-American Society on campus, and worked 3-4 jobs as well as danced in a student-run dance group. These extracurricular activities were my stress release and also helped me to remain social despite my non-conventional social status on campus.",
            "Author": "Recent Alumnus",
            "Date": "2013-12-27T10:56:59Z"
        },
        {
            "Rating": 5,
            "Review": "I loved my academic experience at Dartmouth. The professors, especially within the History department, were superb. They were always available to talk or assist with a question or topic, and made the courses so interesting. There were many times that I encouraged friends to take History classes and they also enjoyed them even when they didn't think they would.\r\n\r\nIf I had the opportunity, I would do it all over again. I learned and grew so much while at Dartmouth, and gained a better sense of myself. \r\n\r\nI am an aspiring Holistic Nutritionist, and my goal is to combine that with my Kripalu Yoga Teacher Certification and help others heal their bodies through food and nutrition. I want to work within minority communities, and through churches and community programs, to allow people an opportunity to learn more about health and incorporate it into their lifestyles, as opposed to making them follow a specific plan.",
            "Author": "Recent Alumnus",
            "Date": "2013-12-27T09:05:16Z"
        },
        {
            "Rating": 5,
            "Review": "I love Dartmouth. I bleed Green. The still North is in my heart, the hill winds in my veins, and the granite of New Hampshire in my muscles and my brains!",
            "Author": "College Freshman",
            "Date": "2013-11-26T23:53:21Z"
        },
        {
            "Rating": 5,
            "Review": "It's a fantastic school.  The people are friendly, the community is tight-knit, and the academic reputation is top notch!",
            "Author": "College Freshman",
            "Date": "2013-11-25T19:56:11Z"
        },
        {
            "Rating": 5,
            "Review": "Love It! I absolutely love Dartmouth! Every student does. That's why it's so hard to become an admissions tour guide! It's because we all want to brag about our school! I think it's easy to find a balance between social life and academic life. I'm so happy I chose Dartmouth!",
            "Author": "College Sophomore",
            "Date": "2012-08-01T17:10:35.813Z"
        },
        {
            "Rating": 4,
            "Review": "Pretty Good! okay, so Hannover isn't exactly known for its off-campus dining… But I think it's pretty darn good! You have so much variety, there're some places that are cheap, others that are expensive, great places to go with friends, great place to go to parents, and the pizza joint that is open until 2 AM, for drunken escapades. We love it here, there are always places to go, and the local atmosphere is so friendly.  also dirt cowboy is great for coffee!",
            "Author": "College Sophomore",
            "Date": "2012-07-29T11:21:22.547Z"
        },
        {
            "Rating": 4,
            "Review": "Absolutely Incredible – The best way I can describe my experience here is by relating the fact that by the third day, I was already calling my dorm \"home.\" I have never been surrounded by a group of kids this intelligent, hard-working or gregarious. There is always plenty to do during the day and definitely at night, and there is always someone interesting to talk to and hang out with. The professors are geniuses and incredible educators, the classes are challenging but nearly always interesting, and there are hundreds of subjects to pick from. My only two issues -- the things that drop this school from an A+ to an A -- are the pervasiveness of greek culture and the lack of relationships. It's nearly impossible to not rush here for guys, which isn't necessarily a bad thing if you're willing to join a frat (only if you're not). Unlike other colleges, there just aren't that many sober hookups or relationships. It's much more common to get a drunk hookup at a dance party that ends as soon as you leave the frat. But note, I'm a freshman, and it's nearly guaranteed it'll get better next year.",
            "Author": "College Freshman",
            "Date": "2012-04-23T17:26:53.703Z"
        },
        {
            "Rating": 4,
            "Review": "Great Community – The thing I love most about dartmouth is the community. The people are just the nicest and most fun people you will ever meet, especially for an ivy league where you might expect everyone to be stuck-up ( that's what I expected). I don't regret for one second my decision to attend dartmouth. I know I'm receiving one of the best educations out there.",
            "Author": "College Sophomore",
            "Date": "2011-01-24T16:51:58.333Z"
        },
        {
            "Rating": 4,
            "Review": "Study Hard, Party Harder – Dartmouth has something for everyone. The intense ivy league academics, the crazy fun social frat scene like none other and tons of clubs, activities and sports to get involved in.  It's Dartmouth so it isn't easy and yes it's cold and yes we're in New Hampshire/the middle of nowhere (lol).  But each of those has a positive that outweighs the seemingly negative. Dartmouth wouldn't be an ivy if it were easy (you can't imagine our alumni network), it's AMAZING for skiing and any winter sport you can imagine and the \"middle of nowhere\" syndrome means our campus is legitimately a close-knit community. We literally study hard and party even harder.  Come for a visit on one of our big weekends (Homecoming, Winter Carnival and Green Key) or just any regular day and you'll see just what makes Dartmouth so ideal.",
            "Author": "College Sophomore",
            "Date": "2010-12-25T02:35:37.717Z"
        },
        {
            "Rating": 4,
            "Review": "It's Great! Dartmouth is a great place to be if you know how to handle your academics and social life well. The campus is in the \"middle of nowhere\" so that builds a very close-knit community and you really get to know your fellow classmates well. As long as you balance everything and make use of the myriad opportunities, you'll have a really good time.",
            "Author": "College Sophomore",
            "Date": "2010-06-21T11:15:06.153Z"
        },
        {
            "Rating": 4,
            "Review": "I Have Officially Undergone My Green Blood Transfusion (GBT) – Dartmouth College is an amazing school, especially for undergraduate education. Hands down, I could not have chosen an institution more fitted to my needs as a student. The remote location of the school is the only drawback that I can personally attest to struggling with at times. The location often prevents you from \"getting away,\" which proves overwhelming and stressful during certain periods, such as midterms and finals.",
            "Author": "College Sophomore",
            "Date": "2010-03-13T09:27:27.897Z"
        },
        {
            "Rating": 4,
            "Review": "Loved every minute – Dartmouth was the time of my life. Academics were spectacular, and the social life was a blast. Greek life was definitely a large part of the social scene, but I was in a house and loved every minute of it; lots of solid extra-curricular activities.",
            "Author": "Niche User",
            "Date": "2008-03-01T00:00:00Z"
        }
    ],
    "Student%20Life": [
        {
            "Rating": 5,
            "Review": "Dartmouth Outing Club is probably the most important Club on campus and provides equipment, trips and rentals as well as TONS of opportunities to learn about all kinds of outdoor activities,, from camping, rock climbing, skiing, mountain biking, kayaking and the list is truly endless.    students teach students and it is great.  Dartmouth has skiway mountain too, where students are trained to be ski patrol and provide emergency first responder care - this is a competitive position to apply for, but it is a significant responsibility and learning experience.  \r\n\r\nthere are lots of other sports that I am not involved in, but people are pretty involved in outdoor activities all the time whether in a club or a sport.s",
            "Author": "College Junior",
            "Date": "2016-09-14T18:29:57Z"
        },
        {
            "Rating": 5,
            "Review": "Dart's greek life is super open and welcoming. It's fun and you can be a part of not and it's all okay",
            "Author": "College Freshman",
            "Date": "2016-08-26T07:58:04Z"
        },
        {
            "Rating": 4,
            "Review": "Lots of involvement in sports/athletics!",
            "Author": "College Freshman",
            "Date": "2016-08-26T07:57:13Z"
        },
        {
            "Rating": 2,
            "Review": "I've heard many stories about parties and alumni coming back and hazing new recruits.",
            "Author": "College Sophomore",
            "Date": "2016-08-03T15:58:11Z"
        },
        {
            "Rating": 3,
            "Review": "Athletics is a big part of campus life. Many people attend these events.",
            "Author": "College Sophomore",
            "Date": "2016-08-03T15:56:41Z"
        },
        {
            "Rating": 4,
            "Review": "Dartmouth athletics isn't huge, but it is welcoming. I'm participating in intramural sports and they are great fun!",
            "Author": "College Freshman",
            "Date": "2016-07-29T13:27:22Z"
        },
        {
            "Rating": 3,
            "Review": "Not much housing available at fraternities or sororoties.",
            "Author": "College Junior",
            "Date": "2016-07-09T12:59:37Z"
        },
        {
            "Rating": 4,
            "Review": "SPorts are somewhat important.  Lots of club level teams to participate in and compete with other colleges.",
            "Author": "College Junior",
            "Date": "2016-07-09T12:58:10Z"
        },
        {
            "Rating": 3,
            "Review": "Greek life is a big part of Dartmouth, but you don't have to be in a sorority or fraternity to go to the parties. It is also easy to get into parties because there are no arbitrary rules that require a certain guy -to-girl ratio. If you do not get accepted to your favorite frat/sorority, a lot people end up falling in love with where they end up. Plus, pong games are more fun and complicated than just throwing a ball in a cup.",
            "Author": "College Sophomore",
            "Date": "2016-07-07T23:49:15Z"
        },
        {
            "Rating": 4,
            "Review": "Since it's a D1 school, athletics do play a role in student life, esp during homecoming, but that can be said for almost all schools. However, I never felt that sports is more emphasized than academics because the athletes have to maintain their grades if they want to be survive at this school.",
            "Author": "College Sophomore",
            "Date": "2016-07-07T23:46:15Z"
        },
        {
            "Rating": 3,
            "Review": "Greek life is pretty big in the college, but greeks do their fair share of both parties and community service.",
            "Author": "College Sophomore",
            "Date": "2016-07-04T21:32:12Z"
        },
        {
            "Rating": 4,
            "Review": "The athletic facilities are open to both athletes and non-athletes and maintained well.",
            "Author": "College Sophomore",
            "Date": "2016-07-04T21:30:41Z"
        },
        {
            "Rating": 4,
            "Review": "The social scene IS 99% Greek life",
            "Author": "College Sophomore",
            "Date": "2016-07-04T15:35:52Z"
        },
        {
            "Rating": 3,
            "Review": "Not really involved in athletics",
            "Author": "College Sophomore",
            "Date": "2016-07-04T15:34:54Z"
        },
        {
            "Rating": 3,
            "Review": "Frats and sororities throw a lot of parties, which are mostly open to everyone",
            "Author": "College Sophomore",
            "Date": "2016-06-28T09:12:13Z"
        },
        {
            "Rating": 4,
            "Review": "A large proportion of the school consists of varsity athletes",
            "Author": "College Sophomore",
            "Date": "2016-06-28T09:10:53Z"
        },
        {
            "Rating": 4,
            "Review": "Good school spirit, but sports don't completely dominate campus culture.",
            "Author": "College Sophomore",
            "Date": "2016-04-27T20:36:31Z"
        },
        {
            "Rating": 4,
            "Review": "huge part of life here",
            "Author": "College Freshman",
            "Date": "2016-04-24T17:34:54Z"
        },
        {
            "Rating": 4,
            "Review": "I wish there was greater student support for sport",
            "Author": "College Freshman",
            "Date": "2016-04-24T17:34:20Z"
        },
        {
            "Rating": 5,
            "Review": "The facilities are top-notch for athletes. This creates an area where the resources are available for athletes to practice getting better without any worry.",
            "Author": "College Sophomore",
            "Date": "2016-03-31T18:31:54Z"
        },
        {
            "Rating": 4,
            "Review": "I personally don't enjoy going to frats, but that's a personal choice. As far as Greek life goes, Dartmouth's is quite exciting, community-oriented, and welcoming. Greeks seem to get a lot out of their participation in Greek Life.",
            "Author": "College Freshman",
            "Date": "2016-02-02T01:43:32Z"
        },
        {
            "Rating": 3,
            "Review": "Not my thing, but good for those that liked that kind of stuff.",
            "Author": "Recent Alumnus",
            "Date": "2016-01-02T00:20:10Z"
        },
        {
            "Rating": 3,
            "Review": "When I attended (2009-13), the football performed very poorly, but I believe they're improving. \r\n\r\n'",
            "Author": "Recent Alumnus",
            "Date": "2016-01-02T00:18:03Z"
        },
        {
            "Rating": 5,
            "Review": "People here are extremely PC, over-the-top so. Diversity is all everyone seems to want.",
            "Author": "College Freshman",
            "Date": "2015-12-30T23:18:56Z"
        },
        {
            "Rating": 5,
            "Review": "Extremely inclusive: you can walk into literally any party other than invite-only formals (which are rare; and if a house is having one, there will be tons of others open).",
            "Author": "College Freshman",
            "Date": "2015-12-30T23:09:23Z"
        },
        {
            "Rating": 5,
            "Review": "Athletes are everywhere, students are super involved and appreciative. Division 1 football, and we won the Ivy Championship this year (and have the highest number of Ivy Titles)",
            "Author": "College Freshman",
            "Date": "2015-12-30T23:08:31Z"
        },
        {
            "Rating": 3,
            "Review": "Homecoming football game is well attended, but otherwise sports are something the student body supports rather passively.",
            "Author": "College Freshman",
            "Date": "2015-12-29T22:42:51Z"
        },
        {
            "Rating": 3,
            "Review": "Greek live is really big on campus, but it is not the only way to meet people.",
            "Author": "College Freshman",
            "Date": "2015-12-17T12:22:36Z"
        },
        {
            "Rating": 3,
            "Review": "Ivy league sports are a lot different than state schools, but they are still fun.",
            "Author": "College Freshman",
            "Date": "2015-12-17T12:19:44Z"
        },
        {
            "Rating": 3,
            "Review": "Except for this new prohibition thing that will obviously only make things worse, the school is not really interested in breaking up the fun or making sure people are not partying. The most important thing to Dartmouth is the student's safety and/or Dartmouth's public image: you can get away with most things that don't jeopardize one/both of those.",
            "Author": "Recent Alumnus",
            "Date": "2015-03-26T17:40:05Z"
        },
        {
            "Rating": 1,
            "Review": "Greek life is the most controversial thing on campus. There's a ton of debate about sexual assault, binge drinking, and lack of inclusivity (fancy words meaning creating elitist areas), and such. It's pretty revealing that these problems are always discussed with Greek institutions to show how pervasive the problem is.",
            "Author": "College Junior",
            "Date": "2015-03-15T16:21:15Z"
        },
        {
            "Rating": 2,
            "Review": "Gym is not that great - athletes have it good with top quality equipment",
            "Author": "College Junior",
            "Date": "2015-03-15T16:19:40Z"
        },
        {
            "Rating": 2,
            "Review": "Administration is more concerned with PR than students, and most students agree with this.",
            "Author": "College Junior",
            "Date": "2015-03-15T16:16:19Z"
        },
        {
            "Rating": 3,
            "Review": "When I was at Dartmouth, the college handled honor code violations with the most stringency. Now that they've established new rules to address underage drinking, that may change.",
            "Author": "Recent Alumnus",
            "Date": "2015-02-20T16:03:48Z"
        },
        {
            "Rating": 3,
            "Review": "I don't plan on pledging but it is fairly common for students to be a part of this.",
            "Author": "College Freshman",
            "Date": "2015-01-15T18:43:30Z"
        },
        {
            "Rating": 5,
            "Review": "Athletes are a large part of my social circle and basically is my family away from home. The team and my coaches. are my family at Dartmouth.",
            "Author": "College Freshman",
            "Date": "2015-01-15T18:32:42Z"
        },
        {
            "Rating": 4,
            "Review": "The administration is effective as possible.",
            "Author": "College Freshman",
            "Date": "2015-01-15T18:30:14Z"
        },
        {
            "Rating": 3,
            "Review": "Greek life is simply for those who fancy its taste",
            "Author": "College Sophomore",
            "Date": "2015-01-08T21:45:02Z"
        },
        {
            "Rating": 3,
            "Review": "The course-work is really fast-paced. Taking 3 courses keeps one busy late into the night every other day. But the brighter side is that we then take relaxation/entertainment seriously. The best way to navigate this college is to give whatever activity you do 100% focus.",
            "Author": "College Sophomore",
            "Date": "2015-01-08T21:35:35Z"
        },
        {
            "Rating": 4,
            "Review": "For a school focused on the academics, Dartmouth doesn't fall short in the athletic department either. Our varsity teams, such as football and both soccer teams, compete every year, and most events are attended by a decent number of students. Club and intramural sports are very popular; almost every student is involved in some sort of sport or physical activity.",
            "Author": "College Freshman",
            "Date": "2015-01-01T15:02:57Z"
        },
        {
            "Rating": 3,
            "Review": "I feel pretty indifferent towards the Greek life so I have yet to go to any real frat parties. To be honest, I might only go and play pong for a bit if my friends invite me, but that's really it. Even if I never join a fraternity, a sorority or a co-ed house, they're still going to have a big impact on my life at Dartmouth. After all, they host lot of fun parties and campus activities. This is so that they can invite as many students as they can to show them the Greek life. This year, for example, many of the houses had pumpkin carving contests and ice cream sundae fairs. I think that was pretty nice of them considering that the freshmen had a six-week ban from attending any frat party serving alcoholic drinks. Out here in Hanover, there's often not much to do, especially during the winter. If you're more used to a faster pace of life, that six-week ban was probably a nightmare haha. In any case, once the ban has been lifted, students can't join the Greek life until sophomore year anyway. I've heard rushing is a really stressful process though. Sometimes, you may not even get into the fraternity or sorority you wanted! But some people stick through until the end so I guess the Greek life is definitely worth it. After all, you get to stay in a nice little New England house with a bunch of close friends. That sounds pretty rad to me, but again I'm not big on parties oops.",
            "Author": "College Freshman",
            "Date": "2014-12-15T13:30:30Z"
        },
        {
            "Rating": 4,
            "Review": "The school realizes that we are not near many sources of fun/entertainment and are average/lenient on drinking policies. They take academic integrity extremely seriously.",
            "Author": "College Sophomore",
            "Date": "2014-12-10T21:34:30Z"
        },
        {
            "Rating": 4,
            "Review": "The administration is certainly not lenient but still remains fair.",
            "Author": "College Freshman",
            "Date": "2014-11-20T21:59:09Z"
        },
        {
            "Rating": 5,
            "Review": "The campus is very active and sports plays a major role in most students' experiences.",
            "Author": "College Freshman",
            "Date": "2014-11-20T21:58:12Z"
        },
        {
            "Rating": 4,
            "Review": "Greek life positively affects the social scene and many do great work in the community.",
            "Author": "College Freshman",
            "Date": "2014-11-20T21:55:29Z"
        },
        {
            "Rating": 3,
            "Review": "60% of student on campus are involved in greek life. That being said, there is a very vocal minority that wishes to radically change and/or abolish the greek system. Greek life is the dominant social scene on campus, so some worry that taking that away will drive risky drinking behaviors underground. The policies relative to the Greek system are currently being reevaluated on campus.",
            "Author": "College Freshman",
            "Date": "2014-11-13T16:52:39Z"
        },
        {
            "Rating": 4,
            "Review": "School policies seem pretty fair, and the administration is very willing to hear students out to address and resolve issues.",
            "Author": "College Freshman",
            "Date": "2014-11-13T16:46:13Z"
        },
        {
            "Rating": 4,
            "Review": "There are lots of type-A, partying, attractive, preppy, wealthy, econ major types but there are also tons of guys who don't fit that stereotype at all",
            "Author": "College Sophomore",
            "Date": "2014-09-09T16:14:02Z"
        },
        {
            "Rating": 4,
            "Review": "Definitely some problems but overall a positive thing on campus. It is huge with almost 80% of each class joining but unaffiliated students are mostly treated the same and are still welcome at all parties. Its very different than at most schools since so many people are involved. Many of the sterotypes at other schools aren't true at all here. Most people never imagined joining Greek life until coming to Dartmouth and seeing what it is really like. The houses vary a lot so there is one for almost everyone and it can be a big or small a part of your life as you want.",
            "Author": "College Sophomore",
            "Date": "2014-09-09T16:06:49Z"
        },
        {
            "Rating": 3,
            "Review": "Sometimes a little too strict in dorms and too lenient in frats but overall not bad. They generally are just trying to make sure everyone is safe.",
            "Author": "College Sophomore",
            "Date": "2014-09-09T15:48:45Z"
        },
        {
            "Rating": 3,
            "Review": "Somewhat popular but not a huge part of campus. Homecoming and several other key games are well attended but normal games not so much. Rugby and hockey are popular. Great gym for non-athletes and intramurals are fun.",
            "Author": "College Sophomore",
            "Date": "2014-09-09T15:37:23Z"
        },
        {
            "Rating": 5,
            "Review": "Guys an girls are both very attractive, athletic, smart, outgoing, and friendly!",
            "Author": "College Sophomore",
            "Date": "2014-09-09T09:42:49Z"
        },
        {
            "Rating": 5,
            "Review": "Lot of different people from different backgrounds, with different beliefs and experiences. Do a great job of sharing with each other and they learn a lot from interacting.",
            "Author": "College Sophomore",
            "Date": "2014-09-08T19:40:47Z"
        },
        {
            "Rating": 5,
            "Review": "Parties are open to anyone - no exclusivity and very open and accepting!",
            "Author": "College Sophomore",
            "Date": "2014-09-08T19:26:37Z"
        },
        {
            "Rating": 5,
            "Review": "Amazing facilities for both varsity and non varsity athletes. Incredibly active and healthy student body!",
            "Author": "College Sophomore",
            "Date": "2014-09-08T19:17:29Z"
        },
        {
            "Rating": 5,
            "Review": "Great administration, work hard and care about the students!",
            "Author": "College Sophomore",
            "Date": "2014-09-08T19:16:07Z"
        },
        {
            "Rating": 4,
            "Review": "Overall a good looking student body, but I am sure other schools put us to shame.",
            "Author": "College Sophomore",
            "Date": "2014-08-04T15:31:02Z"
        },
        {
            "Rating": 4,
            "Review": "To be honest, people don't attend many varsity games. There are two main exceptions - Princeton hockey, and Homecoming football.\r\n\r\nThe athletic facilities, on the other hand, are top-notch. Amazing fitness center, squash courts, and other facilities (the pool is being renovated this year as well).",
            "Author": "College Sophomore",
            "Date": "2014-08-04T15:26:20Z"
        },
        {
            "Rating": 3,
            "Review": "Despite an Ivy League status, Dartmouth students are typically rather humble rather than self-absorbed and stuck-up. There are, however, still certain exceptions.",
            "Author": "College Sophomore",
            "Date": "2014-07-23T17:36:38Z"
        },
        {
            "Rating": 3,
            "Review": "The Greek system is quite inclusive, however, has also been charged as a catalyst for high-risk drinking and sexual assault. Greek life is a contentious issue on campus.",
            "Author": "College Sophomore",
            "Date": "2014-07-23T17:29:30Z"
        },
        {
            "Rating": 3,
            "Review": "The campus does not seem to be very strict. Some complain about Safety & Security officers, but most prefer dealing with them rather than with the Hanover Police.",
            "Author": "College Sophomore",
            "Date": "2014-07-23T17:26:31Z"
        },
        {
            "Rating": 4,
            "Review": "There are roughly 10% international students, in addition to a wide variety of students from within the United States. The freshman room draw provides a great opportunity to experience something other than what you are used to. My roommate's family comes from Nigeria and as such he was very different then me. I was able to learn so much about the manners in which our upbringings were starkly different and yet in other areas quite similar, an experience I really value.",
            "Author": "College Sophomore",
            "Date": "2014-07-23T17:18:51Z"
        },
        {
            "Rating": 3,
            "Review": "I still do think Dartmouth has a way to go. There are many students who still don't feel very accepted at Dartmouth, where for race, religion or sexuality. There is a very homogenous 'typical' experience which can be very excluding for the students who don't fit that mould.",
            "Author": "College Junior",
            "Date": "2014-07-12T14:50:15Z"
        },
        {
            "Rating": 3,
            "Review": "We have a real problem with people turning up to games; some sports more than others. For example, women's basketball games never get the turn out they deserve, whereas hockey games are usually pretty well attended.",
            "Author": "College Junior",
            "Date": "2014-07-12T14:40:16Z"
        },
        {
            "Rating": 4,
            "Review": "It is great if that is what you want to do. It's not my thing...",
            "Author": "College Freshman",
            "Date": "2014-06-13T21:58:50Z"
        },
        {
            "Rating": 5,
            "Review": "Love the look of the guys here. All are smart and athletic, not to mention, tall!",
            "Author": "College Freshman",
            "Date": "2014-06-13T21:57:18Z"
        },
        {
            "Rating": 3,
            "Review": "Being an isolated New England school, diversity is okay.",
            "Author": "College Freshman",
            "Date": "2014-06-13T21:55:17Z"
        },
        {
            "Rating": 3,
            "Review": "I feel like there is always (in college in general) too much emphasis on sports.",
            "Author": "College Freshman",
            "Date": "2014-06-13T21:52:34Z"
        },
        {
            "Rating": 4,
            "Review": "Rule #1: Don't get caught. If you do get caught, then just be respectful, and you'll generally be fine. They understand that it is college and kids will do stupid stuff, so they try not to punish you unfairly for it. Safety and Security is generally helpful. The strictness depends on which dorms you live in; some are very lenient and some are very strict. You can tailor your life to what you want it to be.",
            "Author": "College Sophomore",
            "Date": "2014-06-09T18:14:49Z"
        },
        {
            "Rating": 4,
            "Review": "I think that overall, we have great diversity. We have so many minorities and internationals that it is impossible not to have many of them in your friend group. Most people are accepting of everyone, but like anywhere, there are a few people that are very conservative and not the friendliest. They at least don't show it openly very often, however. LGBT groups and minority groups have lots of resources and activities and events and are very vocal on campus when things do go awry. I think it's all really good though.",
            "Author": "College Sophomore",
            "Date": "2014-06-09T18:05:30Z"
        },
        {
            "Rating": 4,
            "Review": "Some of our varsity teams are the best in the nation. It's a D1 Ivy, so sports are obviously competitive and a big part of campus life, but certainly not the most important. People cheer on the teams. Club teams and intramurals are also available, and there are many gym classes (ie. yoga, zumba, etc) as well as outdoors type classes (rock climbing, hiking, kayaking, etc.) that can all be taken for PE credit. Some club teams are more competitive than others, but our campus is really really fit and healthy overall. I'd say less than 1% of the students are obese/ overweight. The gym is big and more than enough for the average student.",
            "Author": "College Sophomore",
            "Date": "2014-06-09T18:02:11Z"
        },
        {
            "Rating": 5,
            "Review": "Gone are the days of Dartmouth being conservative and white.  People here are also the most well adjusted of any ivy for sure.",
            "Author": "College Junior",
            "Date": "2014-05-20T20:29:27Z"
        },
        {
            "Rating": 5,
            "Review": "S&S is there to help you.  Officers are lenient. The honor code is strictly enforced which reduces cheating.",
            "Author": "College Junior",
            "Date": "2014-05-20T20:22:59Z"
        },
        {
            "Rating": 5,
            "Review": "Despite what you hear in the news greek life is a friendly, healthy environment.  Everyone is welcome at every party (no guest lists like at my friends' schools) and pong is the most fun drinking game on earth.  Many of my friends are unaffiliated and still enjoy the Greek scene on their own terms.",
            "Author": "College Junior",
            "Date": "2014-05-20T20:21:46Z"
        },
        {
            "Rating": 4,
            "Review": "The way they have you review this is strange but IMs are a ton of fun and tons of people participate in them (freshman floors, fraternities/sororities, groups of friends, secret societies all have teams) and the gym is great.  Sporting events are under-attended, but that goes with the ivy league territory...  At the end of the day, the athletes are still D1 so those games which you do attend will be high quality.",
            "Author": "College Junior",
            "Date": "2014-05-20T20:12:12Z"
        },
        {
            "Rating": 3,
            "Review": "Football team sucked; moreso the attitudes of some varsity athletes suck.  They act as if they have more of a right to social spaces...but due to the nature of the frat scene--they are the social space.",
            "Author": "Recent Alumnus",
            "Date": "2014-05-15T20:58:04Z"
        },
        {
            "Rating": 1,
            "Review": "Alot of drinking, sexual assault, rape, overall disrespect towards women; peer pressure; lack of leadership regarding violence/rape culture against women",
            "Author": "Recent Alumnus",
            "Date": "2014-05-15T20:55:30Z"
        },
        {
            "Rating": 5,
            "Review": "The officers (Safety and Security) are actually there for your security, not to get you in to trouble.  Dartmouth is fairly lenient with its policies making the campus life quite enjoyable.",
            "Author": "College Freshman",
            "Date": "2014-04-07T23:21:30Z"
        },
        {
            "Rating": 3,
            "Review": "There have recently been many protests over this exact same concept of diversity.  I think Dartmouth may be able to do a better job with the diversity here, but it is hard to please everybody.",
            "Author": "College Freshman",
            "Date": "2014-04-07T23:17:41Z"
        },
        {
            "Rating": 3,
            "Review": "As for Varsity sports, we kind of suck.  Nobody really cares though, since almost everyone here is an athlete in one way or another.  Most people go to the gym and even for a small school, our gym is way too small.  And we need more basketball courts for the normal students.",
            "Author": "College Freshman",
            "Date": "2014-04-07T23:10:27Z"
        },
        {
            "Rating": 4,
            "Review": "Attitudes of privilege can be prevalent depending on your social circles. Dartmouth is pretty diverse on the whole, though",
            "Author": "College Freshman",
            "Date": "2014-02-15T13:48:57Z"
        },
        {
            "Rating": 3,
            "Review": "Greek life runs the social atmosphere on campus. Everyone is allowed to go to most parties, mostly because those are the only parties. They are somewhat insular and revolve around drinking, but it is usually the only option.",
            "Author": "Recent Alumnus",
            "Date": "2013-12-27T11:06:17Z"
        },
        {
            "Rating": 3,
            "Review": "The college is strict on varying topics and situations. School safety officers will sometimes be harsh on frat parties and other times won't seem to care or stop anything from going wrong. The administration is aware of the drinking, drug, race, and sexual assault problems, but will only really address it now that it is being publicized in the media.\r\n\r\nIt lacks consistency in it strictness. I have also seen occurrences where black students have received punishment (including suspension/expulsion) for the same situations (involving drinking, drugs, academic or sexual assault problems) as their white counterparts, but the white students have not received the same punishment.",
            "Author": "Recent Alumnus",
            "Date": "2013-12-27T10:25:49Z"
        },
        {
            "Rating": 4,
            "Review": "guys are athletic and \"fratty\"\r\ngirls are new england preppy",
            "Author": "College Senior",
            "Date": "2013-12-06T16:33:08Z"
        },
        {
            "Rating": 5,
            "Review": "many options\r\nmajority of students are affiliated\r\ngreek houses are more like clubs/extra things students do rather than exclusive cliques",
            "Author": "College Senior",
            "Date": "2013-12-06T16:32:11Z"
        },
        {
            "Rating": 3,
            "Review": "students are very active and athletic\r\nmany are varsity or club athletes\r\npart of D1 athletics by virtue of ivy-league, but dont expect a huge football school",
            "Author": "College Senior",
            "Date": "2013-12-06T16:28:32Z"
        },
        {
            "Rating": 4,
            "Review": "Campus officers are kind and helpful\r\nSmall school lends itself to strong and cooperative community\r\nStudents are given a high degree of independence\r\nVery strict honor code",
            "Author": "College Senior",
            "Date": "2013-12-06T16:16:07Z"
        },
        {
            "Rating": 5,
            "Review": "Watch Animal House. Understand the importance of frats to Dartmouth. Know that we are actually nothing like Animal House. Yes, we have some crazy frats, but we also have very respectable frats for every type of person. It is both totally ok not to pledge, and totally ok to do so as well. No pressure, as you cannot rush until Sophomore year. On another note, many of our Frats broke from National organisations in the 1950s when these organisations instituted racist policies. Go Dartmouth!",
            "Author": "College Freshman",
            "Date": "2013-11-27T00:00:47Z"
        },
        {
            "Rating": 5,
            "Review": "Alcohol is and always will be an issue, but the big debate is protesting. there are a small number of vary radical students who protest everything. The administration lets them, but this may change due to student complaints.",
            "Author": "College Freshman",
            "Date": "2013-11-26T23:40:38Z"
        },
        {
            "Rating": 4,
            "Review": "I do the forestry team and fencing.",
            "Author": "College Freshman",
            "Date": "2013-11-26T19:32:53Z"
        },
        {
            "Rating": 5,
            "Review": "It's Dartmouth. We invented social.",
            "Author": "College Freshman",
            "Date": "2013-11-26T19:32:12Z"
        },
        {
            "Rating": 5,
            "Review": "I have friends from all over the world and from various religious and ethnic backgrounds. Dartmouth frats famously broke from national ones when national frats banned certain minorities back in the 50s. Anyone who says dartmouth is intolerant is just looking for problems that are not there.",
            "Author": "College Freshman",
            "Date": "2013-11-26T19:31:18Z"
        },
        {
            "Rating": 5,
            "Review": "I think the girls on campus are all very pretty, and they are certainly all very smart and usually able to carry out very interesting conversations.  All girls are pretty athletic, and there seems to be a range in attire from preppy to really athletic.",
            "Author": "College Freshman",
            "Date": "2013-11-25T20:10:19Z"
        },
        {
            "Rating": 4,
            "Review": "You can go to almost any game you want and have no trouble finding seats.  There isn't much of a following for most sports, but students do enjoy going to most varsity athletic events and take pride in it.",
            "Author": "College Freshman",
            "Date": "2013-11-25T19:37:29Z"
        },
        {
            "Rating": 3,
            "Review": "Parties are open to all the students, but there is such great involvement in frats and sororities that you'd feel left out if you were unaffiliated.",
            "Author": "College Freshman",
            "Date": "2013-11-25T19:35:28Z"
        },
        {
            "Rating": 3,
            "Review": "With the exception of a handful of international students, Dartmouth is a pretty homogenous community. The students are predominately white as are the professors. The greek system is dominated by heterosexual white men who come from wealthy families and who are not very accepting, particularly of students with different sexual orientation. Because Dartmouth is far from any major city, it lacks the level of diversity (racial & economic) that many colleges in urban communities have.",
            "Author": "College Senior",
            "Date": "2013-09-15T10:24:29.153Z"
        },
        {
            "Rating": 3,
            "Review": "not the best looking, but people are very friendly and love the school. Really great friends and people.",
            "Author": "College Senior",
            "Date": "2013-08-10T15:52:24.88Z"
        },
        {
            "Rating": 4,
            "Review": "Greek life is very big at Dartmouth for almost all students; it really dominates the social scene, especially for underclassmen who cannot drink anywhere else.  There isn't a big party scene outside of the Greek houses, but you don't have to be a member or even know a member to attend.  Rush happens sophomore year (meaning you get to explore Greek life and meet affiliated and unaffiliated students before choosing whether it's for you), and while most students do rush one of the 17 fraternities, 10 sororities, or three co-ed houses, it's not a big deal if you decide not to rush.  And for people who don't like the idea of frat parties, the college does a great job with alternative programming and smaller parties.  Whether affiliated or unaffiliated, a supporter of the Greek scene or a condemner of it, you can find people to hang out with and you won't be judged for your choice.",
            "Author": "College Sophomore",
            "Date": "2013-07-11T13:25:39.3Z"
        },
        {
            "Rating": 4,
            "Review": "Varsity sports at Dartmouth College are really cool, especially when it is a game against another college within the Ivy League, which I feel makes it all the more exciting. I'd have to say academics takes hold here, but there are quite a number of games that get a great turnout for the game. Our gym is amazing. We have everything any athlete would need. Our football field is next to the gym and on campus, which makes it really easy to walk to considering Dartmouth is a small college. I'd have to say that one of the more popular sports at Dartmouth is Hockey.",
            "Author": "College Junior",
            "Date": "2013-06-13T01:00:20.967Z"
        },
        {
            "Rating": 3,
            "Review": "Athletes are pretty respected, but I don't think games have that good of attendance, with the exception of select hockey and football games. Facilities are pretty nice, and athletes definitely have perks though.",
            "Author": "College Junior",
            "Date": "2013-06-10T15:25:43.233Z"
        },
        {
            "Rating": 3,
            "Review": "I feel like whatever background you may come from you'll be able to find someone like you and/or a community to identify with, if you so choose. That's not to say that some groups are definitely more represented/visible than others. Regardless, Greek houses (the main component of social life) have plenty of minority members (sexual orientation, ethnic, otherwise), much more than you would see at a typical state school.",
            "Author": "College Junior",
            "Date": "2013-06-10T15:23:32.707Z"
        },
        {
            "Rating": 3,
            "Review": "UGA's (RA's) are generally pretty lenient, Safety and Security mainly just tries to keep you safe. You might get in trouble if you do something that ends up crossing the desk of an administrator or judicial, then they tend to be less understanding--but you generally have to do something pretty bad for that to happen.",
            "Author": "College Junior",
            "Date": "2013-06-10T15:18:37.96Z"
        },
        {
            "Rating": 3,
            "Review": "While the College is actively trying to diversify the student body, especially with the large amount of Native American students admitted this past year, there is still a need from more diversity.",
            "Author": "College Junior",
            "Date": "2013-05-15T05:56:17.31Z"
        },
        {
            "Rating": 3,
            "Review": "As a member of the Greek scene at Dartmouth I am a bit indifferent. I have had such  a great time meeting new people and engaging in conversations with people very different from me that would only occur within the Greek scene. The down side is that it dominates campus social life and if you don't drink and are not into the hook up culture it could be hard to navigate. I personally dont drink but have been able to find my place within greek life on campus and am so glad I joined.",
            "Author": "College Sophomore",
            "Date": "2013-05-05T13:29:10.77Z"
        },
        {
            "Rating": 3,
            "Review": "Greek like dominates. You have to go Greek (and enter one of the three \"good\" sororities or 5 \"good\" fraternities) to be considered social/cool.",
            "Author": "College Freshman",
            "Date": "2013-04-24T00:21:57.163Z"
        },
        {
            "Rating": 2,
            "Review": "Dartmouth students don't really seem to care about sports teams. No one really goes to sporting events other than hockey games.",
            "Author": "College Freshman",
            "Date": "2013-04-10T14:47:01.75Z"
        },
        {
            "Rating": 4,
            "Review": "With Dartmouth being fairly isolated, Greek life dominates the social scene.",
            "Author": "College Freshman",
            "Date": "2013-04-10T14:45:11.83Z"
        },
        {
            "Rating": 4,
            "Review": "Greek life is really big at Dartmouth, both fraternities and sororities, and most people who are eligible (sophomores and older) to be in a house do join one.  While most of the nightlife involves the fraternities– which are generally open to all students indiscriminately– there are other options of things to do, and there isn't a whole lot of social status or stigma associated with particular houses.  Every house has at least some really cool people, and going to parties or going to play pong can be  a lot of fun.  The greek system is there if you want it, but not totally necessary; I have friends that spend multiple nights a week going out to frats and some that have never set foot in one, and all of them are great people and are enjoying themselves.  It is what you make of it!",
            "Author": "College Freshman",
            "Date": "2013-03-25T16:44:20.473Z"
        },
        {
            "Rating": 4,
            "Review": "Dartmouth does a good job in creating a inclusive environment.",
            "Author": "College Sophomore",
            "Date": "2013-02-21T16:50:17.047Z"
        },
        {
            "Rating": 4,
            "Review": "Out of all the Ives, dartmouth is definitely one of the top for athletic programs. Almost everyone is involved in some sort of sport, whether it is varsity athletics, club, or intramural. There is never a dull moment on campus, if you are looking for an activity, there are always people who are willing to go on an adventure with you. Hockey is our sport but football is working their way back to being a big part of the student culture. There are always crowds at the lacrosse games especially the women's games since they are one of the top programs in the country. Men's soccer and rugby are also huge at dartmouth and everyone always makes going to the games a huge part of the day.",
            "Author": "Recent Alumnus",
            "Date": "2013-02-06T15:03:30.017Z"
        },
        {
            "Rating": 3,
            "Review": "it's an issue at dartmouth but people are also working hard to make a change. I wouldn't say everyone is white because there are a lot of minorities there. If you are looking to go to a  school who is consistently working hard on their issues, dartmouth is for you. They are always open to new ideas and students looking to be active leaders for change.",
            "Author": "Recent Alumnus",
            "Date": "2013-02-06T14:58:05.343Z"
        },
        {
            "Rating": 2,
            "Review": "The campus is not very strict at all. The police are basically there to make sure you don't die. Every once in a while they will get someone in trouble to make an example, but for the most part they are actually very nice. Some topics like hazing are treated more harshly though.",
            "Author": "College Junior",
            "Date": "2012-12-31T11:57:33.503Z"
        },
        {
            "Rating": 4,
            "Review": "I think Dartmouth has a pretty good variety of guys and girls.  There are a lot of affluent, slightly preppy guys who wear polos and boat shoes, but there are also hipsters, athletic guys, nerdy guys, etc.  Girls are usually genuine and there aren't too many biddies.  There are a lot of attractive people, as well as plenty of unattractive people, but true to stereotype, most of the less-atrractive, geekier types don't go out and only socialize amongst themselves, so you don't see them around so much.  Quite a bit of diversity for a school its size.",
            "Author": "College Freshman",
            "Date": "2012-12-29T22:25:25.32Z"
        },
        {
            "Rating": 3,
            "Review": "Even though a large percent of Dartmouth students are athletes, there is not a lot of school spirit when it comes to sports. There is an absurd amount of school spirit in general because everyone loves Dartmouth but our sports teams do not have many fans at their games. Soccer, hockey, rugby, and baseball usually do well and tend to have more fans and support than the other sports. Fortunately for our athletes, they get treated like royalty regardless of their records. They have really nice training facilities, free academic tutors, free gear, and free chocolate milk in the weight room! IM sports are where it is at in the athletic scene though. Especially when the greek system gets involved.",
            "Author": "College Sophomore",
            "Date": "2012-12-28T15:28:52.03Z"
        },
        {
            "Rating": 4,
            "Review": "Varsity sports at Dartmouth are fairly important, and Dartmouth is home to many athletes and athletic students. Our gym is pretty nice, and is almost constantly getting an upgrade of some sort. That being said, Varsity can be a bit competitive and it can be hard to walk on a team, but that's why our IM and  club sports are there! Those are just as competitive as their varsity counterparts, but can be more fun.",
            "Author": "College Sophomore",
            "Date": "2012-12-09T19:10:32.913Z"
        },
        {
            "Rating": 4,
            "Review": "Totally Chill – The only student I know who's ever been put on academic probation was a kid who was arrested for ordering drugs from overseas.  Although the local police puts up a big show, campus safety and security really just cares about the well-being of the students.  Underage drinking is common, and there is a system in place to protect students in danger due to drinking without facing any charges.",
            "Author": "College Junior",
            "Date": "2012-11-25T12:07:17.237Z"
        },
        {
            "Rating": 3,
            "Review": "Greek life is pretty all-encompassing at Dartmouth.  While other communities do exist - notably the Dartmouth Outing Club, Theater, and Religious Groups, among others - 60% of eligible students (sophomores to seniors) are affiliated.  Although involvement after pledge term varies greatly.\r\n\r\nAlso, there's no bad blood if you're not affiliated.  Many people choose not to go Greek.",
            "Author": "College Junior",
            "Date": "2012-11-25T11:58:40.473Z"
        },
        {
            "Rating": 3,
            "Review": "The guys are typically very nice and intelligent. There are all kinds of different types, but you do have to watch out for the guys who only want a hook-up.\r\n\r\nThe girls are okay. Most are small and pretty, but some can be very emotional and a little too controlling. If you  look, you can find a good one though. But most of the good ones tend to be taken.",
            "Author": "College Junior",
            "Date": "2012-10-20T11:42:38.087Z"
        },
        {
            "Rating": 4,
            "Review": "A Fit Student Body – over 75% of the student body is involved in varsity sports and a majority of the ones not involved in varsity sports are involved in a club sport, dance group, or other active group.  \r\n\r\nIt is a very activity based campus.  There are clubs/groups for every interest.  Fraternities and sororities are also big.\r\n\r\nThere is a variety of types of people--there are the jocks, artsy, preps, etc, like all schools.  The dress is mainly preppy, although you will see athletes and hard core studiers in sweats the majority of the time.",
            "Author": "Recent Alumnus",
            "Date": "2012-09-02T00:38:44.823Z"
        },
        {
            "Rating": 4,
            "Review": "Freedom to Breathe – Dartmouth is generally not as strict as some schools. The dorms do not have monitors, so there is no strict visitor policy (unlike at some schools that I have visited friends at). Academically, we follow the Honor Principal, and though the cost of being discovered cheating can be severe (suspension for the term, etc.), there isn't a lot of regulation in the sense that students aren't expected to cheat. \r\nLikewise, for drinking, the policy tends to gear towards student safety. There is a student-initiated Good Sam policy in that if a student is intoxicated, a \"Good Sam\" (for \"Good Samaritan\") may be called in, and the student will be checked out and given care as necessary. Even if the student is underage, the student will not receive an infraction unless he/she resists the officer.\r\nIn essence, if extreme infractions are committed, there are certainly consequences, but the campus police are NOT trying to breathe down the students backs. In general administration is trying to work with students and protect them, not police them.",
            "Author": "College Junior",
            "Date": "2012-08-15T16:50:58.18Z"
        },
        {
            "Rating": 4,
            "Review": "We have a very statistically diverse school - it always ranks highest among the most diverse student bodies. However, like many other aspects of life, students tend to group themselves with like-students. Therefore, I've found that the Greek system, the dominating social scene on campus, is very \"white-washed,\" and that other minority-organizations tend to stick to themselves. That being said, we have many minority-based events that are very vocal, and I've never seen or experienced any racist behavior that made me feel unconfortable.",
            "Author": "College Junior",
            "Date": "2012-08-15T12:08:35.143Z"
        },
        {
            "Rating": 3,
            "Review": "Getting Better – Overall, Men's soccer is the only sport on campus that consistently is a top 25 D1 NCAA team.  They have made the NCAA tourney for the past 5 consecutive years and have had 3 players go professional.  Other than that hockey is decent at best.  Over the past few years, athletics have been getting better with each new class garnering more talent, especially the 2015 class.",
            "Author": "College Sophomore",
            "Date": "2012-08-11T23:57:27.73Z"
        },
        {
            "Rating": 4,
            "Review": "Depends on the S&S Officer – Most of the time, S&S (the campus/public safety) officers are very understanding and often look the other way, as long as you are not in danger. If they bust a party in your dorm room, they might write you up, or they might just tell you to pour your drinks out. It depends on who you get... I was pretty unlucky one time and had the only strict officer on campus bust my party. But otherwise, most students feel that S&S really is there to help them. As far as academics go, the honor code is very important to Dartmouth so you don't want to be on the other end of that judicial violation.",
            "Author": "College Sophomore",
            "Date": "2012-08-06T12:35:24.263Z"
        },
        {
            "Rating": 5,
            "Review": "All Inclusive Animal House – The Animal House vision most people have of Dartmouth is alive and well in frats like AD (the real life version of John Belushi's frat), Theta Delt (also known as TDX), and Psi U. That being said, there are a variety of options which a less rage-y prospective greek member can aim for. From stoners (who tend to rush Bones Gate) to the outdoorsy (Alpha Chi) and even to the math majors (Sig Nu), there is a home for every type of person in the Dartmouth greek system. Each house has its own unique stereotype as well as a large selection of brothers who fit horribly into that mould.",
            "Author": "College Sophomore",
            "Date": "2012-07-22T13:58:04.227Z"
        },
        {
            "Rating": 5,
            "Review": "Super Diverse – My writing class consisted of two native americans, three hispanic kids, three african americans, four asians, and 5 white students. pretty much reflective of the entire school. A lot fo white preppy kids though.",
            "Author": "College Sophomore",
            "Date": "2012-07-11T09:46:29Z"
        },
        {
            "Rating": 3,
            "Review": "Very Diverse, but Some Say Not Enough – The campus is extremely diverse, especially for its small size, but that hasn't helped the race relations much.  Partly do to that small size and diversity groups often feel marginalized and act out in disturbing ways.",
            "Author": "Recent Alumnus",
            "Date": "2012-07-03T14:50:08.23Z"
        },
        {
            "Rating": 4,
            "Review": "If you're not going to rush a frat, you might want to consider another school. The frat culture is pervasive and nearly 60-70% of eligible students rush. There is nearly nothing to do other than frat parties at night, save hanging out with friends in the dorm.",
            "Author": "College Freshman",
            "Date": "2012-04-23T17:17:59.15Z"
        },
        {
            "Rating": 4,
            "Review": "Dating is Possible – I don't know why everyone says it is impossible to have a relationship here. Six people on my floor (myself included) are in serious relationships with other people here at Dartmouth. I see couples holding hands on campus all the time. The D-Plan makes sustaining these relationships more difficult, but it is definitely possible. Hookups are prevalent, but they are not the only option!",
            "Author": "College Freshman",
            "Date": "2012-02-05T14:56:00.827Z"
        },
        {
            "Rating": 4,
            "Review": "Anyone can go to any of the frats and hang out, play a game of pong, or dance. It's so different from the exclusive Greek life at southern state schools. I love it!",
            "Author": "College Freshman",
            "Date": "2012-02-05T14:44:07.527Z"
        },
        {
            "Rating": 4,
            "Review": "Safety and Security is pretty chill about drinking, and there are usually no legal consequences.",
            "Author": "College Freshman",
            "Date": "2012-01-21T17:53:42.807Z"
        },
        {
            "Rating": 4,
            "Review": "High Enrollment of Native Americans – Dartmouth College has a very diverse community, including a great diversity within the Native American community. The Native American Program is awesome and helps aid Native students throughout the year.",
            "Author": "College Freshman",
            "Date": "2011-12-28T12:00:11.99Z"
        },
        {
            "Rating": 4,
            "Review": "Good for both – Most people are athletic and attractive here. However it is an ivy, and looks will be at or below your average State school. My sister attended Yale, so I went there a lot in high school, and the guys here are slightly more attractive, and the girls slightly less. Dartmouth is the second most attractive Ivy under Yale, and therefore give guys an A and girls an A-/A.",
            "Author": "College Sophomore",
            "Date": "2011-12-24T14:36:19.023Z"
        },
        {
            "Rating": 3,
            "Review": "Everyone Is Awesome – Everyone has their own interest. No matter who you are and what you do, you can find similarly minded people and have a great time.",
            "Author": "College Freshman",
            "Date": "2011-12-05T00:52:22.407Z"
        },
        {
            "Rating": 3,
            "Review": "Campus Security Good, Hanover Police Awful – Campus security (Safety and Security, aka S&S) is pretty good, they usually aren't too strict.  If you are clearly drunk and might need some help, they send you to dicks house or they will respond to a call (a \"Good Sam\") asking for their help.  Neither gets you in legitimate trouble.  They do put fraternities on probation, however, fairly frequently.\r\nHanover police, however, are a completely different story.  They seem to do anything they can to get dartmouth kids in trouble (probably because they don't have anything else to do).  They will literally drive around looking for any drunk person they can find.  I know many, many kids who have been arrested for drinking.  They also conduct drug stings.  Everyone hates hpo and the chief is constantly mocked by students.",
            "Author": "College Sophomore",
            "Date": "2011-05-13T19:35:16.637Z"
        },
        {
            "Rating": 4,
            "Review": "Very Prevalent – Definitely a big part of campus, but it's possible to get away.",
            "Author": "College Freshman",
            "Date": "2011-03-11T22:32:18.183Z"
        },
        {
            "Rating": 4,
            "Review": "Very Athletic Campus – We have great facilities.  I'm not a huge athlete, so I've been on a club team, which is not a large time commitment.  Our winter sports are especially great.  We have an amazing hockey team which the whole campus follows.",
            "Author": "College Junior",
            "Date": "2011-03-10T10:17:47.063Z"
        },
        {
            "Rating": 3,
            "Review": "It Depends – At Dartmouth your punishment really depends on what you've done academically or socially. Academically, it's not that bad: just don't fail. However if you get Good Sammed too many times, watch out! You might get Park'd.",
            "Author": "College Freshman",
            "Date": "2011-03-01T00:38:18.077Z"
        },
        {
            "Rating": 3,
            "Review": "Everyone Is Pretty Average – We're an attractive group of people at Dartmouth but we really don't stand out. The minorities are pretty hot though.",
            "Author": "College Freshman",
            "Date": "2011-03-01T00:36:04.62Z"
        },
        {
            "Rating": 4,
            "Review": "I have met so many people from different walks of life. Everyone on campus is very open minded to people who may not be the same as them. In this way, no one is afraid of expressing him or herself.",
            "Author": "College Freshman",
            "Date": "2011-01-25T01:40:39.377Z"
        },
        {
            "Rating": 3,
            "Review": "Love and Lust – It is true. Dartmouth is very much a hook-up school. This is because a.) everyone comes here knowing about the hook-up culture and models their relationships according (self-fulfilling prophecy); b.) in high school, we put a lot of things on the backburner, so hooking up is a way to sample the many things we missed out on; and c.) we have hormones and school feels too demanding to develop a relationship. However, all hope is not lost as there are plenty of couples whose relationships range from casual and low-pressure to \"married for life.\" In terms of looks, I would give Dartmouth a B+ because when someone looks good, they look GOOD. Everyone is athletic and in shape for the most part. One more thing, the guys are slightly better looking than the girls. I would give the guys a B+, maybe an A-, and the girls a solid B. However, the girls can go out of their way and really glam it up.",
            "Author": "Niche User",
            "Date": "2010-10-24T04:57:53.873Z"
        },
        {
            "Rating": 4,
            "Review": "Greeks Totally Dominate the Scene – Dartmouth is a very Greek centric community. If you aren't in to that kind of thing you will be fine though. There are plenty of students who don't join a house - but over 60% do end up joining.",
            "Author": "College Senior",
            "Date": "2010-10-12T17:38:34.44Z"
        },
        {
            "Rating": 3,
            "Review": "Guys and Girls Are Pretty Good Looking – I mean, it's an ivy league school so you don't have tons of models here but the majority of the student population is pretty good looking.",
            "Author": "College Senior",
            "Date": "2010-10-12T17:35:30.693Z"
        },
        {
            "Rating": 4,
            "Review": "Nowwww It's Good. When I was a freshmen, I think all our sports teams collectively won maybe 1 game.  Two years later, that's managed to turn around.  Our formerly winless football team held their own through overtime, losing by a touchdown to Ivy League favorites, UPenn, which also happens to have almost 3x the undergraduates.  Participation is good, everyone does at least some kind of physical activity.",
            "Author": "College Junior",
            "Date": "2010-10-08T16:59:56.167Z"
        },
        {
            "Rating": 4,
            "Review": "Very Diverse-Especially for New Hampshire – While white is the majority, all races are prevalent on campus. As with most colleges, self-segregation is an issue but all groups are equally as accepting of other races and cultural backgrounds. The LGBT community is out in the open and accepted by everyone. As far as socio-economic status, there are a lot of rich, private school kids.  There's no discrimination against those on financial aid but at times the way of thinking of rich kids compared to middle class kids can be weird. But I think people of any culture or class would overall be comfortable at Dartmouth.",
            "Author": "College Sophomore",
            "Date": "2010-08-31T14:50:26.997Z"
        },
        {
            "Rating": 3,
            "Review": "Pretty Lax – The college can be asinie if you get caught, but the chances are very low especially since s n s rarely enters a frat house and won't check your ID unless you're genuinely acting like an idiot. Many freshmen get away with a lot of thing they wouldnt otherwise have been able to. The campus is strict however on plagiarism. You can get kicked out for plagiarizing yourself!",
            "Author": "Recent Alumnus",
            "Date": "2010-08-14T19:59:47.07Z"
        },
        {
            "Rating": 2,
            "Review": "Sports Are Unheard of – I don't hear very much good about our spotrs teams and the only time anyone ever goes to a game is if they know someone on the team. That being said IM sports are pretty well attended and are a lot of fun",
            "Author": "Recent Alumnus",
            "Date": "2010-08-14T19:57:41.803Z"
        },
        {
            "Rating": 3,
            "Review": "Long-lasting relationships are possible, but hard to come by. Most relationships are limited to drunken hook-ups that begin in frat basements. Many students blame the D-Plan for this lack of commitment.",
            "Author": "College Sophomore",
            "Date": "2010-08-08T16:57:11.627Z"
        },
        {
            "Rating": 3,
            "Review": "They say its a very diverse campus, and during the day it seems like it as well, but social scene is very white.",
            "Author": "College Sophomore",
            "Date": "2010-08-06T00:36:05.863Z"
        },
        {
            "Rating": 4,
            "Review": "Party Scene Revolves Around the Frats – I'm a person who does like the Greek party scene, so I would give it an A. I wouldn't say the social scene revolves around the Greek life because there are a ton of other social outlets. However, partying and drinking go hand in hand with the frats. Half the campus is affiliated, what can I say? They're also VERY open and no exclusivity.",
            "Author": "College Sophomore",
            "Date": "2010-08-03T11:03:43.037Z"
        },
        {
            "Rating": 3,
            "Review": "Somewhat Overrated – Dartmouth has pretty much average frat parties. They're open to everyone, generally speaking, which can be nice for those who like to fill their weekends with Dartmouth's freely-flowing Keystone Light. I say average because they are neither super-rowdy nor super-downbeat. There are Greek houses pretty much for everyone.\r\n\r\nI claim Greek life is overrated because there are those who within the system for whom nothing else seems to matter. Greek life is their life. However, for those outside or on the periphery of the system, which is a solid if not an overwhelming majority, the fuss about which house is better than what house can seem downright, well, fussy and pointless. The majority of campus falls somewhere in between. It's up to you how involved you want to get with Greek life.",
            "Author": "College Sophomore",
            "Date": "2010-07-18T01:11:49.633Z"
        },
        {
            "Rating": 3,
            "Review": "Good Sports – Sports at Dartmouth are prevalent on campus. While we do not excel at all our sports, we have a strong fan base.",
            "Author": "College Sophomore",
            "Date": "2010-06-21T13:39:36.83Z"
        },
        {
            "Rating": 4,
            "Review": "There are so many different types of people at Dartmouth. The campus is full of different cultures and backgrounds ranging from Native Americans to Australians. The diversity on campus is a great way to expand knowledge and understanding of others.",
            "Author": "College Sophomore",
            "Date": "2010-06-21T10:23:30.58Z"
        },
        {
            "Rating": 4,
            "Review": "Not Very Strict – Things are pretty lenient. The police patrol campus but underage drinking still clearly goes on and they know that we do it. It's just the culture of the campus and what not.",
            "Author": "College Junior",
            "Date": "2010-04-18T19:57:52.563Z"
        },
        {
            "Rating": 1,
            "Review": "Footbal Team – we have a very very bad football team. We are lucky if we win 2 games a season.",
            "Author": "College Sophomore",
            "Date": "2010-04-12T14:44:33.49Z"
        },
        {
            "Rating": 3,
            "Review": "Frats and Sororities Dominate the Scene – Out of all eligible students (sophomores and upperclassmen), 60% are Greek. However, the Greek system at Dartmouth is very open, and freshmen and non-Greeks are extremely welcome at all social functions. The houses are very involved with on-campus activities, often co-sponsoring concerts and charity events.",
            "Author": "College Freshman",
            "Date": "2010-03-19T16:24:36.9Z"
        },
        {
            "Rating": 5,
            "Review": "Boy and Girls at Darthmouth – the students are very friendly and interesting they are very wise and smart.",
            "Author": "College Senior",
            "Date": "2010-03-18T17:10:03.65Z"
        },
        {
            "Rating": 5,
            "Review": "One of the main attractions of my school, is that its off secluded in the mountains, in fact we call it the \"Dartmouth Bubble\" its great, but its also terrible. Terrible in the sense that we are sheltered perhaps from the real world with all of the tolerance of different walks of life on campus, that perhaps it enables us to be prepared for the real world, where people are ignorant some times of sexuality or stereotypical images. Sometimes coming home from breaks I forget that in every day life people will stare at a group of people that randomly decided to dress in costumes and go to class,while spray painting their hair bright orange. I also forget that sometimes telling someone that you are not straight could be something to deal with in the real world, but for now I revel in the fact that diversity is celebrated at my school,in the most positive of ways.",
            "Author": "College Junior",
            "Date": "2010-03-06T23:22:08.247Z"
        },
        {
            "Rating": 3,
            "Review": "It's pretty diverse. On a scale from 0 to 10, I would put Dartmouth's diversity at a 7 or 8ish. Anything higher would, by necessity, mean compromising the emphasis on merit that exists within the system to the extent that is unfair. A school that is a to-scale proportion of every demographic group within the United States is either a miraculously precise coincidence or a lie. Basically, the demographic situation at Dartmouth is ideal.",
            "Author": "College Junior",
            "Date": "2009-03-10T03:28:45.387Z"
        }
    ],
    "Academics": [
        {
            "Rating": 4,
            "Review": "Great, some professors could be more involved.",
            "Author": "Recent Alumnus",
            "Date": "2016-01-02T00:28:19Z"
        },
        {
            "Rating": 5,
            "Review": "Huge variety of topics; there are too many classes I want to take, and there isn't enough time. Registration is easy; if you want a class, you're pretty much going to get it.",
            "Author": "College Freshman",
            "Date": "2015-12-30T23:17:04Z"
        },
        {
            "Rating": 3,
            "Review": "The work load can be overwhelming with the other athletics and activities expected of students. Time is just tight.",
            "Author": "College Freshman",
            "Date": "2015-01-15T18:39:16Z"
        },
        {
            "Rating": 5,
            "Review": "The campus offers so MANY avenues to improve readings e.g. RWIT tutoring",
            "Author": "College Sophomore",
            "Date": "2015-01-08T21:42:24Z"
        },
        {
            "Rating": 4,
            "Review": "At any time, students may sign up for a minimum of two classes and a maximum of four classes a term. Usually, one would take three. Now, three classes doesn't sound like a lot of work, but Dartmouth runs on a trimester system so each term flashes by in about 10 weeks. Also, it's Dartmouth, you're in for a lot of work no matter what class you sign up for! I think I was pretty lucky my first term though. I signed up for classes in Spanish, Human Biology, and Multivariable Calculus, but it felt like I had much less work and stress than expected for my first term of college. That's not to say the classes were super easy, but I definitely got more sleep than most of my friends did haha. Also, I did super well in all of my classes and my exams! I think that was mostly in part due to my professors. They were friendly and actually cared about what they were teaching and the success of their students. The curriculum of their classes were also well-organized, although I did feel a little rushed due to there being only 10 weeks to learn everything. Even so, I can definitely say I'm looking forward to the classes I'll be taking in the future. Dartmouth has such a wide variety of subjects, being a liberal arts school, that I can always find something to be interested in if I'm unable to get into the class I wanted.",
            "Author": "College Freshman",
            "Date": "2014-12-15T14:46:22Z"
        },
        {
            "Rating": 5,
            "Review": "The professors I've had have been great and very approachable.",
            "Author": "College Freshman",
            "Date": "2014-11-20T21:57:19Z"
        },
        {
            "Rating": 4,
            "Review": "I had a full-time internship this summer at a hospital research center than was unpaid but Dartmouth gave me a stipend to cover living expenses and food and I still had a couple thousand left over to save. I felt very prepared for the internship because of my classes at Dartmouth. I was able to do an independent project and write a paper to publish in a scientific journal.",
            "Author": "College Sophomore",
            "Date": "2014-09-09T15:01:48Z"
        },
        {
            "Rating": 5,
            "Review": "Fantastic opportunities and professors are always available to help you.",
            "Author": "College Sophomore",
            "Date": "2014-09-08T19:43:39Z"
        },
        {
            "Rating": 5,
            "Review": "Great facilities, decent workload, fantastic professors and research opportunities. Lots of internship and job opportunities - students are highly sought after by employers!",
            "Author": "College Sophomore",
            "Date": "2014-09-08T19:43:39Z"
        },
        {
            "Rating": 5,
            "Review": "Top-notch school with fantastic academics! Students are smart and driven. Great professors, programs, and lots of opportunities for research. Strong focus on undergrads!",
            "Author": "College Sophomore",
            "Date": "2014-09-08T19:35:08Z"
        },
        {
            "Rating": 5,
            "Review": "Great study-abroad program in New Zealand for Anthropology majors. Amazing faculty and programs in all departments. Tons of internship and job opportunities - students are highly sought after by employers!",
            "Author": "College Sophomore",
            "Date": "2014-09-08T19:35:08Z"
        },
        {
            "Rating": 5,
            "Review": "Fantastic internship opportunities - students are highly sought after by companies. Great academic programs with lots of choices and great programs and professors! Very focused on undergraduates with lots of opportunities to do research!",
            "Author": "College Sophomore",
            "Date": "2014-09-08T19:29:48Z"
        },
        {
            "Rating": 5,
            "Review": "I couldn't be more impressed. The US News #1 undergrad teaching ranking seems accurate. The profs I have had have been incredibly smart, articulate, and passionate, and are often leaders in their fields. The library is great - very modern and plenty of space to study (except for during finals). The workload is tough but manageable; it definitely forces you to be careful with your time management.",
            "Author": "College Sophomore",
            "Date": "2014-08-04T15:24:37Z"
        },
        {
            "Rating": 4,
            "Review": "I do not think it is difficult to be accepted into the department you would like to major in.",
            "Author": "College Sophomore",
            "Date": "2014-07-23T17:34:20Z"
        },
        {
            "Rating": 3,
            "Review": "I am currently undeclared so I have not negative nor positive to say.",
            "Author": "College Sophomore",
            "Date": "2014-07-23T17:34:20Z"
        },
        {
            "Rating": 4,
            "Review": "The professors seem to really have an interest in students as individuals. I have profited from relatively small class sizes couple with very accommodating office hours.",
            "Author": "College Sophomore",
            "Date": "2014-07-23T17:24:50Z"
        },
        {
            "Rating": 3,
            "Review": "Considering the fact that I am currently undecided, this may defeat some of the purpose of the question. Nevertheless, it can be difficult to still be uncertain about what to major in when you feel you ought to decide quickly so that you can start moving toward being successful in the respective department; however, the stress is more from an internal cause than an external one.",
            "Author": "College Sophomore",
            "Date": "2014-07-23T17:24:50Z"
        },
        {
            "Rating": 4,
            "Review": "Economics is one of the most popular majors are Dartmouth, its very good for job opportunities but also very competitive in that aspect. Workload depends on the class really, but generally its pretty rigorous.",
            "Author": "College Junior",
            "Date": "2014-07-12T15:01:55Z"
        },
        {
            "Rating": 4,
            "Review": "The Economics Department is one of the biggest at Dartmouth, so that's very helpful. It can mean that the program can be very impersonal though.",
            "Author": "College Junior",
            "Date": "2014-07-12T14:47:30Z"
        },
        {
            "Rating": 4,
            "Review": "I've taken some really great classes here are Dartmouth. There is definitely a wide variety of in depth scholarship. There are also however classes that are poorly taught, uninteresting etc. I wish the academic advising here was better; once you get to sophomore year you find that it would have been helpful to have somewhat of a more strategic approach during freshman year",
            "Author": "College Junior",
            "Date": "2014-07-12T14:47:30Z"
        },
        {
            "Rating": 5,
            "Review": "Super easy. All majors open to everyone.",
            "Author": "College Junior",
            "Date": "2014-05-20T20:23:36Z"
        },
        {
            "Rating": 5,
            "Review": "Former White House Internship-Office of Legislative Affairs",
            "Author": "Recent Alumnus",
            "Date": "2014-05-15T21:03:00Z"
        },
        {
            "Rating": 5,
            "Review": "Government major is a very strong department, committed professors, and interesting/challenging classes",
            "Author": "Recent Alumnus",
            "Date": "2014-05-15T21:03:00Z"
        },
        {
            "Rating": 4,
            "Review": "We do not pick majors until the end of our sophomore year, but we do have academic advisers that guide us throughout our time here at Dartmouth in our respective fields.",
            "Author": "College Freshman",
            "Date": "2014-04-07T23:13:45Z"
        },
        {
            "Rating": 4,
            "Review": "The application process was not difficult, nor was the interview process, but it was nerve-wracking because of the reputation of the college. I believe the most important criteria for admission was being a well-rounded student, who was not only academically successful, but also had interests, hobbies, and focused on serving the community.",
            "Author": "Recent Alumnus",
            "Date": "2013-12-27T09:05:16Z"
        },
        {
            "Rating": 5,
            "Review": "no problem \"getting into a program\"\r\nstudents declare major their 2nd year based on their interest\r\nno need to apply to a major except for a BE at Thayer Engineering School",
            "Author": "College Senior",
            "Date": "2013-12-06T16:27:25Z"
        },
        {
            "Rating": 4,
            "Review": "career services is heavily biased towards offerings for finance and management consulting",
            "Author": "College Senior",
            "Date": "2013-12-06T16:27:25Z"
        },
        {
            "Rating": 3,
            "Review": "Lots of attention from professors\r\nSmall classes and supportive learning environment\r\nMy major is gaining more popularity (Comp Sci) and we dont have enough professors or a variety of new topics that students are interested in (data mining, deep learning, cloud computing, mobile programming) which has affected my major",
            "Author": "College Senior",
            "Date": "2013-12-06T16:23:12Z"
        },
        {
            "Rating": 4,
            "Review": "lots of study options on campus\r\nsupportive deans\r\nprofessors are widely available, helpful, and genuinely interested in students",
            "Author": "College Senior",
            "Date": "2013-12-06T16:23:12Z"
        },
        {
            "Rating": 4,
            "Review": "It's pretty much the same as it would probably be at other schools.",
            "Author": "College Freshman",
            "Date": "2013-11-25T20:07:14Z"
        },
        {
            "Rating": 4,
            "Review": "I am a Government major and the faculty has been very supportive, not just academically, but also in terms of off campus opportunities. Government is one of the most popular majors at Dartmouth. The  professors are experts in their field. For being such a small school, I am very pleased with the variety of classes they offer each term. Even the intro classes, which tend to be very dull have been engaging and worthwhile.",
            "Author": "College Senior",
            "Date": "2013-09-15T10:32:54.55Z"
        },
        {
            "Rating": 4,
            "Review": "The quarter system makes for a rigorous academic term. With only 10 weeks of class per term, there is little room for mistakes or for missing class. However, the professors are eager to work with undergrads, and they go above and beyond to help students outside of class time. The benefit of the quarter system is that it makes it easy to study abroad. More than half the students at Dartmouth study abroad; and it is not unheard of that some students study abroad twice in there four years at Dartmouth.",
            "Author": "College Senior",
            "Date": "2013-09-15T10:12:02.767Z"
        },
        {
            "Rating": 5,
            "Review": "I'm in Engineering at Dartmouth, and while it's a very intense program to do in four years, I have really enjoyed it so far.  The major is very flexible, and you don't have to go into it with a discipline in mind-- there are no departments within the engineering school, so you can take classes all across the board and really explore your options.  The professors I've had have been very helpful, both in lecture, outside-of-class help, and in helping students find engineering related jobs on campus and for off terms.  The engineering program involves a lot of hands-on, design-based courses, even for beginning students, and quite a few patents have come out of one of Dartmouth's introductory engineering classes, which I find really cool!",
            "Author": "College Sophomore",
            "Date": "2013-07-11T12:37:58.79Z"
        },
        {
            "Rating": 5,
            "Review": "There are great majors at Dartmouth.  If you can't decide then you can major and minor; major and major; major and modify (similar to major and major but not as legit.)",
            "Author": "College Sophomore",
            "Date": "2013-07-07T06:00:58.08Z"
        },
        {
            "Rating": 5,
            "Review": "The Professors you'll have at Dartmouth themselves are worth applying to Dartmouth.  Overall the academics are amazing.  Any topic you're interested in--they'll have a class relating to it.",
            "Author": "College Sophomore",
            "Date": "2013-07-07T05:59:09.707Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth offers a range of classes on almost anything you're interested in.  I'm a History major but was able to modify it with Asian Literature which goes to show the flexibility of the system.  The profs are probably the best in the US.  I've taken every single one of them out to lunch, and have continued to correspond with them since taking their classes.",
            "Author": "College Sophomore",
            "Date": "2013-07-07T05:56:53Z"
        },
        {
            "Rating": 4,
            "Review": "There is not a process for getting into programs at Dartmouth. You simply have to fill out a major card and get it signed. Depending on the major it may take longer because you have to figure out all of your classes from the get in go. The D-plan makes this more difficult because classes are not always offered and you have ot figure out how to get it all in. Other than that, the process is exceptionally easy in comparison to other places.",
            "Author": "College Sophomore",
            "Date": "2013-05-05T13:33:27.333Z"
        },
        {
            "Rating": 4,
            "Review": "I am very happy with my program. All of the professors I work with truly care about us and our goals. They help us to not only push ourselves but to be there when we are confused. I feel as if they have done a really good job at helping my goals seem attainable. I plan to teach in the Middle East after graduation and to later work with women's education initiatives in Afghanistan. Though these ideas are a little robust, I have gotten nothing but support and green lights from my program and their confidence gives me confidence.",
            "Author": "College Sophomore",
            "Date": "2013-05-05T13:31:26.617Z"
        },
        {
            "Rating": 4,
            "Review": "Generally i really enjoy all of the departments I am in. The professors are great and work really hard to accommodate our needs. I have found that most professors are willing to sit in their office with you and discuss life and options for life after Dartmouth on any given day. This is quite special. I also think that there is quite a network of alumni to utilize that the department works hard to make accessible to us as students.",
            "Author": "College Sophomore",
            "Date": "2013-05-05T13:22:54.21Z"
        },
        {
            "Rating": 4,
            "Review": "I absolutely love how at Dartmouth you can pursue any academic field you want, in fact you can pursue several at a time! I am majoring in Government which allows me to take courses that focus on comparative politics, international relations, and political theory. I am also minoring in Arabic Language and Literature as well as Human Development and Education. The problem with my areas of study are that it is hard to find internships that pay. I have worked for non profits and had wonderful experiences but was essentially volunteering.",
            "Author": "College Sophomore",
            "Date": "2013-05-05T13:20:57.427Z"
        },
        {
            "Rating": 4,
            "Review": "As a freshman we do not declare until our fifth term. You have some time to decide what you want to study. However, I have become familiar with the Women and Gender studies program. The professors are amazing and the classes are more than interesting. I am going to continue to take courses in this department. Career wise I plan to become involved in social activism maybe through law. My focus would be on the LGBT community. This field is not very accessible and many look at a degree in Women and Gender Studies as nothing, but I hope to change people's outlook on that.",
            "Author": "College Freshman",
            "Date": "2012-12-31T15:23:28.237Z"
        },
        {
            "Rating": 3,
            "Review": "I am in neuroscience, and it is okay, some of the profs are good, other are bad. The classes are challenging, but after so many you get the hang of it.",
            "Author": "College Junior",
            "Date": "2012-12-31T12:02:10.357Z"
        },
        {
            "Rating": 5,
            "Review": "You're at an Ivy League institution. The smallest Ivy, in fact. Personal attention coupled with distinguished, accomplished professors= recipe for academic success.",
            "Author": "College Freshman",
            "Date": "2012-12-31T02:46:40.74Z"
        },
        {
            "Rating": 5,
            "Review": "Professors are experts in their field, and most are very accessible. If you go to office hours or set up appointments, they are more than willing to help you. They genuinely want you to do well.\r\nMost classes aren't that large, and even in large classes, it is easy to get to know the professor if you put in the effort. My lecture class last term was only about 60 students, and my lecture class next term will be around 50. My freshmen writing course last term was 16 students, and my freshmen seminar next term will only be 11 students.",
            "Author": "College Freshman",
            "Date": "2012-12-29T17:16:29.463Z"
        },
        {
            "Rating": 5,
            "Review": "Professors are experts in their field and most are very accessible. They genuinely want you to do well, so if you go to their office hours or set up appointments, they will be more than eager to help.",
            "Author": "College Freshman",
            "Date": "2012-12-29T16:40:31.583Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth is number one in the country for undergraduate teaching.  Professors are passionate about not only their work, but also their students.  Outside the classroom, there is a take-your-professor to lunch program.\r\n\r\nThe workload and curriculum are challenging, but not as difficult as I expected.  Definitely manageable.  Registration is online and very easy.",
            "Author": "College Junior",
            "Date": "2012-11-25T12:01:39.95Z"
        },
        {
            "Rating": 4,
            "Review": "I am a Theater major.  First of all, there are only 6 majors in my department in my year.  While this does lead to a lot of attention for each of us, the department isn't as organized as it could be.\r\n\r\nOne big plus of my major program is that our department pays for us to travel to see plays and musicals.",
            "Author": "College Junior",
            "Date": "2012-11-25T11:55:06.55Z"
        },
        {
            "Rating": 3,
            "Review": "I'm a Socy major and the courses are definitely interesting. Some really explore to the sociological aspects, while others end up being more about the topic and don't really address how it fits into the whole sociological picture. I enjoy the topic very much, but I can't really say that there's anything particularly special about the department here.",
            "Author": "College Senior",
            "Date": "2012-09-17T15:38:21.303Z"
        },
        {
            "Rating": 5,
            "Review": "The Anthropology department is amazing--all the professors are really accessible and know what they're talking about. Classes are interesting, moderate intensity, and you learn a ton. Can't recommend any more.",
            "Author": "College Sophomore",
            "Date": "2012-05-22T15:28:56.633Z"
        },
        {
            "Rating": 5,
            "Review": "Tough and Rigorous – You Might think that taking three courses would be a breeze.  Think again",
            "Author": "College Freshman",
            "Date": "2012-03-05T00:10:30.07Z"
        },
        {
            "Rating": 4,
            "Review": "Academics at Dartmouth are great! There is a class on anything you can imagine and the professors are always available and willing to talk to you during office hours. Professors are also always willing to offer lab work or internships.",
            "Author": "College Sophomore",
            "Date": "2011-12-10T15:52:05.26Z"
        },
        {
            "Rating": 4,
            "Review": "Lots of Homework – Thee is a lot of work but  there is suppot  - free tutoring for athletes or  for anyone on financial aid",
            "Author": "College Freshman",
            "Date": "2011-11-16T11:27:11.803Z"
        },
        {
            "Rating": 4,
            "Review": "The World at Your Fingertips – I plan to declare my major in Biology, with a concentration in Ecology. I have struggled through the typical science major 'weeder' classes such as the introductory Bio 11 and the intro chemistry sequence, but it all gets better from here. With higher-division courses come fascinating subject material such as Vertebrate Zoology, professors who know your name and invite you to assist them with their research, interesting labs, and classmates passionate about the same things you are. Whether you are on a pre-med track or simply have an interest in Ecology, Organismal Biology, or Genetics, Dartmouth's Biological Sciences department has a wide range of academic and research opportunities such as the Foreign Study Program in Costa Rica.",
            "Author": "College Sophomore",
            "Date": "2011-08-15T09:53:05.663Z"
        },
        {
            "Rating": 3,
            "Review": "A Mixed Bag – Some professors can be fairly helpful, but some professors are not very good at teaching.",
            "Author": "College Sophomore",
            "Date": "2011-08-01T01:53:05.207Z"
        },
        {
            "Rating": 4,
            "Review": "Sociology/Romance Studies Double Major – Our language program is world-renowned, and it deserves the credit.  I've yet to be disappointed by either a language class (Spanish and French) or a Sociology class.  Our professors are distinguished in their fields, passionate and available for outside conversations at all times.",
            "Author": "College Junior",
            "Date": "2011-07-29T13:59:42.133Z"
        },
        {
            "Rating": 4,
            "Review": "Undergraduate Teaching – Dartmouth focuses strongly on undergraduate teaching. I always had a professor for all of my courses, and most of the classes were small. Extra help was always available.",
            "Author": "Recent Alumnus",
            "Date": "2011-07-17T00:05:47.633Z"
        },
        {
            "Rating": 4,
            "Review": "Good Resources, Okay Classes. Professors are experts in their field and there are lots of resources. The quality of the classes, however, aren't very consistent across the board: some are great, others are mediocre. As one of the few undergrad institutions with access to fMRI machines, Dartmouth has potential to provide a great education in the Psychological and Brain Sciences.",
            "Author": "College Senior",
            "Date": "2011-06-25T19:54:47.473Z"
        },
        {
            "Rating": 5,
            "Review": "Love It. The D-plan is great.  Students really get the best internships.  The professors are all really friendly and know me personally by name.",
            "Author": "College Junior",
            "Date": "2011-03-10T10:09:36.407Z"
        },
        {
            "Rating": 5,
            "Review": "Great Professors, Smaller Classes – Since Dartmouth College has a pretty small student population, classes are pretty small.  Even lecture classes are smaller than most at other schools.  This allows for more student/professor interaction, so you're really involved in making the most of your own education. The workload is pretty heavy, but shouldn't be unmanageable if you learn good time management skills.",
            "Author": "College Sophomore",
            "Date": "2010-08-07T23:02:03.723Z"
        },
        {
            "Rating": 4,
            "Review": "Difficult but Plenty of Opportunities and Support – Dartmouth has a pretty rigorous biology/pre-med curriculum. There are many potential pre-meds, so there is a lot of competition. The introductory classes are quite difficult and time-consuming. However, most of the professors are very effective and helpful. The labs, facilities, and courses give you a solid foundation in the subject material. There are also tons of opportunities for students to get involved with research on and off-campus. There is also a lot of flexibility in designing your major and picking what classes you want to take.",
            "Author": "College Sophomore",
            "Date": "2010-06-21T10:37:00.61Z"
        },
        {
            "Rating": 4,
            "Review": "Challenging, but Fun – Classes are taught by Profs.  Teaching aids help the Prof, but will rarely teach class.  Teaching aides are much more likely to lead lab and be there for study help.  It's a little annoying that Profs still take attendance, as we're not in high school anymore, but you should go to class anyway.  Especially class discussions: these are the best.",
            "Author": "College Freshman",
            "Date": "2010-03-21T21:06:45.987Z"
        }
    ],
    "Campus": [
        {
            "Rating": 5,
            "Review": "I love the small town college feel with Hanover residents part of the college scene.  I love the way 70 years olds, golden retrievers, and young families with baby strollers all are seen walking the streets of Hanover wearing Dartmouth gear. Love, love love it here!",
            "Author": "College Freshman",
            "Date": "2015-01-15T18:51:01Z"
        },
        {
            "Rating": 3,
            "Review": "Nothing much I can report: it's pretty decent out here in the wild",
            "Author": "College Sophomore",
            "Date": "2015-01-08T21:43:38Z"
        },
        {
            "Rating": 4,
            "Review": "Hanover, New Hampshire is certainly a charming, little cottage town. It's right by the Connecticut River so one can go swimming, canoeing, fishing, whatever when the weather's nice. Occom Pond is also nearby and open for swimming and canoeing as well and in the winter, one could probably go ice-skating there! I'll have to be honest, I'm totally in love with the scenery of New Hampshire, that's why I applied to Dartmouth because it was literally 25 minutes away from home. Among other things, there are plenty of cool museums and cultural attractions around too. There's the Hood Museum, the Hopkins Center, and the Nugget Theater right in town. Across the river in Vermont is the Montshire Museum as well less than a half hour away. Dining and shopping is also possible in Hanover with the numerous local stores and restaurants. I definitely recommend eating at Jewel of India, Bolocos, and Morano Gelato if you ever get the chance. Shopping in Hanover is pretty expensive though (some of my friends literally spent $70 on a knitted Dartmouth sweater), but unless you're really into fancy clothing and whatnot, it's probably better to head over to the shopping centers in West Lebanon. You'll probably have an easier time finding a parking space too haha. If you don't have a car though, you can always take the Advanced Transit and circle around Hanover, Lebanon, and West Lebanon. As for the locals, most of the people I've met and talked to have been pretty friendly. They didn't mind giving directions to a lost college student, although some will (understandably) be peeved if you decide to cross the street in the worst possible place.",
            "Author": "College Freshman",
            "Date": "2014-12-15T14:06:52Z"
        },
        {
            "Rating": 3,
            "Review": "If you're okay being away from popular attractions, diverse options for shopping, and just being away from any major city in general, this is a wonderful place to live. Initially, I thought being away from the city was going a culture shock, but it is actually the best choice I made. I prefer being away from the bustle because it allows to better concentrate on my academics. Plus, I don't have to worry about spending any large amount on nights in town. Although certain necessities like food and hygiene items are overpriced. We have a CVS and two grocers that are both a 15-minute walk away from campus. Also, Hanover's clothing is pricy; befriend a person with a car and go to West Lebanon, the next town over. As far as the town itself, it's cozy and welcoming. And it's pretty safe enough to walk alone in the evenings.",
            "Author": "College Freshman",
            "Date": "2014-11-13T17:18:05Z"
        },
        {
            "Rating": 4,
            "Review": "Its in the middle of the mountains of New Hampshire and Vermont which depending on the person is either a plus or a minus. I love all of the outdoor activities like skiing, hiking, and rock climbing that we have access to and it is a beautiful place during every season. There is little to offer for nightlife (besides frats), shopping, museums, or things that you might find in a city. There are still some really cool things to do though if you have a car. Burlington, the Ben and Jerry's factory, a drive in theater, local farmers markets and fairs, swimming holes, roller skating rinks and other local activities are all popular. Montreal is only a couple hours away. Also, Dartmouth runs busses to Boston and New York several times a day so cities are still accessible.",
            "Author": "College Sophomore",
            "Date": "2014-09-09T15:34:49Z"
        },
        {
            "Rating": 5,
            "Review": "Amazing campus facilities, very nice, clean, and well-maintained! Strong campus traditions and fun events!",
            "Author": "College Sophomore",
            "Date": "2014-09-08T19:36:30Z"
        },
        {
            "Rating": 5,
            "Review": "Absolutely amazing scenery! Mountains, river, open green spaces, forests, stars everywhere, and beautiful leaf colors in the fall!!",
            "Author": "College Sophomore",
            "Date": "2014-09-08T19:24:50Z"
        },
        {
            "Rating": 4,
            "Review": "Overall, the campus is amazing...the buildings are mostly modern inside (with the exception of a few dorms and random buildings).",
            "Author": "College Sophomore",
            "Date": "2014-08-04T15:27:33Z"
        },
        {
            "Rating": 4,
            "Review": "Hanover is a very welcoming community. It feels safe and the nature is beautiful.",
            "Author": "College Sophomore",
            "Date": "2014-07-23T17:39:13Z"
        },
        {
            "Rating": 4,
            "Review": "The computer science majors have their own building with their own labs, and the engineers do too. We have a media center with unlimited access to any kind of digital tech (computers, microphones, cameras, etc) and a computer area in the library. I have never needed a computer and not been able to find one. That being said, it's absolutely necessary to bring your own for convenience's sake. Everyone has their own, and it makes life a lot easier.",
            "Author": "College Sophomore",
            "Date": "2014-06-09T18:12:18Z"
        },
        {
            "Rating": 3,
            "Review": "It's a quaint New England Town with many greats restaurants and shops. There are all the basic amenities that you would want, but it is certainly not a town for college students looking to go to bars and nightclubs (there are none!). That being said, the people are nice and friendly, and the surrounding area is gorgeous with many outoorsy things to do and lots of people taking advantage of it. It's near two big highways, so travel to other places is possible, and there is a free bus system that runs to the neighboring five towns that runs Mon-Fri.",
            "Author": "College Sophomore",
            "Date": "2014-06-09T17:56:11Z"
        },
        {
            "Rating": 5,
            "Review": "Getting to school after breaks is painless with the Dartmouth Coach.",
            "Author": "College Junior",
            "Date": "2014-05-20T20:27:58Z"
        },
        {
            "Rating": 3,
            "Review": "Small bar scene for 21+.  Otherwise there's a movie theater, pub trivia, and more options in surrounding towns.",
            "Author": "College Junior",
            "Date": "2014-05-20T20:26:09Z"
        },
        {
            "Rating": 4,
            "Review": "Tech support is phenomenal and there are computers all over campus if you ever need one that's not your own (though you should definitely purchase one). Wifi has gotten worse since I got here but they're apparently doing something about it.",
            "Author": "College Junior",
            "Date": "2014-05-20T20:25:16Z"
        },
        {
            "Rating": 4,
            "Review": "Bad in the winter but the glorious spring/summer can't be beat and going to the farmers market on the green in fall feels perfectly \"college\"",
            "Author": "College Junior",
            "Date": "2014-05-20T20:07:32Z"
        },
        {
            "Rating": 1,
            "Review": "Very cold winters--often well below 0.  Just get a solid NorthFace or equivalent and boots and you'll be fine.",
            "Author": "Recent Alumnus",
            "Date": "2014-05-15T22:12:03Z"
        },
        {
            "Rating": 1,
            "Review": "If you don't have a car, or money for zipcar, you are out of luck",
            "Author": "Recent Alumnus",
            "Date": "2014-05-15T21:04:00Z"
        },
        {
            "Rating": 1,
            "Review": "Winter sucks.  Imagine coming from sunny California and BAM! Put into blankets of snow and ice with sub zero degree temperatures.  Sometimes in the winter I don't even go to class because I get way too cold.",
            "Author": "College Freshman",
            "Date": "2014-04-07T23:22:44Z"
        },
        {
            "Rating": 3,
            "Review": "The tech support is fine.  My main complaint is the wireless network.  It sucks.  Sometimes it takes what seems to be days to load a single page.",
            "Author": "College Freshman",
            "Date": "2014-04-07T23:19:48Z"
        },
        {
            "Rating": 2,
            "Review": "The social scene is basically just drinking.  Frats run the social scene here at Dartmouth. Because freshmen do not have cars, it is very difficult to go off campus.",
            "Author": "College Freshman",
            "Date": "2014-04-07T23:08:15Z"
        },
        {
            "Rating": 3,
            "Review": "small community that breeds inclusion",
            "Author": "College Junior",
            "Date": "2014-03-14T18:19:15Z"
        },
        {
            "Rating": 3,
            "Review": "Most student just walk. There's no real need for public transportation on campus because you can get from one end of the school to the other in a 10-minute walk. If you're going off campus, there is a shuttle but it's not very reliable and comes infrequently.",
            "Author": "Recent Alumnus",
            "Date": "2013-12-27T10:58:08Z"
        },
        {
            "Rating": 5,
            "Review": "The school's facilities and aesthetics are truly top-notch in my opinion. We have a great athletic center and numerous libraries on campus; a big Green space in the middle of campus that students utilize daily. It's great to sit out in the Sun during the warm months and have snowball fights during the winter. And there are little student center spaces and rooms throughout campus where students can study, watch tv, do work, or just hang out.",
            "Author": "Recent Alumnus",
            "Date": "2013-12-27T10:36:41Z"
        },
        {
            "Rating": 5,
            "Review": "The facilities were great! I loved my dorm, especially Junior and Senior years, and the school always maintained a professionalism in the way it looked. The academics were great, and there are many programs that the campus offers to study abroad, or to travel overseas/within the US to do community service work.",
            "Author": "Recent Alumnus",
            "Date": "2013-12-27T10:36:41Z"
        },
        {
            "Rating": 4,
            "Review": "There isn't much to do in the town unless it is a campus-sponsored event. It is surrounded by beautiful scenery which provides many opportunities for hiking, skiing, running, and rowing, and the school offers numerous cultural events. But in terms of shopping/big attractions, there isn't much.",
            "Author": "Recent Alumnus",
            "Date": "2013-12-27T10:31:01Z"
        },
        {
            "Rating": 4,
            "Review": "school pays for zipcar membership\r\nno need for car\r\ni dont even need a bike",
            "Author": "College Senior",
            "Date": "2013-12-06T16:29:45Z"
        },
        {
            "Rating": 4,
            "Review": "typical new england weather. expect very cold winters with lots of snow, beautiful vibrant fall seasons, and perfect springs",
            "Author": "College Senior",
            "Date": "2013-12-06T16:25:10Z"
        },
        {
            "Rating": 2,
            "Review": "I dont have a car on campus. A bike will suffice for people who live far away, but I get by fine without a bike.\r\nKids who do have cars park at their greek houses or in a removed parking lot\r\nTown traffic patrollers are strict about ticketing",
            "Author": "College Senior",
            "Date": "2013-12-06T16:24:33Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth has high end technology and prides itself on being very technologically integrated\r\nAll classes websites' are integrated on education software systems (Blackboard, Banner, Piazza)\r\nPrinting is only an issue once in a while",
            "Author": "College Senior",
            "Date": "2013-12-06T16:17:57Z"
        },
        {
            "Rating": 5,
            "Review": "The campus is a typical small college town in New England. The library is the focal point of campus, with many great study spaces and an excellent rare books library that has unparalleled access for students. Dorms are mostly great, and frats are......frats. We also have the most land of any college in America, so if you want a cheap outdoors vacation, check out the stunning Grants or the Lodge.",
            "Author": "College Freshman",
            "Date": "2013-11-26T23:37:30Z"
        },
        {
            "Rating": 5,
            "Review": "Well, we are known for the frats, but in addition we have a huge variety of organisations, including the amazing Dartmouth Outing Club! If you want to do something, we have it, and it is either the best or the first or the largest or the only in the country.",
            "Author": "College Freshman",
            "Date": "2013-11-26T23:37:30Z"
        },
        {
            "Rating": 4,
            "Review": "Hanover is very remote, but it has really been built up alongside the College.  There are a few good off-campus dining options, and the town is beautiful in the fall.  The town is actually pretty active for such a small community, and there is frequent transport to New York City and Boston for students who grow tired of the activities in Hanover.",
            "Author": "College Freshman",
            "Date": "2013-11-25T20:12:29Z"
        },
        {
            "Rating": 4,
            "Review": "Students are very friendly, and campus is very social.  Most social events, though, do revolve around the frat and drinking scene on campus.  There are various other activities in which to partake if that isn't your scene, but they might be somewhat pathetic and little-trafficked.",
            "Author": "College Freshman",
            "Date": "2013-11-25T20:04:30Z"
        },
        {
            "Rating": 4,
            "Review": "The facilities are great.  I don't use the gym too much, but the classrooms, dining halls, and other features of the school are well-maintained",
            "Author": "College Freshman",
            "Date": "2013-11-25T20:04:30Z"
        },
        {
            "Rating": 3,
            "Review": "I don't have a car on campus, but the parking is pretty competitive from what I understand.",
            "Author": "College Freshman",
            "Date": "2013-11-25T20:01:19Z"
        },
        {
            "Rating": 4,
            "Review": "Hanover, New Hampshire is definitely an ideal college town, with clothing stores, coffee shops, book stores all located in one concise location. Moreover, everyone is so nice! Even people who you have never met before will go out of their way to open a door for you, or ask you about how you are doing. Definitely a great town, albeit a little pricey.",
            "Author": "College Freshman",
            "Date": "2013-09-22T11:55:00.343Z"
        },
        {
            "Rating": 3,
            "Review": "There is plenty of transportation services to shuttle you to places you need to go, like the shopping district in West Lebanon. However, information about the transportation (pick-up location, times, etc.) is hard to find.",
            "Author": "College Freshman",
            "Date": "2013-09-22T11:52:35.807Z"
        },
        {
            "Rating": 5,
            "Review": "Great athletic centers, Baker library is awesome, and our campus traditions are unmatched",
            "Author": "College Freshman",
            "Date": "2013-08-18T10:25:48.483Z"
        },
        {
            "Rating": 2,
            "Review": "Honestly, Hanover is not that exciting. We have a J. Crew... There are plenty of delicious places to eat at, but as far as a bar scene goes... it's not too exciting from what I have heard. In fact, I've heard that if you go to bars often enough, you get to know all of the bartenders...",
            "Author": "College Junior",
            "Date": "2013-06-13T01:06:50.827Z"
        },
        {
            "Rating": 4,
            "Review": "I find all of the seasons at Dartmouth to be a beautiful sight. Fall has that crisp chill and the leaves are falling slowly. Winter is beautiful because everything is like a white blanket and there is that dry cold feeling. Spring is really wet, but a wonderful experience because when everything starts to bloom, everything smells like flowers. Flower petals fall and everything is green and coming to life. I have yet to experience summer, but I heard it is HOT!",
            "Author": "College Junior",
            "Date": "2013-06-13T01:05:07.29Z"
        },
        {
            "Rating": 2,
            "Review": "It's NH, and it gets cold in the winter. Being from the south though, I can say its not TOO bad. Besides, below 5 F its all the same right?",
            "Author": "College Junior",
            "Date": "2013-06-10T15:24:20.583Z"
        },
        {
            "Rating": 4,
            "Review": "The opportunities that are offered at Dartmouth are awesome. As a student, even as a community member, Dartmouth brings many different programs to you. You have the ability to see some big name performers such as Yo Yo Ma and Ke$ha, while still being exposed to more homey experiences such as the farmer's market. With the diversity on campus, you also have the opportunity to experience other cultures such as seeing the lighting of candles for Diwali or Pow-wow in the spring.",
            "Author": "College Junior",
            "Date": "2013-05-15T06:29:36.74Z"
        },
        {
            "Rating": 3,
            "Review": "The lots for students are pretty far away, about a 15-20 minute walk from main campus. This isn't bad in the summer/early fall, but in the winter and most of spring it is FREEZING. \r\n\r\nParking is also available through the greek houses, but is generally very, very expensive.",
            "Author": "Recent Alumnus",
            "Date": "2013-04-04T12:25:44.563Z"
        },
        {
            "Rating": 4,
            "Review": "There are computers all throughout campus, that are usually in working order. The only time they will not be functioning is if GreenPrint is undergoing some work. Dartmouth Secure, Public, and Library Public run great. Again, if there is a usually a problem it will be campus wide and resolved promptly. With that said, there is a great need for personal computers, they will be needed for everything.",
            "Author": "College Sophomore",
            "Date": "2013-01-02T14:49:39.967Z"
        },
        {
            "Rating": 3,
            "Review": "The weather varies much like the seasons. Fall is beautiful, can be somewhat chilly but usually fair weather. Winters can be rough, so be prepared. Temperatures tend to change drastically throughout the day. Spring is fairly rainy in the beginning, but the weather improves toward the end. Summer is hot and humid for the most part. Overall, a wide array of weather and temperatures.",
            "Author": "College Sophomore",
            "Date": "2013-01-02T14:45:29.377Z"
        },
        {
            "Rating": 5,
            "Review": "It's definitely a really pretty campus with a lot of amenities. There are incredible libraries with so many resources. All old buildings are entirely renovated or will get renovated soon; the Life Sciences Center is absolutely amazing.",
            "Author": "College Freshman",
            "Date": "2012-12-31T02:34:27.203Z"
        },
        {
            "Rating": 5,
            "Review": "The student center (Collis) has one of the main dining establishments on campus, hosts entertainment (comedians, magicians, student performance groups), has a convenience store, a TV lounge, and study rooms. It's being renovated this winter (2013) and will have even more hangout spaces and a bigger space for dining. \r\n\r\nOur libraries have an endless amount of resources and the librarians are more than eager to help students. There are different library atmospheres for everyone's varying preferences. We have very old, traditional-looking libraries to modern ones, spaces that are social to completely silent, small study rooms to huge rooms with rows of long tables to cubicles.\r\n\r\nOur athletic center is beautiful and has every type of machine and equipment. There are tons of fun P.E. classes that take advantage of the beautiful surroundings, like skiing, whitewater kayaking, and horseback riding.",
            "Author": "College Freshman",
            "Date": "2012-12-29T17:40:22.99Z"
        },
        {
            "Rating": 2,
            "Review": "Parking is an interesting question considering barely any students have cars on campus. The best option is to park in on of the frats lots when they message campus about open spots. It is reasonably priced and in the center of campus. But you have to keep in mind that with your car at a frat you run the risk of a drunk freshman running into your car of even throwing up on it. Or you can pay more to park in the student lot which is quite far away from campus. If you don't plan on using your car often and just want to have it available if you need it someday than it isn't a bad option.",
            "Author": "College Sophomore",
            "Date": "2012-12-28T15:40:28.96Z"
        },
        {
            "Rating": 2,
            "Review": "really cold and dreary mostly; sunny days=gorgeous",
            "Author": "College Junior",
            "Date": "2012-12-19T22:01:25.257Z"
        },
        {
            "Rating": 4,
            "Review": "Dartmouth requires all students to have a laptop coming in freshman year, but they also have some public desktop computers at the library.  The printing system, while it sometimes has a few glitches, makes it easy to print to any location on campus there is a printer; there is no real need to bring a personal printer.  There is campus-wide wi-fi, which sometimes takes a while to connect to but makes internet access anywhere pretty convenient.  The public network is a little slow, but the secure network for students and staff is fast enough for most anything.",
            "Author": "College Freshman",
            "Date": "2012-11-30T11:52:01.327Z"
        },
        {
            "Rating": 4,
            "Review": "Public transportation around the Hanover area is much better than expected.  There are several free busses (the Advance Transit) that go between campus and various sites in Hanover and the nearby towns.  Buses are a little slow, but come frequently and make a lot of stops.  For long-distance, there are reasonably-priced coach buses (with free snacks and wi-fi) to Boston and New York City.",
            "Author": "College Freshman",
            "Date": "2012-11-30T11:49:08.26Z"
        },
        {
            "Rating": 4,
            "Review": "There is a lot of snow in the winter and a lot of rain most of the year - but you should expect that living in New England.  The weather is really central to campus life - midnight snowball fights after the first snow, and everyone flocking outside the first day of spring when it's still only 45 degrees.\r\n\r\nSpring and fall are perfectly lovely.  Summer is humid, but again, as to be expected.\r\n\r\nJust buy a good pair of rain/snow boots - and you're set!",
            "Author": "College Junior",
            "Date": "2012-11-25T11:50:53.377Z"
        },
        {
            "Rating": 3,
            "Review": "There is a bus line that will take you anywhere around the Upper Valley for free.  However, the only other public option is the Dartmouth Coach, which is 60 round trip to Boston multiple times a day or about 100 roundtrip to NYC a couple times a week.",
            "Author": "Recent Alumnus",
            "Date": "2012-11-08T15:16:20.087Z"
        },
        {
            "Rating": 3,
            "Review": "It rains a lot, and in the winter that means it snows a lot, or sometimes it still rains. The summer is gorgeous, and the spring is nice too, but not a place for people who like sun.",
            "Author": "College Junior",
            "Date": "2012-10-20T12:00:26.267Z"
        },
        {
            "Rating": 5,
            "Review": "If you need one, which you probably won't because all undergraduates are required to have a laptop they're available, always.",
            "Author": "College Senior",
            "Date": "2012-09-17T16:00:20.523Z"
        },
        {
            "Rating": 3,
            "Review": "Club Sports – I'm the VP of club field hockey, the newest club sport here and still a small program. Some of the club sports teams are treated really well, like varsity teams almost, including Rugby and Club Soccer. But those that don't have as much participation or such a great record are not treated that well, making it hard for them to expand and become successful.",
            "Author": "College Junior",
            "Date": "2012-08-15T12:17:01.66Z"
        },
        {
            "Rating": 3,
            "Review": "Greek System – I love my sorority, and I do like going to the frats because I have friends there and I'm not the kind of girl that wants to dress up every night, let alone spend a lot of money on going-out clothes and drinks. However, I think it can be a little oppressive since its the only real social setting, and its a smaller group that participates so you feel like you know everyone and everyone knows everything about everyone. Its also highly male-centric since frats mostly host parties (only a couple local sororities are allowed to hold parties in their houses, since the national ones won't allow it).",
            "Author": "College Junior",
            "Date": "2012-08-15T12:14:49.347Z"
        },
        {
            "Rating": 4,
            "Review": "Oh It's Fine – I have no problem with the Dartmouth weather. Sure, it's not sunny all the time but that's what you should expect if you go to school in New Hampshire. Personally, as someone from Minnesota, I love the weather. The snow makes it look beautiful. And it's warm but not excessively hot other times of the year. Bring a coat and some gloves, but students are also pretty good at finding \"warm-cuts\" through the library to get from place to place.",
            "Author": "College Sophomore",
            "Date": "2012-08-01T16:37:00.97Z"
        },
        {
            "Rating": 3,
            "Review": "parking isn't really an issue… You can usually find spots on any of the streets,  at the fraternity houses, or the parking garage in town. It isn't that hard… But it isn't like it's something that makes the school great. Also, freshmen are not allowed to bring cars to school.",
            "Author": "College Sophomore",
            "Date": "2012-07-29T11:03:34.35Z"
        },
        {
            "Rating": 5,
            "Review": "Parkinf only costs $45 a term. The only downside is that the lot of kind of far from campus, maybe a mile walk. But still, you dont really need your car on campus anyway.",
            "Author": "College Sophomore",
            "Date": "2012-07-11T09:44:49.78Z"
        },
        {
            "Rating": 4,
            "Review": "Cute Small Town – Hanover is one of the safest towns in one of the safest states.  There is almost no threat for crime and the dining off campus is pretty good.  Hanover does not offer much in terms of night life, but offers all the necessities to facilitate your on-campus life.",
            "Author": "College Freshman",
            "Date": "2012-03-05T00:09:54.113Z"
        },
        {
            "Rating": 4,
            "Review": "I love it! Dartmouth weather is AMAZING! I'm from Texas and have never experienced a real winter. I have had so much fun sledding on the golf course, ice skating on the pond, and having snow ball fights on the green. A large, warm coat is definitely necessary. The other seasons are beautiful here too. It does rain quite a bit though. Grab an umbrella and some rain boots and you'll be fine.",
            "Author": "College Freshman",
            "Date": "2012-02-05T15:01:37.737Z"
        },
        {
            "Rating": 3,
            "Review": "Kinda Sucks – The student parking lot, A-Lot, is really inconvenient. It is nice to have a car though. Hanover is small, and I enjoy going to restaurants in different towns.",
            "Author": "College Freshman",
            "Date": "2012-02-05T14:50:15.167Z"
        },
        {
            "Rating": 5,
            "Review": "Love the outdoors, to snowboard, fish, swim, hangout.  All the seasons make it awesome.",
            "Author": "College Freshman",
            "Date": "2012-02-05T12:02:18.227Z"
        },
        {
            "Rating": 2,
            "Review": "There really isn't much parking for visitors besides parking meters.",
            "Author": "College Freshman",
            "Date": "2012-01-21T17:54:17.063Z"
        },
        {
            "Rating": 4,
            "Review": "Cozy, Welcoming Environment – Hanover is a small town, nestled within the trees of New Hampshire. Since its location is quite rural, it leaves students of Dartmouth College with a very home-like and comfortable environment. It seems as though everyone knows everyone. The sense of community is definitely a plus to the Big Green.",
            "Author": "College Freshman",
            "Date": "2011-12-28T11:49:09.31Z"
        },
        {
            "Rating": 2,
            "Review": "Not Much to Do Outside of Campus – Although there is not much to do off campus, the programs and activities that are available are fun and interesting. If you ever get so bored on campus, it is very easy to get to Boston or another bigger city, but it is expensive.",
            "Author": "College Sophomore",
            "Date": "2011-12-10T15:54:59.283Z"
        },
        {
            "Rating": 3,
            "Review": "Decent Computing – Since the school requires computer ownership, accessibility for lab computers isn't a top priority, but there are plenty of computers to use all over campus. The wireless network functions decently, but it won't work in some places. Most people prefer to connect through ethernet because it's a definite improvement. Printing can be a total pain; the GreenPrint system is temperamental at best. Computing Services is helpful, but be prepared to wait in an extremely long line for assistance. Otherwise, I don't have too many complaints.",
            "Author": "College Freshman",
            "Date": "2011-12-02T22:15:38.623Z"
        },
        {
            "Rating": 4,
            "Review": "Good Pick up System at Night – Good if you are caught at night and  not feelign well or  want a ride -  just call!\r\nFree buses in town",
            "Author": "College Freshman",
            "Date": "2011-11-16T11:32:17.043Z"
        },
        {
            "Rating": 2,
            "Review": "mostly apple computers for use, but tech support focuses on microsoft. quite inconsistent.",
            "Author": "College Sophomore",
            "Date": "2011-10-14T08:08:45.523Z"
        },
        {
            "Rating": 3,
            "Review": "The Bubble on the Hill – \"The college on the hill\" is located in Hanover, New Hampshire, a town that basically consists of Dartmouth College plus a main street. Despite its size, students find that Hanover offers a surprising variety of charming local restaurants, a farmer's market in the spring, free weekday shuttles to neighboring towns like West Lebanon, and some of the best gelato in the country. There is no nightlife, but Dartmouth's Greek scene more than makes up for it, and Boston and NYC are Dartmouth Coach bus rides away.",
            "Author": "College Sophomore",
            "Date": "2011-08-15T09:37:13.853Z"
        },
        {
            "Rating": 1,
            "Review": "On Campus – Living on campus is basically the only option.  There's literally nothing else in the surrounding area, and the public transportation system is limited at best.  Basically, useless.",
            "Author": "College Junior",
            "Date": "2011-07-29T14:03:21.977Z"
        },
        {
            "Rating": 4,
            "Review": "Campus wide wireless is convenient and generally very reliable.  Students are required to have their own laptops, and financial aid can help with the cost. Computer services are decent. Desktop computers are available throughout campus for those who don't have their computers handy or working.",
            "Author": "College Freshman",
            "Date": "2011-05-25T21:41:53.283Z"
        },
        {
            "Rating": 3,
            "Review": "Tradition sums up Dartmouth.  A lot of students joke that the old school alums refuse to let the school move past its ultraconservative, all-boys, animal house reputation.   I have had multiple friends visit Dartmouth, and they all look around bewildered at pretty much everything that goes on here.  Greek life is DOMINANT (about 70% of soph-seniors are in it... its a huge, huge deal), boys rule the school (literally and figuratively), there is a clear tension with gender and sexual assault issues (no matter whose \"side\" youre on), and there is a lot more binge drinking than one would expect at an ivy league.  The administration caters almost exclusively to alumni input, and there is a strooong disconnect between the students and the administration.  There are some awesome traditions, including DOC trips, orientation activities, green key, the homecoming bonfire, etc.  But traditions of the social life and \"power structure\" here are unlike anything I have heard of elsewhere.  It is very intense and it caters to the whims of white, affiliated, male athletes.  That is awesome and fun for some people and miserable for others.  Its just a preference thing.",
            "Author": "College Sophomore",
            "Date": "2011-05-13T19:44:32.267Z"
        },
        {
            "Rating": 2,
            "Review": "Awful, With a Few Golden Days Thrown in – Do NOT be fooled by your tour day.  Most Dartmouth students are fairly convinced that admissions schedules the majority of tours for days they know will be beautiful.  The weather is crummy for the most of the time.  -30 days in the winter, lots of cloudy days, overall cold weather.  that said, there are some absolutely beautiful days in the late spring and early fall terms.  But for the most time, it is fairly miserable.  A lot of kids have \"happy lamps\" to make up for the lack of sunshine.",
            "Author": "College Sophomore",
            "Date": "2011-05-13T19:38:18.327Z"
        },
        {
            "Rating": 3,
            "Review": "Depends on Where You're from – I come from a much milder climate, so it's a bit of an adjustment, especially during the wintertime.  Typical New England: long, cold winters, humid summers.  Late spring and early fall are both gorgeous.  The campus does not have very good drainage, though, so rain and snowmelt make the whole place flood.",
            "Author": "College Sophomore",
            "Date": "2011-05-02T20:40:14.073Z"
        },
        {
            "Rating": 3,
            "Review": "It Can Be Done – A car is a really handy thing to have, as the public transit in the area leaves something to be desired-and Hanover can be sort of an isolating place.  The parking lots are not particularly convenient, though Greek houses have spaces available both for members and renting to non-members.",
            "Author": "College Sophomore",
            "Date": "2011-05-02T20:37:54.61Z"
        },
        {
            "Rating": 4,
            "Review": "Can't Complain – The facilities are not quite as nice as some colleges, but everything is either in good shape or being renovated. The College has put lots of money into renovation projects, especially the dining hall that's supposed to be completed by Fall 2011.  We have a very expansive gym, a well-stocked library, and plenty of recreational buildings and spaces.",
            "Author": "College Sophomore",
            "Date": "2011-05-02T20:34:53.297Z"
        },
        {
            "Rating": 5,
            "Review": "The D-Plan! The D-plan helped me get an awesome internship in NYC my Junior year.  Also, sophomore summer was the best summer of my life.",
            "Author": "College Junior",
            "Date": "2011-03-10T10:25:20.25Z"
        },
        {
            "Rating": 4,
            "Review": "We have a lot of computers in the library and a lot of printing stations.",
            "Author": "College Junior",
            "Date": "2011-03-10T10:22:36.093Z"
        },
        {
            "Rating": 3,
            "Review": "Small Campus – Small campus so no need to have a car to get around. Not too many things to do off campus anyway except maybe go to west leb and go to walmart. The advance transit will take you to west leb though so again a car is not necessary. Parking is limited anyway.",
            "Author": "College Sophomore",
            "Date": "2011-01-24T16:48:42.65Z"
        },
        {
            "Rating": 4,
            "Review": "Does Not Seem 300 Years Old – The Fitness Center is newly renovated and easily accessible to all of campus.  All of the athletic facilities are central to student life.  Baker-Berry Library is always clean and comfortable, as well as modern-looking, conducive to all study types.  Walking outside, the campus looks just as it did when Robert Frost and Dr. Seuss made their way to classes, but the administration is always remodeling and updating the facilities, making all students feel at home in a cutting-edge institution.",
            "Author": "College Freshman",
            "Date": "2011-01-24T15:35:23.297Z"
        },
        {
            "Rating": 4,
            "Review": "Not an Issue – Yes, it's cold, but it doesn't bother me, and I'm from Georgia. There is a lot of snow, but the roads and sidewalks are always clear, and there are a lot of outdoor activities that make the cold bearable (like skiing, ice skating, snowball fights, etc.)",
            "Author": "College Freshman",
            "Date": "2011-01-11T17:47:51.523Z"
        },
        {
            "Rating": 4,
            "Review": "When you want transportation, it's there (a shuttle around campus and to a neighboring shopping center), but the campus is so small that everything you need is generally within a 20 minute walk. The transportation the the airport, a bus, seems expensive but is convenient.",
            "Author": "College Freshman",
            "Date": "2011-01-11T17:45:42.297Z"
        },
        {
            "Rating": 4,
            "Review": "The list of things that make Dartmouth different from other colleges is endless but two things are very important to Dartmouth life - they're part of the reason I chose to go here and why a Dartmouth college experience is so unique. First on the academic side is our infamous D-Plan. We're not like other schools with two semesters a year.  Instead, we have terms/quarters - the summer can count as a term (of course you don't have to stay there during summer but its easy to do so).  This means our terms are shorter and move by quicker BUT that allows for one of Dartmouth's main selling point - studying abroad/the D-Plan.  When I say we have TONS of programs, I'm not exaggerating.  If you're like me and don't like studying or speaking languages it doesn't matter - Dartmouth specifically has abroad programs to go along with our majors. They're taught by Dartmouth professors and you go with a bunch of other students interested in the same thing.  I don't know of any other college that gives you the opportunity to study on a quarter system and go abroad so often. Secondly there's our social scene, and by that I mean the main fun on Friday & Saturday nights.  Actually, on our campus the typical nights to go out are Monday, Wednesday, Friday and Saturday (most people don't have class Tues or Thurs).  Our social scene is entirely based on the frat scene which works out perfectly.  I've never been turned away from a frat, and no I don't have the hookup that's just how Dartmouth is, and I've never paid for a drink or a concert.  It's that open and friendly.",
            "Author": "College Sophomore",
            "Date": "2010-12-25T02:46:43.407Z"
        },
        {
            "Rating": 3,
            "Review": "Don't Bother. Everything you need is within walking distance.  And if you really want to go to nearby malls, ask a friend.  They'll have a car.",
            "Author": "College Junior",
            "Date": "2010-10-08T17:01:50.827Z"
        },
        {
            "Rating": 1,
            "Review": "Cute but Boring – The town seems adorable at first, but you can exhaust everything there is to do in less than three terms. The town likes the students and we make up a lot of the town, but once you've eaten everywhere and gone in every store, you're out of things to do.  There aren't really and franchise stores either so you're really going to miss McDonalds and Target.  There's a town nearby but it's not convenient to get to. You might get bored.",
            "Author": "College Sophomore",
            "Date": "2010-08-31T15:04:45.197Z"
        },
        {
            "Rating": 1,
            "Review": "Bus, What? The busses are never on time, things are very far away and the weather is brutal. Best bet is to have a bicycle or to take everythign you need wherever you're going.",
            "Author": "Recent Alumnus",
            "Date": "2010-08-14T20:00:35.867Z"
        },
        {
            "Rating": 5,
            "Review": "Freshmen Trips = AWESOME – When the freshmen first arrive on campus, almost ever single one participates in a freshman trip.  These include backpacking, hiking, biking, kayaking, cabin camping, organic farming, nature photography, rock climbing, and many other types of trips.  This was a great way to meet people before starting classes and trips were pretty small, so you really create a sense of family with your trip mates and trip leaders. The people I met on my trip are still my best friends on campus.  Also, the energy that comes from the upperclassmen when you first arrive on campus is outstanding; instead of hazing or the stereotypical hostility directed at freshmen, freshmen are greeted by excitement from all the other students for them to join the Dartmouth community.",
            "Author": "College Sophomore",
            "Date": "2010-08-07T23:13:55.6Z"
        },
        {
            "Rating": 5,
            "Review": "Bring Your Own Computer, Don't Need a Printer – Having computer access on campus is extremely important and I would advise all incoming students to bring their own personal computer.  There are several computers on campus available if you do not have your own, but having a lap top makes life much more convenient (taking notes in class, being able to work other places besides the library, always having a computer available, etc.)  If you're experiencing trouble with your computer, you can take it to computer services where they are extremely helpful and friendly.  A printer, however, is not necessary.  There are several accessible printing stations all around campus, so you can print nearly anywhere at anytime (like on the way to class after grabbing breakfast in one of the dining halls).  The school even provides you with a printing account, so I would say owning your own printer is pretty unnecessary.  Finally, wireless access on campus is fantastic.  As with any network, it occasionally experiences a few glitches, but the problem never lasts long.",
            "Author": "College Sophomore",
            "Date": "2010-08-07T22:57:14.427Z"
        },
        {
            "Rating": 1,
            "Review": "Gyms Are Terrible – athletics facilities are old and are in dire need of rennovation",
            "Author": "College Sophomore",
            "Date": "2010-08-06T00:34:33.607Z"
        },
        {
            "Rating": 4,
            "Review": "Gorgeous Autumns, Winter Wonderland – Dartmouth definitely gets all four seasons, but the two definitive ones are definitely the Fall and the Winter. There is nothing like experiencing the changing leaves during a New England Fall. This is the only time of year where tourist buses frequently pass through campus. Winter is the season that students bring up the most. For those who are not used to the snow and sub-zero temperatures, it is definitely difficult to survive. The school, as well as various student organizations, organize trips to outlet malls for students who need to buy more winter clothing. Most students would say that Winter is extremely cold and miserable. However, being a snow enthusiast, I loved every bit of it. You will never see such pristine, beautiful snow in a city. Since there is so little traffic in Hanover, snowstorms will blanket the campus and it will stay white for a long time. The best part of winter is the annual midnight snowball fight on the Green after the first snowstorm each year. Winter Carnival is also tons of fun. I definitely recommend participating in the building of the humongous snow sculpture each year.",
            "Author": "Recent Alumnus",
            "Date": "2010-07-22T10:47:08.853Z"
        },
        {
            "Rating": 4,
            "Review": "D-Plan Allows for Flexibility and Creativity – Dartmouth's D-Plan makes it unique from other schools. We have a quarter system of about 10 weeks each and students can design their residence plan according to when they want to be on campus taking classes or when they want to be off for a study abroad program or doing something else like internships or volunteer work. The big drawback is that each term become very fast-paced and intense. However, the D-plan also gives you a lot of flexibility in making your own college experience. You can get quite creative with what you make of your off-terms!",
            "Author": "College Sophomore",
            "Date": "2010-06-21T11:28:53.28Z"
        },
        {
            "Rating": 4,
            "Review": "You can find wireless availability almost anywhere on campus, so most people carry their laptops around with them. However, the libraries do have several computers if you need to use them. Still, it is handier to bring your own computer, especially if the library is crowded. There are printing stations at several places on campus, including many dorms, so having your own printer can help but is not completely necessary.",
            "Author": "College Sophomore",
            "Date": "2010-06-21T11:25:16.573Z"
        },
        {
            "Rating": 3,
            "Review": "In the Middle of Nowhere – Dartmouth is located in Hanover, NH. This is a rural town about 1.5 hour from Manchester and 3 hours from Boston. There really isn't much in the town except for the campus. So, most of the activity takes place in the college itself.",
            "Author": "College Sophomore",
            "Date": "2010-06-21T11:22:10.73Z"
        },
        {
            "Rating": 3,
            "Review": "Free Advance Transit Buses – The free advance transit buses are the most convenient option of getting to nearby smaller places. There is Dartmouth Coach to go to Boston and New York but its quite costly.",
            "Author": "College Junior",
            "Date": "2010-04-25T14:24:30.147Z"
        },
        {
            "Rating": 3,
            "Review": "Winter Is Awful, but Everything Else Is Great – Autumn here is gorgeous, but it quickly transitions into an unforgivingly frigid winter that spans from October to April. It snows until it is too cold to snow, then things are just miserable because the temperature is in the negatives and everything outside is drab. Only the die-hard winter sports people like to stay on campus during winter term. Spring is slow coming and very often cloudy and rainy. For every three cold, overcast days we'll have one warm, sunny day. Summer gets somewhat hot- hot enough for swimming anyway. It still rains a lot during the summer, though, so it can get pretty muggy. Back to autumn and the breathtaking burst of colors that blushes the surrounding deciduous forests. I've never seen leaves like this.",
            "Author": "College Freshman",
            "Date": "2010-04-25T14:18:39.977Z"
        },
        {
            "Rating": 5,
            "Review": "Gorgeous Campus – The college spends a lot of time and money ensuring that the grounds and the buildings are kept in top condition. \r\nThe athletic center is top of the line and open for extended hours during the school week that make it easier for busy students to work in their work outs.\r\nThe student center (Collis) is always buzzing with some interesting activity (or twelve!) and everyone that works there is friendly and helpful. The cafe has the best made-to-order stir fry and omelets on campus.",
            "Author": "College Freshman",
            "Date": "2010-04-25T14:08:55.7Z"
        },
        {
            "Rating": 3,
            "Review": "It snows and rains a lot which makes going out a hassle but students become used to it.",
            "Author": "College Junior",
            "Date": "2010-04-18T19:58:35.353Z"
        },
        {
            "Rating": 4,
            "Review": "Good on Campus, Not So Much Off Campus – The college works really hard to provide alternative social scenes to the drinking atmosphere (which is super easy to avoid and there is no pressure to join it) and the college does a really good job.  Anything from arts to athletics to more academic work, there is a club for it.  And, if there isn't a club, you can start one really easily.  Off campus is a small town, so not much is offered.",
            "Author": "College Freshman",
            "Date": "2010-03-21T21:08:20.93Z"
        },
        {
            "Rating": 4,
            "Review": "I love this college, as do most of the people I talk with.  Dartmouth is a best kept secret, we feel.  It's an Ivy league with enormous opportunities, in a great area (New England is really gorgeous, especially during the fall) and is community-based.",
            "Author": "College Freshman",
            "Date": "2010-03-21T21:04:01.25Z"
        },
        {
            "Rating": 3,
            "Review": "Not Bad – Frats and affinity housing has parking, but you'll likely end up in A-lot, which is over a mile away from the closest dorms.  No one drives to class, so it's not that irritating.",
            "Author": "College Freshman",
            "Date": "2010-03-21T21:02:48.6Z"
        },
        {
            "Rating": 3,
            "Review": "One Way: Buses – Hanover is not very difficult to navigate on foot, as it is an extremely small town. The free public transportation/bus system runs on weekdays at reasonable times but not on weekends, which is sometimes an inconvenience. However, the Dartmouth Coach charter bus provides a clean and reliable way to travel to major cities such as Boston and New York.",
            "Author": "College Sophomore",
            "Date": "2010-03-13T09:21:32.883Z"
        },
        {
            "Rating": 4,
            "Review": "Well Kept, Quiet, Social, and Brand New – The school just got a new gym in 2008 for all varsity athletes, which freed up TONS of space in the student gym, which is free if you go to the school. The treadmills and elliptical machines in there have built in TV's which is awesome because you can count on people to join you in the gym to \"workout\" i.e. watch grey's anatomy. The student center is great with tons of couches, a random piano that people will play on, 5 different flat screen TV's and tons of other fun things like a dancing center, pool tables, free coffee and tea in one of the student cafes, its really fun to just hang out around campus.",
            "Author": "College Junior",
            "Date": "2010-03-06T23:16:24.44Z"
        },
        {
            "Rating": 5,
            "Review": "All Student Are Required to Have a Laptop – The school requires all students to have a laptop so finding a computer is not hard. All of campus is wireless and for some reason if you do not have your computer the computers in the library are really nice, modern, and accessible.",
            "Author": "College Junior",
            "Date": "2010-03-06T23:12:07.773Z"
        }
    ],
    "Value": [
        {
            "Rating": 3,
            "Review": "I am concerned about my future opportunities, mostly because it has been difficult to secure worthwhile internships.  Freshman summer internship opportunities were limited both by limited exposure to companies to apply to, since there is no on campus career fair in the engineering school and by the limited course background.  Sophomore internship was difficult for the above reasons adn additionally because the trimester off during sophomore year that is required is not when many companies hire college interns - they do it in the summer when all the Dartmouth sophomores have to be at school.",
            "Author": "College Junior",
            "Date": "2016-09-14T18:57:55Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth has tons of connections/networks. Also, it's name is super prestigious. Finding jobs is a breeze with campus services/recruitment",
            "Author": "College Freshman",
            "Date": "2016-08-26T08:04:37Z"
        },
        {
            "Rating": 4,
            "Review": "Alumni networking is great. There are many career centers and fairs that help students get to the next level.",
            "Author": "College Sophomore",
            "Date": "2016-08-03T16:07:26Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth has quite a name, and the D-Plan makes it so that there's not competition for internships or employment during the year. A lot of people have gotten connections and work through Dartmouth alumni as well.",
            "Author": "College Freshman",
            "Date": "2016-07-29T13:36:38Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth helps you get an internship and get into grad school",
            "Author": "College Junior",
            "Date": "2016-07-09T13:08:03Z"
        },
        {
            "Rating": 4,
            "Review": "It is very easy to get internships, fauculty will help you but you have to approach them first.",
            "Author": "College Sophomore",
            "Date": "2016-07-08T00:10:33Z"
        },
        {
            "Rating": 4,
            "Review": "Finding a job or internship can be fairly easy through the college especially through the Center for Professional Development.",
            "Author": "College Sophomore",
            "Date": "2016-07-04T21:42:57Z"
        },
        {
            "Rating": 3,
            "Review": "Unless you're an econ or business major, it seems much harder to get help from the college with finding internships.",
            "Author": "College Sophomore",
            "Date": "2016-07-04T15:43:59Z"
        },
        {
            "Rating": 5,
            "Review": "One of the most accessible and helpful alumni networks",
            "Author": "College Sophomore",
            "Date": "2016-06-28T09:19:51Z"
        },
        {
            "Rating": 4,
            "Review": "The alumni network is phenomenal",
            "Author": "College Freshman",
            "Date": "2016-04-24T17:54:34Z"
        },
        {
            "Rating": 5,
            "Review": "A Dartmouth degree is a permanent foot in the door practically everywhere. If an alum works at a firm you'd like to work for; you're basically guaranteed at least an interview.",
            "Author": "College Freshman",
            "Date": "2015-12-30T23:14:46Z"
        },
        {
            "Rating": 3,
            "Review": "Dartmouth's alumni network program is very strong.",
            "Author": "College Freshman",
            "Date": "2015-12-17T12:30:26Z"
        },
        {
            "Rating": 5,
            "Review": "I received an awesome financial aid package. It was the best offer out of all of my schools.",
            "Author": "College Student",
            "Date": "2015-05-20T20:12:17Z"
        },
        {
            "Rating": 4,
            "Review": "Friendly staff and personal attention",
            "Author": "Recent Alumnus",
            "Date": "2015-03-31T16:56:07Z"
        },
        {
            "Rating": 4,
            "Review": "I went through Dartmouth paying a minimal amount for school. This is a rare happening for international students. Dartmouth has the money, you just gotta ask for it.",
            "Author": "Recent Alumnus",
            "Date": "2015-03-26T17:35:40Z"
        },
        {
            "Rating": 5,
            "Review": "While I have yet to graduate, I think that the experience I am looking for is a difficult one (politics).",
            "Author": "College Junior",
            "Date": "2015-03-15T16:25:44Z"
        },
        {
            "Rating": 4,
            "Review": "Dartmouth financial aid is amazing, but the process is annoying for sure.",
            "Author": "College Junior",
            "Date": "2015-03-15T16:05:02Z"
        },
        {
            "Rating": 4,
            "Review": "Trips and orientation are often some of students favorite experiences here.",
            "Author": "Recent Alumnus",
            "Date": "2015-02-20T16:10:44Z"
        },
        {
            "Rating": 3,
            "Review": "Financial aid is a necessary headache for many students. While the Financial Aid office is inconvenient (they close at 4pm), the officers are fairly helpful.",
            "Author": "Recent Alumnus",
            "Date": "2015-02-20T15:58:27Z"
        },
        {
            "Rating": 2,
            "Review": "I was quoted a price estimated at early decision time which greatly increased after committing.",
            "Author": "College Freshman",
            "Date": "2015-01-15T18:46:38Z"
        },
        {
            "Rating": 4,
            "Review": "The college is paying everything for me. The only thing is a standard summer contribution cost that all students pay before the start of fall term. I thought I wasn't going to have enough for books, but there is an interlibrary loan system with the other Ivies and Ivy equivalents, and you can easily find your textbooks through there.",
            "Author": "College Freshman",
            "Date": "2014-11-13T17:25:46Z"
        },
        {
            "Rating": 4,
            "Review": "Ended up with great financial aid but had to fight for it a little.",
            "Author": "College Sophomore",
            "Date": "2014-09-09T15:59:44Z"
        },
        {
            "Rating": 5,
            "Review": "Students who graduate from Dartmouth are INCREDIBLY sought after by employers!! It is very easy to find jobs and internships and graduate schools will be all over you. Career services center is great and help a lot too! Really strong alumni network that is very true to the school and will help you a ton!",
            "Author": "College Sophomore",
            "Date": "2014-09-09T09:38:27Z"
        },
        {
            "Rating": 5,
            "Review": "Lots of financial aid available. Need-blind admissions!!",
            "Author": "College Sophomore",
            "Date": "2014-09-08T19:27:03Z"
        },
        {
            "Rating": 4,
            "Review": "The financial aid is good, but it could be better. Also, they say no loans but I have to take out loans anyway.",
            "Author": "College Sophomore",
            "Date": "2014-08-04T15:28:36Z"
        },
        {
            "Rating": 5,
            "Review": "From the graduating seniors I know, I can tell that a degree is very valuable. Personally, I just finished my first year, but I landed an internship through the public policy department's connections with alumni.",
            "Author": "College Sophomore",
            "Date": "2014-08-04T15:22:25Z"
        },
        {
            "Rating": 3,
            "Review": "The financial aid Dartmouth provides is not as substantial as some of its competitor schools, however, I still receive quite a bit of aid.",
            "Author": "College Sophomore",
            "Date": "2014-07-23T17:33:29Z"
        },
        {
            "Rating": 4,
            "Review": "The school has a lot of money, and it's financial aid is pretty good. Compared to other Ivy's, it's not the best. Our costs are really high, and we spend lots of unnecessary money on administration. Those who really need aid get it, and I think that the middle class gets the short end of the stick.",
            "Author": "College Sophomore",
            "Date": "2014-06-09T18:16:15Z"
        },
        {
            "Rating": 5,
            "Review": "Dartmouth was extremely generous with my financial aid.",
            "Author": "College Junior",
            "Date": "2014-05-20T20:09:14Z"
        },
        {
            "Rating": 3,
            "Review": "Be careful, the first year they offer a generous package, but it is not guaranteed afterwards.  I had to scramble for funding in my senior year and was forced to take out more loans than I expected.",
            "Author": "Recent Alumnus",
            "Date": "2014-05-15T20:50:41Z"
        },
        {
            "Rating": 4,
            "Review": "Well Dartmouth College is not known to give out extremely generous scholarships.  In my case, I was accepted into Harvard University with an extremely generous offer.  Due to an honor system between all of the Ivy League schools, Dartmouth matched my scholarship and I was set to come to Dartmouth.",
            "Author": "College Freshman",
            "Date": "2014-04-07T23:03:58Z"
        },
        {
            "Rating": 4,
            "Review": "I received financial aid throughout my time at Dartmouth, and it was not a hassle for me, but I did have many friends who felt like they were being haggled by the school regarding aid/payments.",
            "Author": "Recent Alumnus",
            "Date": "2013-12-27T10:28:42Z"
        },
        {
            "Rating": 5,
            "Review": "ROTC is hard work but if you want to go into the military, it's worth it!",
            "Author": "College Freshman",
            "Date": "2013-11-26T23:38:09Z"
        },
        {
            "Rating": 4,
            "Review": "There's a large endowment, and most students are given the aid they need to attend.",
            "Author": "College Freshman",
            "Date": "2013-11-25T19:36:08Z"
        },
        {
            "Rating": 3,
            "Review": "I received a decent amount of financial aid, but the process was excruciating, with financial aid officers nitpicking every detail and counting every asset as liquid money. Moreover, the financial aid package includes loan - which are less than helpful.",
            "Author": "College Freshman",
            "Date": "2013-09-22T11:51:06.857Z"
        },
        {
            "Rating": 4,
            "Review": "Since it is need blind it is unique and something that is really important since your financial aid is not a factor into getting into the school",
            "Author": "College Senior",
            "Date": "2013-08-10T15:50:08.72Z"
        },
        {
            "Rating": 5,
            "Review": "Need Blind Acceptance! Dartmouth is one of 10 or so schools that is need blind in the admission process, even for international students. On campus jobs for those who need them are easy to find and need-based scholarships, which will be the same at every Ivy, are usually more than other schools can offer.",
            "Author": "College Sophomore",
            "Date": "2012-07-22T14:03:35.893Z"
        },
        {
            "Rating": 1,
            "Review": "Stingy Stingy Stingy – financial aid office will try to take every penny from you instead of helping you out",
            "Author": "College Sophomore",
            "Date": "2011-12-05T19:17:11.347Z"
        },
        {
            "Rating": 1,
            "Review": "Hooks You in the First Year, Throws You to the Wolves Every Year After – Dartmouth tries to attract good students by providing relatively generous financial aid the first year, but every year after, the financial aid office drastically reduces the aid provided, using shady and non-transparent clauses to explain their actions.",
            "Author": "College Sophomore",
            "Date": "2011-08-01T02:01:25.66Z"
        },
        {
            "Rating": 4,
            "Review": "Got Nothing. We didn't qualify for need-based, and the Ivy league does not do merit.",
            "Author": "College Freshman",
            "Date": "2011-03-11T22:35:09.56Z"
        },
        {
            "Rating": 5,
            "Review": "Free Ride! Dartmouth promises to make it possible for any admitted student to be able to attend Dartmouth.  In fact, I actually get paid to attend.  Financial aid is based solely on need, but it's a very easy process.",
            "Author": "College Freshman",
            "Date": "2011-01-24T15:47:13.727Z"
        },
        {
            "Rating": 5,
            "Review": "Just Fill Out the Papers – The process was not difficult for me at all, and I received the financial aid I needed to not have to take out a loan my first year.",
            "Author": "College Freshman",
            "Date": "2011-01-11T17:50:54.447Z"
        },
        {
            "Rating": 3,
            "Review": "Helpful & Understanding Fin Aid Office – My financial aid situation is unique.  My parents fall into that weird middle-class bracket where we don't make little enough to receive tons of aid but we also don't make enough to pay for everything with ease.  With that being said my freshman year Dartmouth was great about comparing packages I'd gotten from other comparable schools.  They helped a lot and made sure I didn't have to pay as much as the federal government suggested.  This year I've gone into their office a few times and it's been a breeze each time - they saw me quickly, answered all my silly questions & explained the process step-by-step. The only reason I'm giving a B+ as opposed to higher is because I wish I could get more money.",
            "Author": "College Sophomore",
            "Date": "2010-12-25T02:52:28.1Z"
        }
    ],
    "Food": [
        {
            "Rating": 5,
            "Review": "Hanover does not allow chains.",
            "Author": "Recent Alumnus",
            "Date": "2015-03-31T17:01:42Z"
        },
        {
            "Rating": 3,
            "Review": "Same things over and over again. You got your Pizza, Chinese, Thai, Indian, Tapas, Mexican, American Comfort Food and Coffee place. and Subway and Starbucks. I guess you don't need much else.",
            "Author": "Recent Alumnus",
            "Date": "2015-03-26T17:42:01Z"
        },
        {
            "Rating": 3,
            "Review": "It's expensive and the swipe situation is not super practical but the school is getting better about it: now some of the  extra DBA rolls over. Plus, there is really nothing else to eat around hanover. Even if you manage to get on the off-campus meal-plan, you have to navigate the amount of time shopping + cooking for yourself takes in conjunction to how much time you need for academics. The meal-plan is not amazing, but it is pretty convenient.",
            "Author": "Recent Alumnus",
            "Date": "2015-03-26T17:17:58Z"
        },
        {
            "Rating": 4,
            "Review": "Off-campus dining is definitely great quality, but it is damn expensive.",
            "Author": "College Junior",
            "Date": "2015-03-15T16:17:28Z"
        },
        {
            "Rating": 4,
            "Review": "Food is great and there's a lot of variety, but it is ridiculously expensive.",
            "Author": "College Junior",
            "Date": "2015-03-15T16:02:33Z"
        },
        {
            "Rating": 3,
            "Review": "There are only a handful of restaurants in town, but a good variety. A number of them are quite expensive, and none offer student discount. That being said, you can still find good food at a decent price.",
            "Author": "Recent Alumnus",
            "Date": "2015-02-20T16:06:11Z"
        },
        {
            "Rating": 3,
            "Review": "Food on campus is generally pretty good quality, though the limited options means dining halls are often overcrowded. The meal swipe plan works well for some people, and so much for others. While it allows you to get an all-you-can-eat meal at Foco, you can't use your swipes to buy coffee or baked goods at KAF.",
            "Author": "Recent Alumnus",
            "Date": "2015-02-20T15:53:55Z"
        },
        {
            "Rating": 3,
            "Review": "I think that more should be offered through DBA at local spots.",
            "Author": "College Freshman",
            "Date": "2015-01-15T18:41:17Z"
        },
        {
            "Rating": 4,
            "Review": "The dining areas are cool.",
            "Author": "College Sophomore",
            "Date": "2015-01-08T21:47:46Z"
        },
        {
            "Rating": 4,
            "Review": "As I mentioned in my general review about Hanover, everything is pretty effing expensive! However, if you have the money and time, I totally recommend visiting Jewel of India, Boloco, and Morano Gelato. I'm also throwing in the Oriental Wok Express, which is in West Lebanon, but every college student loves Chinese and I can tell you right now their food is fantastic. Anyway, Jewel of India is an awesome family-run restaurant a bit aways from the Green in the center of Hanover. They have a website, will deliver anywhere within three miles of the restaurant, and offer a 10% student discount. All of the items on their menu are traditional Indian recipes and everything is delicious so it wouldn't hurt to try something new at this place. There's even a vegetarian option and if you don't finish everything, you can get take-out boxes. In terms of location, Boloco and Morano Gelato are much more centralized and less of a walk from the green. If you want a delicious burrito fast, go to Boloco. If you want to satisfy your ice cream craving but are sick of the flavors offered by Foco, go to Morano's. Both places are also more casual than Jewel of India so they're a good place to grab a quick bite to eat. Morano's is also right next to the Nuggest theater so you can go watch some cool films before/after your gelato treat!",
            "Author": "College Freshman",
            "Date": "2014-12-15T14:25:25Z"
        },
        {
            "Rating": 5,
            "Review": "There is definitely a great variety of food if you know where to look! Foco, for example, may be the most expensive of the campus's dining options, but it's totally worth it. There are separate sections for people who are vegetarians or allergic to gluten and a huge stir fry/salad bar. Every week, the cooks also prepare different special recipes from around the world! But if the amount of different food and drink is too overwhelming for you, there's always pizza haha. And, of course, the dessert bar. Overall, even if some days it is a little lacking, Foco is awesome and the food is delicious. The Hopkins Cafe is a great place as well with a nice atmosphere. I say that mostly because it is in the Hopkins Center so there are a lot of cool shows going on that you should totally watch if you have the time and money. It's more quiet than Foco too so if you and your friends just want to chat for a bit, you should hang out there. Among other things, the cafe is also good for stocking up on snacks! There is stuff like candy, trail mix, dried fruit, whatever you want. If you're willing to walk a bit, you can also go to East Wheelock's snack bar too, which opens late into the night in case anyone ever wants a midnight snack.",
            "Author": "College Freshman",
            "Date": "2014-12-15T13:50:16Z"
        },
        {
            "Rating": 3,
            "Review": "There is no student discount policy in place, which is a major bummer, since the college essentially forces you to overpay for okay food on campus. \r\n\r\nThere are about 15-20 restaurants off campus, including an Indian food restaurant, an East Asian food restaurant, and a burrito place, all of which are at least decent. There are 4 or 5 pizza places, some of which are pretty good.\r\n\r\nThe only place open late-night is Everything But Anchovies (EBAs), which is a student favorite for delivery and late night.\r\n\r\nIf you're looking for groceries, there is an upscale grocery store (The CO-OP) near enough to campus that walking isn't ridiculous (though it's not convenient). If you want a larger and cheaper grocery you'll have to take the bus (hourly on weekdays) ten minutes to West Lebanon or find other transport. \r\n\r\nThe only chain restaurants are a Subway, a Starbucks, and a Dunkin Donuts. Others, including Five Guys, Chili's, and plenty of others are a 10-minute bus ride away.\r\n\r\nThe best off-campus restaurant in Hanover (in my opinion) is Salt Hill Pub, a cheapish bar & grill type of place with plenty of seating, a shuffleboard table, and live music, karaoke, and trivia nights.",
            "Author": "College Sophomore",
            "Date": "2014-12-07T21:14:50Z"
        },
        {
            "Rating": 3,
            "Review": "Haven't really explored a lot of these options, but that's a lot of Asian cuisine, as well as other ethnic group cuisine.",
            "Author": "College Freshman",
            "Date": "2014-11-13T17:21:24Z"
        },
        {
            "Rating": 4,
            "Review": "A few really good restaurants right down town but they can be expensive. Morano gelato was ranked one of the best in the country, Molly's is always popular, some decent ethnic food, and 3 guys BBQ is great. Also some really good places to eat further off campus if you have access to a car.",
            "Author": "College Sophomore",
            "Date": "2014-09-09T15:26:17Z"
        },
        {
            "Rating": 5,
            "Review": "Lots of different options, high quality of food!",
            "Author": "College Sophomore",
            "Date": "2014-09-08T19:31:29Z"
        },
        {
            "Rating": 5,
            "Review": "Very nice various different types of restaurants in walking distance of the campus.",
            "Author": "College Sophomore",
            "Date": "2014-09-08T19:19:29Z"
        },
        {
            "Rating": 3,
            "Review": "The actual food is good. The system of buying it is not. If there is one thing that unites practically all Dartmouth students, it is that they dislike DDS.",
            "Author": "College Sophomore",
            "Date": "2014-08-04T15:32:02Z"
        },
        {
            "Rating": 3,
            "Review": "The quality of the food served in the dining halls is decent, however, the meal plan can be quite frustrating. The current meal plan compels students to eat almost exclusively on campus from fear of wasting an already-paid-for meal plan.",
            "Author": "College Sophomore",
            "Date": "2014-07-23T17:20:59Z"
        },
        {
            "Rating": 5,
            "Review": "Off campus dining is insanely good. From upscale (Pine) to cheap and greasy (Orient, C&A Pizza) there are something like 12+ options and they're all good.  They have to be because land in downtown Hanover is so expensive.",
            "Author": "College Junior",
            "Date": "2014-05-20T20:08:58Z"
        },
        {
            "Rating": 5,
            "Review": "I loved the dining halls on campus. They were pretty good about having a variety of options, especially for people with special dietary requirements.\r\n\r\nWhen I first came to school, I had had surgery and needed to be on a liquid diet for a few months. The school worked with me to ensure that I had access to certain foods, and also being a vegetarian, there were always delicious vegetarian/vegan options on campus. Certain dining halls and cafes also stayed open late to ensure students could get food late at night while studying or after being out at a party.",
            "Author": "Recent Alumnus",
            "Date": "2013-12-27T11:13:55Z"
        },
        {
            "Rating": 4,
            "Review": "There are a few restaurants in town, mostly sit-down places or late-night establishments. The prices vary from inexpensive to expensive, and there are happy hour specials, but no real specials/discounts for students. There are more options in the next town over which is about a 10-15 minute drive, but those options are more fast food restaurants, which are inexpensive.",
            "Author": "Recent Alumnus",
            "Date": "2013-12-27T10:27:40Z"
        },
        {
            "Rating": 4,
            "Review": "dining halls around campus are great\r\nlots of options\r\neasy meal plan flexibility",
            "Author": "College Senior",
            "Date": "2013-12-06T16:25:53Z"
        },
        {
            "Rating": 4,
            "Review": "Small town means very few off-campus eating options. We have 4 dining halls and 3 cafes on our very small campus. Lots of options and food is available from 7 am to 2 am everyday",
            "Author": "College Senior",
            "Date": "2013-12-06T16:19:19Z"
        },
        {
            "Rating": 5,
            "Review": "Though many complain, as a picky Vegetarian who sometimes eats kosher I never have any trouble finding food. The dinning hall is pretty good quality with some variety, and the other cafes provide some options and in some cases restaurant quality food. On the other hand, the 1st term dining plan is a rip-off.",
            "Author": "College Freshman",
            "Date": "2013-11-26T23:55:43Z"
        },
        {
            "Rating": 4,
            "Review": "Bad pizza, late night ok pizza, fair/good pizza, a good Indian restaurant, a Thai place, a Chinese place, 2 bakeries, a Subway, a Burrito place, a fancy restaurant, a medium-fancy restaurant, and Italian restaurant, and Lou's (a dinner that is a campus legend.) These are the only eating establishments in Hanover.",
            "Author": "College Freshman",
            "Date": "2013-11-26T23:48:13Z"
        },
        {
            "Rating": 4,
            "Review": "Although the main dining hall can grow out very quickly, it still does try to switch it up and provide new and interesting options at least a couple times a month.  There are other dining places like Collis and The Hop that provide made-to-order food and always have specials that are actually pretty good.",
            "Author": "College Freshman",
            "Date": "2013-11-25T20:08:42Z"
        },
        {
            "Rating": 3,
            "Review": "The surrounding area severely lacks a variety of dining options. There is essentially only one small street for off campus dining (Main St.). The prices are average, but they do not offer discounts to students. The one perk about Dartmouth is that the college encourages students to take professors out to lunch. The college will give students a modest stipend so they can take a professor of their choice to any restaurant in the area--a very valuable resource to get to know a professor better.",
            "Author": "College Senior",
            "Date": "2013-09-15T10:39:39.857Z"
        },
        {
            "Rating": 4,
            "Review": "3 good dinning halls and also good places to snack in the library. KAF just opened in the library, really great for late night coffee and snacks",
            "Author": "College Senior",
            "Date": "2013-08-10T15:47:36.573Z"
        },
        {
            "Rating": 3,
            "Review": "I've lived in a small town before, so I was pretty impressed with the number of restaurants that Hanover supports.  That said, if you come from any sort of city, you'll probably find it a bit lacking.  But there are a few very good restaurants within walking distance from campus, and lots more  to choose from if you have a car.  Favorites include Molly's, Murphy's, Salt Hill Pub, Jewel of India, Lou's, Yama, Canoe Club, The Orient, and Boloco, which offer grill food, pizza, pasta, bakery food, Indian, Chinese, Japanese, and burritos.  There's not much open late at night, but EBA's (pizza) delivers until 2:10 am.",
            "Author": "College Sophomore",
            "Date": "2013-07-11T13:36:38.9Z"
        },
        {
            "Rating": 5,
            "Review": "great selections on campus and off.  They just need to get a Chipotle",
            "Author": "College Sophomore",
            "Date": "2013-07-07T05:57:30.927Z"
        },
        {
            "Rating": 4,
            "Review": "The good is very good on campus. Foco is my personal favorite (although it can get old). Athletes go to the Hop for greasy fried food, and Collis is nice for a smaller meal, whereas Foco is all you can eat. There are plenty of healthy options for those of us who like to be conscious of what we eat.",
            "Author": "College Freshman",
            "Date": "2013-04-24T00:33:18.533Z"
        },
        {
            "Rating": 3,
            "Review": "There are a few good restaurants - Molly's, Murphy's, Market Table, Pine. However, the options are very limited (those are basically the only places). Needless to say they get old REALLY quickly.",
            "Author": "College Freshman",
            "Date": "2013-04-24T00:18:27.01Z"
        },
        {
            "Rating": 3,
            "Review": "There are a few places to eat off campus such as EBA's, Yama, Salt Hill, Molly's, Boloco. However, most student groups will frequently order take out for meetings, so there is a good chance you will exhaust the off-campus dining options. The prices vary but they are not all that economically-friendly. Keep in mind, Hanover is a small town and there is not much there.",
            "Author": "College Sophomore",
            "Date": "2013-01-02T14:42:45.473Z"
        },
        {
            "Rating": 3,
            "Review": "Food at Dartmouth is generally decent, with some dining halls, and some meals usually being better than others.  Some things are always a hit, while others vary day-to-day.\r\n\r\nThere are three major dining halls at Dartmouth: Fifty Three Commons (FoCo), Collis, and the Hop, as well as several other, smaller, places to eat (Novack, King Arthur Flour...).  FoCo is all-you-can-eat, while the rest are pay-per-item.  Food varies from place to place, and sandwiches, pasta, stir fry, grilled food, and cookies are staples of a Dartmouth student's diet.\r\n\r\nMeal plans include a certain number of \"meal swipes,\" which give you entry into FoCo, and a certain number of flex dollars that can be spent at any of the others.  Meal swipes can be used to buy a certain dollar amount worth of food at any of the other dining halls (the value varies by time of day), and flex dollars can be used to buy entry into FoCo (again, price varies by time of day).  These options are generally not worth it.\r\n\r\nSome of the best deals include the dinner special or burger special at the Hop, stir fry or the pasta dinner at Collis, or Sunday brunch at FoCo.",
            "Author": "College Freshman",
            "Date": "2012-12-29T22:49:30.83Z"
        },
        {
            "Rating": 4,
            "Review": "There's pretty much something for everyone, but because Dartmouth is a small school, the options aren't limitless but they are varied. Foco is an acquired taste for most students because it's the biggest dining hall on campus, but it does have the most options. Collis is a great place for lunch with fresh stir-fry and pasta choices. For late night, Novack Cafe is open until 2am, and for coffee, we have a King Arthur Flour cafe in the library, which is a campus favorite. The meal plans are improving as the years go on, but I suggest leaving the 20 for freshman year.",
            "Author": "College Sophomore",
            "Date": "2012-12-09T19:16:41.043Z"
        },
        {
            "Rating": 4,
            "Review": "For such a small town, Hanover has a lot of restaurants.  There is a wide variety of foods and prices, but everything I've eaten off-campus has been really good.  Places like Boloco and EBA's deliver to the dorms, which is convenient for those who don't want to walk.  But nothing is far from campus.",
            "Author": "College Freshman",
            "Date": "2012-11-30T11:34:53.163Z"
        },
        {
            "Rating": 3,
            "Review": "I gave off-campus dining a B simply because there are not many options within walking distance.  However, the options that you do have (Lou's, Molly's, EBA's, etc.) are very good and are within a reasonable price range.",
            "Author": "Recent Alumnus",
            "Date": "2012-11-08T14:38:28.587Z"
        },
        {
            "Rating": 3,
            "Review": "Collis is the best dining option, the food is amazing, but there isn't too much variety. The Food court is next, it has lots of variety, but in my opinion it is not that good. And the meal plans are lacking a bit.",
            "Author": "College Junior",
            "Date": "2012-10-20T11:51:50.413Z"
        },
        {
            "Rating": 3,
            "Review": "There are good places on campuses like the dining halls and if one wants, there are many small restaurants around.",
            "Author": "College Junior",
            "Date": "2012-10-04T23:33:35.627Z"
        },
        {
            "Rating": 3,
            "Review": "The off-campus food is tasty, and there are a variety of cuisines, however there is only one restaurant of each type. It's easy to eat at every single place twice by the end of your freshmen year. So by senior year, you're pretty sick of the off-campus options. Also, every single restaurant is way over-priced. You can't get any meal at any restaurant for less that ten bucks. Even something as simple as salad or chicken tenders and fries.",
            "Author": "College Senior",
            "Date": "2012-09-17T15:44:02.547Z"
        },
        {
            "Rating": 4,
            "Review": "The Food Is Great – Alright, so the food on campus is really good. We have three main dining facilities: FoCo, Collis Caf&#233;, and the Hop. FoCo is all-you-can-eat and has excellent pizza, burgers, chicken, and a huge salad and dessert bar everyday. It rotates the other mains dishes every day (homemade station, international station, and a vegetarian station). Collis has incredible pasta, stir-fry, salad bar, and omelettes every day, and a bunch of healthy options. You only pay for what you select. The Hop is near the gym, and has a delicious grill selection (quesadillas, burgers, fries) and a deli. Delicious. SO, food is great, but the dining plans are not. It's kind of expensive and sometimes you feel DDS (Dartmouth dining services) are ripping  you off, but it really isn't that bad.",
            "Author": "College Sophomore",
            "Date": "2012-08-06T12:47:44.247Z"
        },
        {
            "Rating": 4,
            "Review": "Pretty Good! okay, so Hannover isn't exactly known for its off-campus dining… But I think it's pretty darn good! You have so much variety, there're some places that are cheap, others that are expensive, great places to go with friends, great place to go to parents, and the pizza joint that is open until 2 AM, for drunken escapades. We love it here, there are always places to go, and the local atmosphere is so friendly.  also dirt cowboy is great for coffee!",
            "Author": "College Sophomore",
            "Date": "2012-07-29T11:12:27.513Z"
        },
        {
            "Rating": 1,
            "Review": "Dartmouth's campus dining has fallen on hard times.   The Dartmouth now bares the dubious honor of being the only Ivy League school to have been sued for its poor services and outrageous meal price changes.   The food is dramatically overpriced (one student was famously billed $60 for a chicken sandwich) and the only thing more unbelievable than poor quality is the stunning lack of variety. To make matters worse the dining schedule is beyond belief.   Food must be consumed at weird hours and carry out options are subject to convoluted rules and a lawyer couldn't understand.   If you care allot of but food, or hate being screwed over, Dartmouth is not the place for you.",
            "Author": "Recent Alumnus",
            "Date": "2012-07-03T15:17:23.657Z"
        },
        {
            "Rating": 3,
            "Review": "After they renovated Foco and got rid of the amazing Homeplate and Foco and replaced it with a large all-you-can-eat dining hall, food definitely took a nosedive. They make an effort to bring in ethnic cuisine, but often don't do an amazing job at it. Food definitely gets pretty boring towards the end of the quarter.",
            "Author": "College Sophomore",
            "Date": "2012-05-22T15:26:36.033Z"
        },
        {
            "Rating": 3,
            "Review": "Decent but Hard to Eat Healthy – The title pretty much explains it. Its also fairly expensive and the meal plan options have recently been changed to benefit the college financially while hurting the eating habits of the students. But students are protesting and moving to get the changes reversed.",
            "Author": "College Junior",
            "Date": "2012-01-07T22:41:30.597Z"
        },
        {
            "Rating": 3,
            "Review": "Good Food, Bad Value – Although there are a few places on campus to eat, there is only one place i like to go. With the meal plan from fall term, I ended up having to pay dining services $100 because I exceeded my flex-dollar allowance. The food is great at The Hop, but the price is outrageous.",
            "Author": "College Freshman",
            "Date": "2011-12-28T11:55:31.117Z"
        },
        {
            "Rating": 2,
            "Review": "Not Too Much to Rave About – There aren't too many options in town and the options aren't very diversified.",
            "Author": "College Senior",
            "Date": "2011-12-24T22:52:30.003Z"
        },
        {
            "Rating": 3,
            "Review": "Good but Not Great – The food isn't bad by American standards (it's probably pretty good, actually), but as an Asian-American who grew up in a household eating Asian food, I get bored quickly with what's offered here. Also, the meal plan required for freshmen is annoying and a waste of money; using 20 meal swipes a week is not economical.",
            "Author": "College Freshman",
            "Date": "2011-11-26T13:09:21.557Z"
        },
        {
            "Rating": 3,
            "Review": "Bland and Repetitive – Same rotating schedule of meals every week with limited dining options.",
            "Author": "College Sophomore",
            "Date": "2011-08-01T01:54:52.393Z"
        },
        {
            "Rating": 4,
            "Review": "Variety, but Gets Old. There are definitely a variety of dining options in the area that cater to most food cravings.  There's Korean, Japanese, Chinese, Thai, Indian, \"American.\" There all a little over priced, but not too bad when you consider the isolation of the campus. \r\n\r\nThe food selection gets old though after while, but again that is due mostly to the isolation and the lack of more restaurant selections.",
            "Author": "College Senior",
            "Date": "2011-03-11T21:58:58.457Z"
        },
        {
            "Rating": 5,
            "Review": "Lots of Variety – We have everything from local organic produce to chicken nuggets and cheeseteaks.  We have a bunch of different dining halls and they all offer different options.  There are also dining halls that are open for late-night food.  Everyone always has a meal plan.",
            "Author": "College Junior",
            "Date": "2011-03-10T10:13:09.387Z"
        },
        {
            "Rating": 3,
            "Review": "Not Bad – At Dartmouth there are 5 places to eat, one of which is little more than a cafe. The other 4 are good, although there isn't a ton of variety in the menus. Overall it is pretty good until the end of the term when you've had the same thing over and over again for weeks. The dining halls are only close to one of the dorm buildings, so be ready for a bit of a snow hike during winter term.",
            "Author": "College Freshman",
            "Date": "2011-01-19T12:53:08.647Z"
        },
        {
            "Rating": 3,
            "Review": "Lack of Variety – Hanover is a very small town, so most of the dining places are located centrally to campus. However, there are only about 5-10 places to eat off campus. That being said, they all serve fairly decent food (Molly's and Lou's being the best) but it gets repetitive having to eat at the same places off campus all the time.",
            "Author": "College Freshman",
            "Date": "2010-12-11T12:05:42.293Z"
        },
        {
            "Rating": 5,
            "Review": "Dining on campus is awesome.  I guess it has to be considering there aren't more than two student-friendly restaurants in town.",
            "Author": "College Sophomore",
            "Date": "2010-08-24T17:05:06.22Z"
        },
        {
            "Rating": 4,
            "Review": "Surprisingly Large Variety – Considering Hanover's small size, the town has a remarkable variety of dining options. Prices range from the classy Canoe Club restaurant to Thursday night pizza and beer specials at Ramunto's. Great ethnic food is also available from Mai Thai (Thai), Yama (Japanese), and Gusano's (Mexican). Student favorites include Ben & Jerry's and Everything But Anchovies, which delivers until 2:15 AM.",
            "Author": "College Sophomore",
            "Date": "2010-08-08T16:52:20.303Z"
        },
        {
            "Rating": 3,
            "Review": "...for such a small suburban town. The options for off-campus dining, while not numerous, are nicely varied. Just don't expect any brand-name chain eateries to roll into town any time soon; Hanover makes a point of keeping those out.\r\n\r\nThe local feel to the restaurants is great, however, and while my personal favorite is probably Yama (Korean entrees/Japanese sushi bar), others like Jewel of India and Gusanoz are other reasonably priced and palatable ethnic options. For those who like their eating out more American, there is a wide variety of those too, from Canoe Club (refined casual, expensive) to Ramunto's and EBA's (your typical American pizzas, wings, etc., cheaper).",
            "Author": "College Sophomore",
            "Date": "2010-07-18T00:57:36.517Z"
        },
        {
            "Rating": 3,
            "Review": "Dining Places and Cost – There are several great restaurants a block away from campus. Murphy's, Lou's, EBA's. These range from a cheap meal for 7 dollars to an expensive dinner for $20. There are at least two Chinese restaurants, and typical American food. \r\nThere are also ice-cream...and just about everything.",
            "Author": "College Sophomore",
            "Date": "2010-04-12T14:40:38.047Z"
        }
    ],
    "Housing": [
        {
            "Rating": 4,
            "Review": "Only issue with housing has to do with the Dplna, where students leave campus for 1 trimester during their sophomore year.  This requires a lot of moving in and out of dorms.  it also means that during the sophomore year, your friends that you made during Freshman year are never all at school on campus at the same time.  Each trimester that you are at school during sophomore year, people that you care about, or are learning from or working with are constantly coming and leaving campus for several months at a time and it is a bit of a negative.  Sophomore summer when everyone is there again is really nice.  Unfortunately, then in Junior year, people start leaving again to do a semester abroad.",
            "Author": "College Junior",
            "Date": "2016-09-14T18:38:35Z"
        },
        {
            "Rating": 5,
            "Review": "I live in a good house with really good facilities (newest).",
            "Author": "College Freshman",
            "Date": "2016-08-26T08:00:01Z"
        },
        {
            "Rating": 3,
            "Review": "I lived in Choates and sometimes the heater wouldn't be working. In the spring there were no AC coolers and it was very hot in the dorms. Sometimes the window wouldn't open all the way.",
            "Author": "College Sophomore",
            "Date": "2016-08-03T16:00:36Z"
        },
        {
            "Rating": 5,
            "Review": "Fayerweather mid, where I am living, is one of the best dorms on campus. It is decently close to my classes. However, the River cluster is quite far away from everything, and some of the dorms are not very spacious.",
            "Author": "College Freshman",
            "Date": "2016-07-29T13:30:22Z"
        },
        {
            "Rating": 4,
            "Review": "Lots of choices and living and learning communities to choose from.",
            "Author": "College Junior",
            "Date": "2016-07-09T13:01:34Z"
        },
        {
            "Rating": 3,
            "Review": "Campus housing option for Freshmen varies a lot in terms of quality. I lived in Choates during freshmen year, and that is considered the one of the worst, but all in all, it's really no that bad if you don't spend too much time in your room. There are freshmen dorms such as McClaughlin that has elevators, snack bar, and very new and spacious rooms; it was built recently. However, the housing system is changing, and all undergrads are now assigned to certain \"houses\" randomly, kinda like in Harry Potter. There is the Allen House, North House, South House, West House, East Wheelock House, and School House. If you don't like random selection, you can also apply to live in living learning communities, LLCs.",
            "Author": "College Sophomore",
            "Date": "2016-07-07T23:57:43Z"
        },
        {
            "Rating": 3,
            "Review": "Freshmen dorms are a bit tough to deal with but other dorms are more tolerable. Space is not a huge issue.",
            "Author": "College Sophomore",
            "Date": "2016-07-04T21:34:12Z"
        },
        {
            "Rating": 4,
            "Review": "Housing is really a mixed bag and your experience truly does depend on where you live.",
            "Author": "College Sophomore",
            "Date": "2016-07-04T15:37:56Z"
        },
        {
            "Rating": 4,
            "Review": "Depends on where you live and which buildings you have most of your classes",
            "Author": "College Sophomore",
            "Date": "2016-06-28T09:13:53Z"
        },
        {
            "Rating": 4,
            "Review": "Beautiful campus with great options",
            "Author": "College Freshman",
            "Date": "2016-04-24T17:42:17Z"
        },
        {
            "Rating": 5,
            "Review": "I'm in McLaughlin, some of the newest and nicest dorms on campus, in a spacious one-room double. The room is perfect and I really don't wanna leave it at the end of the year (it's honestly better than my room at home and most hotel rooms), but there are very few bad housing options on campus (besides, perhaps, the River).",
            "Author": "College Freshman",
            "Date": "2016-02-02T01:49:18Z"
        },
        {
            "Rating": 4,
            "Review": "Great experience living in a community house (Cutter Shabazz), my family for 3 years.",
            "Author": "Recent Alumnus",
            "Date": "2016-01-02T00:22:13Z"
        },
        {
            "Rating": 5,
            "Review": "Amazingly huge dorms, the worst dorms on campus are still miles better than many of the best dorms at lots of other schools.",
            "Author": "College Freshman",
            "Date": "2015-12-30T23:10:37Z"
        },
        {
            "Rating": 4,
            "Review": "I personally live in what's considered the \"worst\" freshmen dorms on campus, but even these aren't bad - while the rooms are small, the great community more than makes up for the lack of space",
            "Author": "College Freshman",
            "Date": "2015-12-30T08:34:22Z"
        },
        {
            "Rating": 3,
            "Review": "I'm in the nicest dorm for freshman, so I can't complain.",
            "Author": "College Freshman",
            "Date": "2015-12-17T12:24:06Z"
        },
        {
            "Rating": 4,
            "Review": "Moved almost every term due to the D-Plan (off terms). Dorms are clean, custodians are nice. Moving can be a pain but everyone is helpful. I love how open the living spaces are. No sign-ins or guards, so you can easily visit all your friends. All of them are convenient and close because the campus is small.",
            "Author": "Recent Alumnus",
            "Date": "2015-03-31T16:52:03Z"
        },
        {
            "Rating": 4,
            "Review": "Definitely better than on-campus housing if you are willing to brave the winter on the way to class. The freedom is worth it for sure.",
            "Author": "Recent Alumnus",
            "Date": "2015-03-26T17:43:11Z"
        },
        {
            "Rating": 3,
            "Review": "Campus housing is pretty great granted there is really not much else available except for greek/society houses and off-campus houses. It's clean, well taken care of, somewhat spacious depending on what lottery number you get and good in terms of location. The lottery system is rather hectic but manageable.",
            "Author": "Recent Alumnus",
            "Date": "2015-03-26T17:14:02Z"
        },
        {
            "Rating": 3,
            "Review": "Although I've never lived off-campus, plenty of my friends have apartments off-campus. The rooms are ok, but they are basically dorms off-campus with more freedom. Same quality (perhaps slightly depending on the place).",
            "Author": "College Junior",
            "Date": "2015-03-15T16:18:47Z"
        },
        {
            "Rating": 2,
            "Review": "Living off campus is costly and competitive, which is ironic given the extremely low quality of options available. Landlords range from inaccessible to crazy, and most apartments are small, dirty, and expensive.",
            "Author": "Recent Alumnus",
            "Date": "2015-02-20T16:08:18Z"
        },
        {
            "Rating": 3,
            "Review": "There's a huge disparity between the good and bad housing clusters on campus. While modern buildings like East Wheelock and McLaughlin are beautiful, comfortable, and filled with social & study spaces, older buildings like the Choates and the River have few amenities.",
            "Author": "Recent Alumnus",
            "Date": "2015-02-20T15:49:16Z"
        },
        {
            "Rating": 4,
            "Review": "I think it would be difficult to live on the river if you spend most of your time at the athletic facilities.",
            "Author": "College Freshman",
            "Date": "2015-01-15T18:35:13Z"
        },
        {
            "Rating": 3,
            "Review": "If you search long enough, you'll always get your dream home just next to the campus",
            "Author": "College Sophomore",
            "Date": "2015-01-08T21:46:47Z"
        },
        {
            "Rating": 4,
            "Review": "Housing is cool. You can get whichever choice you want  (if you survive the competition,of course)",
            "Author": "College Sophomore",
            "Date": "2015-01-08T21:41:16Z"
        },
        {
            "Rating": 5,
            "Review": "Freshman housing is universally pretty great--much better than dorms I've seen at other colleges.",
            "Author": "College Freshman",
            "Date": "2014-11-20T23:21:57Z"
        },
        {
            "Rating": 4,
            "Review": "Not many students live off campus but if you want to there are a variety of options. Can be a bit expensive but still cheaper than the dorms most of the time. Not too hard to find. There are lots of houses that are passed down between students but they can be somewhat run down. If you want to pay more there are nicer options. All within walking distance of campus.",
            "Author": "College Sophomore",
            "Date": "2014-09-09T15:46:33Z"
        },
        {
            "Rating": 4,
            "Review": "Wide range of freshmen dorms. Some are amazing while others are pretty bad. It all depends how lucky you get and what is important to you in a dorm (proximity to classes, good social life, or cleanliness/quietness). Upperclassman housing is generally worse for sophomores but gets significantly better after that. One great thing is that almost everyone lives on campus or within walking distance at least so the campus has a good social atmosphere. Housing is a bit overpriced but so are most things in Hanover. Room draw can be frustrating especially because of the D plan.",
            "Author": "College Sophomore",
            "Date": "2014-09-09T15:07:23Z"
        },
        {
            "Rating": 5,
            "Review": "If you want it you can get it but the on-campus housing options are fantastic so there is little reason to live off-campus.",
            "Author": "College Sophomore",
            "Date": "2014-09-08T19:37:20Z"
        },
        {
            "Rating": 5,
            "Review": "Fantastic housing, great dorms, great people!",
            "Author": "College Sophomore",
            "Date": "2014-09-08T19:14:29Z"
        },
        {
            "Rating": 4,
            "Review": "Living in a dorm like Fahey-McLane is comparable to a hotel, however, the Choates are quite outdated.",
            "Author": "College Sophomore",
            "Date": "2014-07-23T17:28:03Z"
        },
        {
            "Rating": 3,
            "Review": "Off-campus housing really varies at Dartmouth. There are some beautiful houses with spacious rooms and clean, working facilities (bathroom and kitchen) but there are also others that are very badly looked after, where students are paying bills unworthy of the house. The problem is that very few landlords own most of the off-campus property, so they end up having a monopoly.",
            "Author": "College Junior",
            "Date": "2014-07-12T14:38:51Z"
        },
        {
            "Rating": 3,
            "Review": "It is what it is.  You don't need off campus housing because the dorms and greek houses are great to live in, but if you really want to live off campus it's there.  One universally hated landlord controls something like 60% of real estate in town and is under investigation by the FBI.  Perhaps things will improve if she's arrested.",
            "Author": "College Junior",
            "Date": "2014-05-20T20:18:53Z"
        },
        {
            "Rating": 4,
            "Review": "With two exceptions, the dorms are all beautiful. Many are new and those which aren't are picturesque colonial architecture (think fire places in rooms, though you're not allowed to use them).  Every freshman is put onto a floor with other freshman and usually that's where you meet your first close friends.",
            "Author": "College Junior",
            "Date": "2014-05-20T20:14:52Z"
        },
        {
            "Rating": 3,
            "Review": "I never lived off campus--don't have much experience on the subject",
            "Author": "Recent Alumnus",
            "Date": "2014-05-15T22:27:07Z"
        },
        {
            "Rating": 3,
            "Review": "Some dorms are great and some are awful. The housing process is unnecessarily tedious, so off-campus housing is advantageous for many students (it also allows more meal plan freedom)",
            "Author": "College Freshman",
            "Date": "2014-02-15T13:47:05Z"
        },
        {
            "Rating": 5,
            "Review": "I loved my dorms on campus! They were fairly spacious and in close proximity to classes and the dining halls. It was nice to have your own space on campus, though the housing process to get a \"good\" dorm was sometimes stressful.",
            "Author": "Recent Alumnus",
            "Date": "2013-12-27T10:53:16Z"
        },
        {
            "Rating": 3,
            "Review": "few off campus options\r\nmost live in greek houses or dorms",
            "Author": "College Senior",
            "Date": "2013-12-06T16:29:09Z"
        },
        {
            "Rating": 5,
            "Review": "I have a single room- no complaints. I also live in the farthest dorm from campus, but if you have a bike, everything is fine. Most dorms are good- just DO NOT LIVE IN THE CHOATES, unless you like load parties 24/7. \r\nHere are the best freshmen dorms:\r\nMcLaughlin \"Hotel McLaughlin\"\r\nFahey-McLane (central location)\r\nEast Wheelock (far away but great community)\r\nRussel-Sage (Russel Rage)\r\n\r\nHere are the worst:\r\nChoates (noisy and old)\r\nRiver Cluster (far away and old, but they have a great community)",
            "Author": "College Freshman",
            "Date": "2013-11-27T00:08:15Z"
        },
        {
            "Rating": 5,
            "Review": "Freshman floors become very tight, but there are definitely some dorms that are much better than others.  Some of the worst are also the farthest from campus.",
            "Author": "College Freshman",
            "Date": "2013-11-25T20:02:55Z"
        },
        {
            "Rating": 3,
            "Review": "Off-campus housing isn't terribly sought after",
            "Author": "College Freshman",
            "Date": "2013-11-25T19:57:18Z"
        },
        {
            "Rating": 3,
            "Review": "Rent is super expansive! It would be very difficult to be a full-time student and work to pay rent and utilities. Parking would be extremely hard to come by! And if you do find parking it's usually far away from class.",
            "Author": "Recent Alumnus",
            "Date": "2013-09-30T10:28:12Z"
        },
        {
            "Rating": 4,
            "Review": "Most of the housing is very nice. The \"worst\" place to live on campus would be the River which only houses freshmen.",
            "Author": "College Sophomore",
            "Date": "2013-07-30T00:19:59.67Z"
        },
        {
            "Rating": 2,
            "Review": "Living above Murphy's (there are apartments above the Murphy's restaurant) is probably the best, if not the only, off-campus housing option. Almost nobody lives off-campus though. The Dartmouth dorms are really nice, very convenient, and housing is essentially - though not formally - guaranteed for all 4 years.",
            "Author": "College Freshman",
            "Date": "2013-04-24T00:26:42.6Z"
        },
        {
            "Rating": 3,
            "Review": "I really like living on campus, the campus is small so any dorm (except the river) is a good location. The freshmen dorms always seem to be the best because people always have the best memories there.",
            "Author": "College Junior",
            "Date": "2012-12-31T11:58:38.367Z"
        },
        {
            "Rating": 3,
            "Review": "Hanover is a small town, so off-campus housing is very close to campus and is definitely with-in parking/biking distance.  The price is about 600, give or take, per month and the conditions of the houses or apartments are in pretty good shape (landlords are also available if things go wrong).  There is parking available at your off-campus residence and if you hate walking you can alway buy a pass for on-campus parking.  Getting off-campus housing is readily available, a ton of people blitz (email) out about it and if you know someone in an off-campus house/apt then you are in.",
            "Author": "Recent Alumnus",
            "Date": "2012-11-08T15:06:58.62Z"
        },
        {
            "Rating": 4,
            "Review": "Some Good Some Bad – I have only finished my freshman year, but I've heard about the other dorms as well. As far as freshman dorms, you just don't want to be placed in the River dorms because they are far away. But the majority of dorms are very clean, I never had a problem with the bathroom or with any bugs in my dorm. The Mclaughlin dorms are brand new so they are really nice. The other upperclassmen dorms are nice and in the middle of campus.",
            "Author": "College Sophomore",
            "Date": "2012-08-01T16:57:22.013Z"
        },
        {
            "Rating": 4,
            "Review": "Lots of Options – The housing is great on campus. There are lots of comfortable options (though in recent years, more freshman have had to live in one room doubles or two room triples than in the past). There is also tons of affinity housing which offers a closer community than the traditional dorm setting.",
            "Author": "College Junior",
            "Date": "2012-01-07T22:42:45.43Z"
        },
        {
            "Rating": 3,
            "Review": "Not Too Bad – Dartmouth has a website where all the listings of available off campus apartments are. The closer you are to campus, the more the apartments seem like dungeons, but the farther you go and the better the deal.",
            "Author": "College Senior",
            "Date": "2011-12-24T22:54:19.28Z"
        },
        {
            "Rating": 3,
            "Review": "In a 2- Room Triple – A bit crowded and small - only 2 closets for 3 students  - they did ad a wardrobe which takes up a lot of the small space.. obviously a  2 room double which now houses 3 students",
            "Author": "College Freshman",
            "Date": "2011-11-16T11:29:31.593Z"
        },
        {
            "Rating": 3,
            "Review": "Lucky to Get a Single – if you get a single, you're in good shape. otherwise, it sucks",
            "Author": "College Sophomore",
            "Date": "2011-10-14T08:10:16.5Z"
        },
        {
            "Rating": 3,
            "Review": "Luck of the Draw – Off-campus housing is pretty much out of the option as most of them are too far and inaccessible and the vast majority of the campus chooses to live on-campus. Freshmen dorm are assigned randomly and options get better as you progress through the years, but each year, the random number that you are given determines how good of a room you can get. With increasing sizes of incoming classes, Dartmouth has been facing a housing shortage but for the most part, on-campus living is not too bad. Especially if you're lucky enough to get the good numbers.",
            "Author": "College Senior",
            "Date": "2011-06-25T19:59:33.603Z"
        },
        {
            "Rating": 4,
            "Review": "Available If You Want It – If you want to live off-campus, there are many options available.  It's a little cheaper than living on-campus.  On-campus housing is really nice though, so most students choose to live on campus.  Students who live on-campus can almost always get a single or an on-campus apartment (the apartments are four singles and two bathrooms with a living room and a kitchen).",
            "Author": "College Junior",
            "Date": "2011-03-10T10:24:36.977Z"
        },
        {
            "Rating": 4,
            "Review": "Costly, but Worthwhile Experience – As a freshman who must live on campus, I do feel that Dartmouth holds a monopoly on our dorming fees. It costs the same for two people in a double as it does for a person in a single, so a double is basically worth twice the rent in the single, and a triple is worth three times, although the square feet area of the rooms are not proportional to the price. However, when living in dorms, floormates are bound to become close like family, and it is a wonderful feeling to bond with everyone and have a solid set of friends that will be there no matter what.",
            "Author": "College Freshman",
            "Date": "2011-01-25T01:33:06.527Z"
        },
        {
            "Rating": 5,
            "Review": "The vast majority of Dartmouth's dorms are very modern and have fantastic social atmospheres. I live in one of the older buildings and I absolutely love it- people are always around and looking for something fun to do, and my room is much larger than the ones my friends at other colleges have. I really can't think of any way that Dartmouth's housing could be better,",
            "Author": "College Freshman",
            "Date": "2011-01-19T13:00:52.97Z"
        },
        {
            "Rating": 4,
            "Review": "Close to Campus – The apartments are very close to campus and a great value. If you live off-campus you probably end up paying less than students who live on campus. However, off-campus living is not extremely popular so if you want it, it's always available, affordable, and convenient.",
            "Author": "College Sophomore",
            "Date": "2010-08-31T14:45:51.13Z"
        },
        {
            "Rating": 3,
            "Review": "Almost All Houses – The off-campus housing options are usually a little bit cheaper than dorms, but they are almost always houses. The distance usually isn't a problem, especially since Dartmouth is pretty small.",
            "Author": "College Sophomore",
            "Date": "2010-08-03T11:01:11.83Z"
        },
        {
            "Rating": 4,
            "Review": "Good, but on the Expensive Side. There are plenty of off-campus options around Hanover. However, most students choose to spend most, if not all, of their years living on-campus. The school has some of the best housing options you'll find anywhere. Usually, students only live off-campus during their Sophomore year, when, due to the housing priority system, it is more difficult to get one of the better rooms. Students also tend to live off-campus if they want to live with a large group of friends. Housing does tend to be surprisingly expensive for such a small New England town.",
            "Author": "Recent Alumnus",
            "Date": "2010-07-22T10:36:53.49Z"
        },
        {
            "Rating": 4,
            "Review": "Huge Variety of Well-Kept Dorms – The best part of housing at Dartmouth is the sheer variety. We have singles, doubles one room and two room and three room, triples with one up to three rooms, four- and five-person suites, apartments, and affinity housing. Gender neutral housing is another really unique living style most commonly found in the East Wheelock cluster. New dorms like Fahey-McLane and McLaughlin are very spacious and well-designed although still with that generic dorm feeling. Older dorms like the Massachusetts cluster, although sometimes outfitted with aging utilities, are kept in good repair.",
            "Author": "College Sophomore",
            "Date": "2010-07-18T01:21:58.787Z"
        },
        {
            "Rating": 2,
            "Review": "Social Atmosphere – The social scene revolves around fraternities and sororities, which does not suit all the students. Alternative social spaces are rare, and thus after two years a student can get tired of the same ways of having fun. However, with the amount of school work it is not that easy to find the time for fun.",
            "Author": "College Junior",
            "Date": "2010-04-25T14:20:10.06Z"
        },
        {
            "Rating": 3,
            "Review": "Living Off Campus Is Not Really Necessary – Hanover, NH is a small town that does not have a lot of housing options for students. If you choose to live off-campus, it CAN be cheaper, but it will also be farther and less convenient than living on campus. Dartmouth offers some very nice dorms, though, so most students(about 90%)choose to live on campus all four years.",
            "Author": "College Freshman",
            "Date": "2010-03-19T16:12:36.627Z"
        },
        {
            "Rating": 3,
            "Review": "Hate This Place – make sure you get one of the newly built dorms or you will be stuck in b-side old school housing",
            "Author": "College Freshman",
            "Date": "2010-03-13T16:54:02.02Z"
        }
    ]
}