{
    "Overall%20Experience": [
        {
            "Rating": 1,
            "Review": "I was not paid well while I worked here. I was a math professor here and my yearly wage was around $40,000.",
            "Author": "Works Here",
            "Date": "2025-02-26T16:55:11.86055Z"
        },
        {
            "Rating": 1,
            "Review": "There are rats everywhere. Literally the same as a public college, there are no benefits besides the prestige.",
            "Author": "Senior",
            "Date": "2025-02-25T15:29:31.926518Z"
        },
        {
            "Rating": 5,
            "Review": "So far, my experience at Harvard University has been quite positive, especially in terms of the professors' teaching skills. They are highly engaging and knowledgeable, which has made my learning experience both enjoyable and enriching. However, one area where I believe improvements could be made is in providing housing for Harvard Extension School students. Many of us are part-time or working professionals who may not be local, and having accessible housing options would make a significant difference in supporting our academic journey.",
            "Author": "Graduate Student",
            "Date": "2025-02-18T01:13:24.350096Z"
        },
        {
            "Rating": 5,
            "Review": "Could not have hoped for a better college experience. Learned a lot, made lifelong friends, participated in extracurricular activities that still define my career and social life twenty years later.",
            "Author": "Alum",
            "Date": "2025-02-06T15:13:12.592229Z"
        },
        {
            "Rating": 5,
            "Review": "peak fiction trust trust ong ong ong ong ong ong ong ong ong ong ong ong ong ong ong ong ong ong ong ong ong ong ong ong ong",
            "Author": "Sophomore",
            "Date": "2025-02-03T17:52:45.968428Z"
        },
        {
            "Rating": 5,
            "Review": "This course aims to help individuals understand how power works and how to develop influence within their organizations and society. The course is six weeks long and requires about 6-7 hours per week. The course includes six modules:\n\n• Understanding the Nature of Power\n• Building Relational Sources of Power\n• Earning Trust and Exercising Influence\n• Encountering Entrenched Power\n• Leading Change in Organizations and Society\n• Managing Your Relationship to Power\n\nThe course teaches individuals how to gain influence, make an impact, avoid the pitfalls of power, build networks, and assess an organization's political landscape. It also focuses on developing influence skills to shift power dynamics, exercising power ethically, and holding the powerful accountable. The course is beneficial for early- and mid-career professionals, aspiring entrepreneurs, and nonprofit leaders. Upon completion of the course, participants earn a Certificate of Completion from HBS Online",
            "Author": "Alum",
            "Date": "2025-01-23T17:18:08.283435Z"
        },
        {
            "Rating": 5,
            "Review": "I have not had very many complaints about Harvard thus far. The professors are all great and the surrounding area is very nice to explore.",
            "Author": "Freshman",
            "Date": "2025-01-23T16:12:53.198014Z"
        },
        {
            "Rating": 5,
            "Review": "An amazing experience -- there are truly resources for every single field of interest, and especially for STEM-oriented majors, there comes the nearby company of MIT-cross registration opportunities. There are its cons that you'll find, but overall a very well-rounded institution.",
            "Author": "Junior",
            "Date": "2025-01-14T01:49:12.410739Z"
        },
        {
            "Rating": 1,
            "Review": "During my time at Harvard I found many of the professors didn’t care about me or the school. The money isn’t worth it and the school is very boring. I think being from NY, you’d be much better off attending SUNY Captain, just as good of school for a fraction of the price!",
            "Author": "Senior",
            "Date": "2025-01-06T17:45:41.297374Z"
        },
        {
            "Rating": 4,
            "Review": "Harvard University is one of the most prestigious and oldest institutions of higher learning in the world, located in Cambridge, Massachusetts. It is renowned for its rigorous academics, exceptional faculty, and a vibrant campus life. Here's an overview of the Harvard experience:\n\nAcademics\n\nHarvard offers a wide range of undergraduate and graduate programs, spanning fields like arts, sciences, law, medicine, business, and more. The university emphasizes critical thinking, innovation, and research, providing students access to state-of-the-art facilities and resources.\n\nCampus Life\n\nThe campus is rich in history and culture, featuring iconic landmarks like the Widener Library and Harvard Yard. Students participate in numerous extracurricular activities, including clubs, sports, and community service, fostering a well-rounded experience.",
            "Author": "Junior",
            "Date": "2024-12-27T19:17:56.215944Z"
        },
        {
            "Rating": 5,
            "Review": "I would like to see the way yall accept colleges change and I’m just stressed about my future because I’m looking for college",
            "Author": "Junior",
            "Date": "2024-12-18T14:14:18.011507Z"
        },
        {
            "Rating": 3,
            "Review": "Harvard University does not live up to what it should be. The supposed standard of academics is incredibly inapplicable to career skills.",
            "Author": "Junior",
            "Date": "2024-11-05T21:22:19.590777Z"
        },
        {
            "Rating": 5,
            "Review": "My experience at Harvard University has been intellectually stimulating and rewarding. The academics are top-notch, with access to brilliant professors and thought-provoking discussions that challenge and expand my thinking. The people I’ve met, both students and faculty, are diverse, driven, and passionate about making a difference, which creates a vibrant learning environment. \n\nThat said, the campus can feel quiet and even dead at times, especially on weekends, and the food is pretty average—nothing to get excited about. Overall, it's a great place for intellectual growth, though more student-life activities and better dining options would enhance the experience.",
            "Author": "Freshman",
            "Date": "2024-10-25T02:08:41.357328Z"
        },
        {
            "Rating": 5,
            "Review": "Truthfully, I've been having a great experience academically, but that's about it. It's a great place, but not as a Jew. I am stuck being online for classes because I don't feel safe to be on campus. I have high hopes for my transfer university though!",
            "Author": "Freshman",
            "Date": "2024-10-09T03:28:58.80715Z"
        },
        {
            "Rating": 4,
            "Review": "A great plus is that there is a wide variety of students to get to know, but mostly everyone sticks to their countries. Professors are taught very well and interestingly, the only minus is the amount of homework. In order to fix something on campus, the university is working very slowly. There are also very high prices in the district for everything which worsens the situation. The club system is very competitive.",
            "Author": "Freshman",
            "Date": "2024-10-02T19:09:10.065638Z"
        },
        {
            "Rating": 5,
            "Review": "I liked the experience at Harvard University. The campus was amazing and vibrant, and the student body was just for me. The professors were engaging, and I encourage people to apply to Harvard for a wonderful college experience.",
            "Author": "Other",
            "Date": "2024-09-03T15:25:01.328082Z"
        },
        {
            "Rating": 4,
            "Review": "Attending Harvard College has been an inspiring, challenging, and eye-opening experience. As a future dental school applicant, I’ve taken full advantage of the numerous opportunities to engage with the medical and dental fields both on campus and at Harvard School of Dental Medicine. I have also been fortunate to form meaningful connections with talented peers and professors who inspire me daily to work hard and pursue my goals and dreams, that is what I truly value the most about attending Harvard. As for changes I would like to see, I would like to see better access to mental health support and more inclusive dining options.",
            "Author": "Sophomore",
            "Date": "2024-08-26T13:27:55.119005Z"
        },
        {
            "Rating": 4,
            "Review": "Harvard University is so hilarious so that I want to study there.Their students in my point of view are so Happy to learn there, because of the fact that Harvard is the best place to get enough knowledge to work everywhere",
            "Author": "Graduate Student",
            "Date": "2024-08-25T20:05:32.785331Z"
        },
        {
            "Rating": 5,
            "Review": "Attending one of Harvard Business School's executive education programs was a profound learning experience. Harvard lives up to its reputation, and the Professors and learning environment were the best I have experienced. I wouldn't change anything as they pull out all of the stops to accommodate students worldwide.",
            "Author": "Other",
            "Date": "2024-08-24T14:54:41.604274Z"
        },
        {
            "Rating": 4,
            "Review": "I really love harvard it is a great university and hope it continues like that. Go harvard for the win",
            "Author": "Freshman",
            "Date": "2024-08-20T20:35:47.396846Z"
        },
        {
            "Rating": 5,
            "Review": "I love their nacho baked bean dip. Best dip…….. life changing dip. Must attend school mainly for the bean dip. :)",
            "Author": "Freshman",
            "Date": "2024-08-15T03:23:22.968018Z"
        },
        {
            "Rating": 5,
            "Review": "Definitely a good campus to be around during any academics. The opportunity to engage with distinguished faculty and collaborate with driven peers can be incredibly inspiring. Additionally, Harvard's expansive network and global influence provide valuable connections and opportunities that extend well beyond the campus. Further I had like them to Enhance affordability and provide more robust financial aid could help make a Harvard education available to a broader range of talented individuals.",
            "Author": "Graduate Student",
            "Date": "2024-08-13T20:27:30.108881Z"
        },
        {
            "Rating": 5,
            "Review": "I was a summer school student at harvard univesity. It was my first time living alone for a month on campus - it changed my perspective on many aspects of life. Harvard taught me independency, but not only that it put me in the open world. I met incredible people, took part in community building activites and got to leave every class feeling rewarded. My experience goes beyond words and it truly brings me joy to stay there.",
            "Author": "Other",
            "Date": "2024-08-11T22:35:39.114507Z"
        },
        {
            "Rating": 5,
            "Review": "I love Harvard. The people are incredible and kind. My professors are caring and well atuned to students needs.",
            "Author": "Sophomore",
            "Date": "2024-07-30T05:05:21.593048Z"
        },
        {
            "Rating": 5,
            "Review": "I was such a really good study with easy steps and final success. \nHarvard University is renowned for its academic excellence, diverse opportunities, influential alumni network, extensive resources, and distinguished faculty. However, it is also known for its high cost, competitive and stressful environment, ongoing efforts to improve diversity and inclusion, and sometimes cumbersome administrative processes.\nOverall, Harvard offers a rich and rewarding experience but also presents challenges typical of elite institutions.",
            "Author": "Graduate Student",
            "Date": "2024-07-28T06:54:50.498556Z"
        },
        {
            "Rating": 5,
            "Review": "My overall experience with Harvard University has been immensely enriching and transformative. The rigorous academic environment challenged me to think critically and expand my intellectual horizons, while the diverse and talented student body provided a stimulating atmosphere for thought-provoking discussions and lasting friendships. Access to world-renowned faculty and extensive resources, from libraries to research facilities, allowed me to deeply pursue my academic interests. Extracurricular opportunities aligned with my passions further enriched my experience.",
            "Author": "Freshman",
            "Date": "2024-07-20T05:13:37.246726Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard is a transformational experience from the very first day. I thought that I had a pretty solid perspective of the world following my military service, however, Harvard’s exposure to the real world and the abundant opportunities it offers is remarkable. This is a college experience I wouldn’t trade for anything.",
            "Author": "Sophomore",
            "Date": "2024-07-18T13:05:55.934489Z"
        },
        {
            "Rating": 5,
            "Review": "My time at Harvard University was truly an incredible experience. From the moment I stepped onto campus, I was struck by the intellectual energy and vibrancy of the community. The professors were brilliant, challenging us to think critically and push the boundaries of our knowledge. I loved the small, seminar-style classes where I could engage in deep discussions with my classmates - people from such diverse backgrounds who each brought unique perspectives to the table.\n\nThat said, Harvard wasn't without its challenges. The workload was intense, and I sometimes struggled to maintain a healthy work-life balance. The university could do more to support student mental health and wellbeing, like better access to counseling services, more wellness programming, etc.\n\nBut overall, my experience at Harvard was truly transformative. The knowledge and skills I gained have been invaluable, and the connections I made will continue to benefit me long after graduation.",
            "Author": "Other",
            "Date": "2024-07-12T20:07:46.731421Z"
        },
        {
            "Rating": 5,
            "Review": "Overall, this place is what you make of it. There are a lot of opportunities for research and extracurriculars if you apply yourself.",
            "Author": "Alum",
            "Date": "2024-06-09T15:52:12.286956Z"
        },
        {
            "Rating": 4,
            "Review": "Harvard is what it is. You can find your people but it does take some time. There is heavy classism but that is inherent to the school",
            "Author": "Sophomore",
            "Date": "2024-05-19T19:27:02.268916Z"
        },
        {
            "Rating": 5,
            "Review": "I am still trying to pay for the courses to get my graduate certificate in finance and accounting. So far my experience has been wonderfful.",
            "Author": "Other",
            "Date": "2024-05-17T14:28:57.19522Z"
        },
        {
            "Rating": 4,
            "Review": "No university is perfect, but I genuinely had a pretty good time at Harvard, with it being my first year.",
            "Author": "Freshman",
            "Date": "2024-05-13T21:15:53.747133Z"
        },
        {
            "Rating": 4,
            "Review": "Receiving lectures from world class professors that are experts in their respective fields is a privilege that I have been grateful for at my time here at Harvard.",
            "Author": "Senior",
            "Date": "2024-04-27T01:10:19.520944Z"
        },
        {
            "Rating": 5,
            "Review": "This is where artist Ryan Leslie went to school and graduated with a perfect SAT. So, it was a school that I always looked into for online business.",
            "Author": "Sophomore",
            "Date": "2024-04-17T20:25:39.172552Z"
        },
        {
            "Rating": 5,
            "Review": "Attending Harvard College was transformative. The housing system fostered a strong sense of community, facilitating academic support and social interaction. The rigorous academics, led by renowned faculty, challenged me to think critically and pursue my interests. Harvard's commitment to diversity enriched my experience, and the vibrant location in Cambridge provided endless opportunities for exploration and growth. Harvard College offered an unparalleled experience that has left an indelible mark on my life.",
            "Author": "Alum",
            "Date": "2024-03-24T21:59:48.356974Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard College is a big enough school where you will always meet new people, but simultaneously small enough that you will begin to recognize the faces. I was pleasantly surprised at the number of people who were so willing to step up and help, and did not have any \"ego\". There are plenty of motivated and passionate people, and enough student groups that everyone can find a place they feel welcome in the college.",
            "Author": "Alum",
            "Date": "2024-03-04T01:31:02.986602Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard University is a bastion of tradition in truly the best ways.  Pomp and circumstance means a lot, pride in its history is second to none, but the focus on the future is admirable.  They value all input and opinions and seek to elevate all students, encouraging them to recognize their true potential.",
            "Author": "Alum",
            "Date": "2024-02-22T20:05:22.287785Z"
        },
        {
            "Rating": 5,
            "Review": "Great experience at Harvard so far! The people you meet are truly the best part, students and professors.",
            "Author": "Freshman",
            "Date": "2024-02-20T21:54:26.394676Z"
        },
        {
            "Rating": 4,
            "Review": "Harvard is an extremely supportive bubble that makes it incredibly easy to transition into college life. However, I've found the academics to be disappointing and clubs to be unnecessarily competitive and stressful.",
            "Author": "Freshman",
            "Date": "2024-01-14T22:53:40.578426Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard University offered an unparalleled academic environment, fostering intellectual growth. The esteemed faculty and diverse student body enriched my learning. However, addressing accessibility concerns and enhancing campus inclusivity could improve the overall experience.",
            "Author": "Freshman",
            "Date": "2024-01-08T06:56:49.091825Z"
        },
        {
            "Rating": 2,
            "Review": "Harvard had amazing public relations and was very lucrative for me. As a minority, Harvard is far from safe. Dirty looks and microaggressions are all over the place, and I can't see myself at Harvard. My friends (who are minorities as well) feel the same. Harvard has become hostile and aggressive over the years. I think that things are worse than in the past. The education here is neither worse nor better than the average community college I've been to. Nothing is exciting at Harvard anymore. It's not worth the money or the effort to get it. Get your education, but not at Harvard.",
            "Author": "Graduate Student",
            "Date": "2023-12-10T06:58:05.185979Z"
        },
        {
            "Rating": 5,
            "Review": "I love it so much! I recommend you come here, school was very affordable for me and the housing is good. I love my professors and the campus is beautiful.. 10/10",
            "Author": "Junior",
            "Date": "2023-12-06T18:42:24.17943Z"
        },
        {
            "Rating": 4,
            "Review": "The culture of exclusivity is irritating. The main social aspect is final clubs, which are prestigious and elite and selective institutions. Everything requires an application, often times many rounds of applications. However, the academics and certain extracurriculars can be very rewarding.",
            "Author": "Sophomore",
            "Date": "2023-11-28T18:55:12.148782Z"
        },
        {
            "Rating": 5,
            "Review": "I like the way Harvard University makes education affordable for the poor.\n\nHarvard costs what your family can afford. They make sure of that. If your family's income is less than $85,000, you'll pay nothing. For families who earn between $85,000 and $150,000, the expected contribution is between zero and ten percent of your annual income.\n\nHarvard is more affordable than public universities for 90 percent of Americans—and international students receive the same financial aid as American students. Harvard makes sure that they have an affordable option for your education.\n\nThey follow two important principles:\n1) Need-blind admissions. Your financial need and your aid application will never affect your chance of being admitted to Harvard.\n2) 100% need-based aid. They base aid awards on need, not on merit. This means that financial aid supports the students who will benefit from it the most. Furthermore, they meet 100 percent of their student's demonstrated financial need.",
            "Author": "Other",
            "Date": "2023-11-08T02:05:14.968008Z"
        },
        {
            "Rating": 5,
            "Review": "Life changing, difficult, highest highs, a few lows. Find your people here and learn something outside your major because everyone here is special.",
            "Author": "Senior",
            "Date": "2023-10-23T02:50:01.309354Z"
        },
        {
            "Rating": 3,
            "Review": "I feel like harvard is a great school for networking post graduation however the financial support from the school is horrendous and it is hard to provide for oneself through these “endeavors”",
            "Author": "Junior",
            "Date": "2023-10-22T18:33:10.286322Z"
        },
        {
            "Rating": 1,
            "Review": "From the moment I stepped onto campus, I've encountered one problem after another. The first and most significant issue is the rampant rat infestation, which has affected everything. These rodents run rampant, and it's impossible to get a good night's sleep with their incessant noise and fear of them crawling on you as you sleep. It's a constant battle to keep them out of your personal space. The food situation is equally dismal. The dining halls are plagued by unsanitary conditions, with rats scurrying around openly. It's impossible to enjoy a meal without worrying about contamination. The quality of the food itself is subpar. But perhaps the most disheartening aspect of my college experience is the teaching staff. I've had the misfortune of encountering a series of unqualified and disinterested professors. It's apparent that they lack the enthusiasm and expertise required to provide a quality education. Their disengagement only exacerbates the frustration and disappointment I feel.",
            "Author": "Freshman",
            "Date": "2023-10-20T19:37:26.982341Z"
        },
        {
            "Rating": 5,
            "Review": "Amazingly transformative, you're classmates will be the best part of the experience as you learn in this environment with the most talented in the world.",
            "Author": "Freshman",
            "Date": "2023-10-02T03:04:01.829526Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard University is widely recognized for its prestigious reputation, outstanding faculty, and extensive resources. Many students and academics appreciate its commitment to academic excellence, research opportunities, and its historic campus in Cambridge, Massachusetts.",
            "Author": "Senior",
            "Date": "2023-10-01T10:23:34.521384Z"
        },
        {
            "Rating": 4,
            "Review": "Professors are passionate about their work and everything you learn in the classroom is clearly applicable in real life.",
            "Author": "Alum",
            "Date": "2023-09-12T05:19:59.139094Z"
        },
        {
            "Rating": 4,
            "Review": "Harvard's campus is a testament to its long and storied history. The iconic red-brick buildings, picturesque courtyards, and the charming Harvard Yard provide an environment that is steeped in tradition. Walking through the campus feels like a journey through time, as you pass by the hallowed halls that have hosted generations of scholars, thinkers, and leaders. The sense of history and academic heritage is palpable, making every corner of the university feel like a museum of knowledge.",
            "Author": "Junior",
            "Date": "2023-09-09T16:00:44.865349Z"
        },
        {
            "Rating": 5,
            "Review": "Cheerful community. Great education. Great accommodation. Lovely area! One of the most happiest csmpuses I've seen.",
            "Author": "Other",
            "Date": "2023-09-08T08:29:22.970248Z"
        },
        {
            "Rating": 5,
            "Review": "It’s Harvard. Enough said. But apparently there is a minimum number of characters so I’ll keep writing unt",
            "Author": "Graduate Student",
            "Date": "2023-09-07T18:06:45.924187Z"
        },
        {
            "Rating": 4,
            "Review": "Fabulous school with great resources and alumni network second to none around the world. I graduated in the 90ies and met some great people and professors during my undergraduate years. \n\nWhy four stars? It really wasn’t the right school for me, I should have gone to an engineering or more pre professional school. It’s just my outlook and ethic. I had other great options but got swept away by the name. \n\nOver the years I feel very disconnected from the DEI and overwhelmingly liberal outlook of its professors. My kids certainly aren’t applying.",
            "Author": "Alum",
            "Date": "2023-09-07T12:18:19.238022Z"
        },
        {
            "Rating": 5,
            "Review": "Established in 1636, Harvard is the oldest higher education institution in the United States, and is widely regarded in terms of its influence, reputation, and academic pedigree as a leading university in not just the US but also the world.",
            "Author": "Freshman",
            "Date": "2023-08-22T14:29:43.252222Z"
        },
        {
            "Rating": 4,
            "Review": "Harvard was great. The professors, friends, alumni, parents, staff, and faculty were all nice, ambitious, schooled, classy, educated, stubborn people who have become my lifelong friends.",
            "Author": "Freshman",
            "Date": "2023-08-17T02:23:14.028983Z"
        },
        {
            "Rating": 5,
            "Review": "Studying at Harvard has been my lifelong dream, and I see it fulfilled at the moment, with the many memorable learning experiences I have had so far. From a well-organized curriculum, to impressive response time to student inquiries, and then to proper student welfare facilities, I give kudos to this noble institution of learning. I would rate Harvard an A+ so far. Thank you Harvard!",
            "Author": "Graduate Student",
            "Date": "2023-07-23T01:14:16.45579Z"
        },
        {
            "Rating": 5,
            "Review": "My first year at Harvard was definitely an amazing and humbling experience. A lot of people have an image of Harvard as this magnificent untouchable castle on a hill, but being there and meeting the students and taking classes taught me it is actually just a place full of wonderfully talented individuals who are all so passionate and I'm so glad and privileged that I get to attend this school.",
            "Author": "Sophomore",
            "Date": "2023-07-16T16:02:34.174521Z"
        },
        {
            "Rating": 4,
            "Review": "Harvard University is an extraordinary school, it has many courses/majors that are unlike anywhere else.",
            "Author": "Freshman",
            "Date": "2023-07-09T03:03:38.522945Z"
        },
        {
            "Rating": 5,
            "Review": "I like that my program is very flexible. Also, I study development and I thought the courses wouldn’t criticize the system freely but they do and I love that. There is a lot of critical thinking.",
            "Author": "Graduate Student",
            "Date": "2023-07-02T23:02:06.362725Z"
        },
        {
            "Rating": 5,
            "Review": "Wonderful professors, extremely helpful resources such as the writing center, tech support lines, libraries and student support staff.",
            "Author": "Other",
            "Date": "2023-06-28T04:35:48.144831Z"
        },
        {
            "Rating": 5,
            "Review": "This was a great experience for me that I have take the online course from worlds best university where I found the best instructors.",
            "Author": "Other",
            "Date": "2023-06-28T03:48:36.461779Z"
        },
        {
            "Rating": 5,
            "Review": "At least, from my experience, I believe harvard provides all the resources to learn the material. Some classes are rigorous, but most professors/TF are willing to explain these topics again during office hours/sections and additional office hours ran by TFs",
            "Author": "Junior",
            "Date": "2023-06-27T21:55:17.156807Z"
        },
        {
            "Rating": 3,
            "Review": "In my opinion, while there are a lot of good things about Harvard, there are a decent number of cons as well. \n\nI'll start off with the good: wonderful students, great access to resources, culture and atmosphere to succeed\n\nAs for the bad: very poor social life, no real focus on mental health besides some copy paste emails and reminders that a clinic exists (they do what they can to make it seem like they care), very closed-off (while you have access to a plethora of resources you have to really go out there yourself and be able to do things fully independently without anyone telling you what you actually have access to guide you).",
            "Author": "Sophomore",
            "Date": "2023-06-27T06:02:56.490311Z"
        },
        {
            "Rating": 5,
            "Review": "Nothing it was amazing. The people were so kind and welcoming, they gladly answered all my questions.",
            "Author": "Other",
            "Date": "2023-06-26T05:31:05.325605Z"
        },
        {
            "Rating": 2,
            "Review": "Harvard University uses a largely outdated education system style with an emphasis on grades and GPA rather than actual learning or applicability.",
            "Author": "Junior",
            "Date": "2023-06-23T17:04:51.085261Z"
        },
        {
            "Rating": 5,
            "Review": "If you're looking for top-notch education with a dash of fun and a sprinkle of diversity, Harvard's your place. The courses? Outstanding. From humanities to sciences, you've got a smorgasbord of choices led by seriously brilliant professors.\n\nBut the real magic of Harvard lies in the students. They're from all over the world, bringing a riot of perspectives that makes every class discussion buzz with energy. It's like a global village where you learn as much from your mates as your textbooks.\n\nAnd it's not all study, either. There's plenty to do outside the lecture halls. Join a club, get sporty, or just hang out on the gorgeous campus - there's never a dull moment. Harvard's not just a university, it's a vibrant and stimulating experience.",
            "Author": "Other",
            "Date": "2023-06-22T16:31:18.401491Z"
        },
        {
            "Rating": 5,
            "Review": "As a Harvard student, I can say that the overall experience at the university is truly unique and unforgettable. Harvard offers a rigorous academic experience that challenges students to think critically and deeply about a wide range of subjects, from the humanities to the sciences to the social sciences. The faculty are world-renowned experts in their fields and provide students with unparalleled opportunities to learn from and collaborate with them.\n\nThe residential system at Harvard is also a major part of the overall experience. Living in a House with other students from diverse backgrounds and interests allows for the formation of close-knit communities and lifelong friendships. These communities foster personal growth and intellectual exploration, as well as provide support and encouragement throughout one's time at Harvard.",
            "Author": "Other",
            "Date": "2023-06-17T19:22:59.045028Z"
        },
        {
            "Rating": 5,
            "Review": "Great professors who are ready to help their students in any way they can. Diverse, interesting and very educational courses. Diverse students body.",
            "Author": "Sophomore",
            "Date": "2023-06-17T13:48:50.815146Z"
        },
        {
            "Rating": 4,
            "Review": "Tons of great people, amazing academic resources, and unparalleled opportunities for extracurriculars. The culture can be competitive - after all, with so many top students in one place, what else? - but I've still managed to meet amazing people and learn so much more than I thought I ever would.",
            "Author": "Freshman",
            "Date": "2023-06-15T16:49:20.259246Z"
        },
        {
            "Rating": 4,
            "Review": "I have loved my experience at Harvard so far and am looking forward to the rest of it. For those that have some level of allergies, I do encourage you to reach out to the DAO because unfortunately there can be a lot of cross contamination and often more so than not the dining halls do not label what is in foods. But there's an immense amount of support, opportunities, and a myriad of ways to elevate your college experience for your future.",
            "Author": "Sophomore",
            "Date": "2023-06-10T17:51:28.855065Z"
        },
        {
            "Rating": 4,
            "Review": "It is an amazing school. The people on campus are such a diverse, welcoming community that I have never expected to meet.",
            "Author": "Sophomore",
            "Date": "2023-06-02T19:31:36.400989Z"
        },
        {
            "Rating": 5,
            "Review": "I have loved it so far! I have met so many amazing people, including my future roommates (there are 7 of us!) and my teammates. I played on the Women's Rugby team this past year and had a phenomenal time. We came 2nd in Nationals and 3rd in 7s Nationals. Furthermore, the professors have been excellent and incredibly engaging. I feel so privileged to be at Harvard. I am so grateful to call it home",
            "Author": "Sophomore",
            "Date": "2023-05-26T02:49:24.287802Z"
        },
        {
            "Rating": 5,
            "Review": "I am currently attending school Harvard Extension for the summer of 2023 and so far, my experience has been good because of the people that I meet, they are helpful in showing me places to go. The thing that I would change is nothing",
            "Author": "Freshman",
            "Date": "2023-05-11T20:27:30.302868Z"
        },
        {
            "Rating": 4,
            "Review": "The quality of education is very high, but the campus culture and administration could do more for students",
            "Author": "Sophomore",
            "Date": "2023-03-30T18:08:13.315164Z"
        },
        {
            "Rating": 5,
            "Review": "Excellent community and excellent memories. Broke down several pre-conceived notions I had about education.",
            "Author": "Alum",
            "Date": "2023-03-08T04:38:36.711039Z"
        },
        {
            "Rating": 2,
            "Review": "In addition to its wealth, Harvard’s prestige derives from its research faculty and undergraduate success post graduation. Neither of these factors are indicators of education quality. For example, faculty are uninterested in teaching, so Harvard outsources the bulk of this work to underpaid lecturers or graduate students. On the other hand, undergraduate success is correlated with pre-existing class, racial, and gender hierarchies. Having graduated from Harvard and taught at several other universities (public and private), I am confident that many other places do it better. Harvard gets too much credit for what it does not do because, as others have said, it is a social club pretending to be a center of undergraduate learning. The curriculum fails to deliver a knowledge base across disciplines because it is too niche. Finally, the student body is less academically inclined than you might think because Harvard prioritizes the extracurricular achievements of the upper-middle class.",
            "Author": "Alum",
            "Date": "2023-03-02T05:32:00.307432Z"
        },
        {
            "Rating": 5,
            "Review": "To be a student at Harvard and to enable you complete your course, you need to be more than smart. You need to be very passionate about your line of study. With every student having different ideas, it is a wonderful interactive place for brilliant minds with a great future. There is great student support and depending on how outgoing a person is, you can make plenty of friends.\nThere is actually plenty to do in and around Harvard, and it all comes down to how you divide your time. Good time management enables one to 'work and play.'",
            "Author": "Graduate Student",
            "Date": "2023-01-28T11:24:38.875005Z"
        },
        {
            "Rating": 1,
            "Review": "An old boys club masquerading as a university. Support is non existent. Depression and suicidal thoughts are common especially among working class students and first gen students. If you are not with the in crowd, you feel like an outcast and slowly spiral downwards. Wasting four years of my life at the lie that I was sold is possibly the biggest regret of my life. I wouldn't send my own kids here.",
            "Author": "Alum",
            "Date": "2023-01-27T21:47:11.06015Z"
        },
        {
            "Rating": 4,
            "Review": "Obviously the most famous university draws attention worldwide, and I can't argue that I don't get a good return on my investment. However, if you don't get in, you can still have a good college experience somewhere else, and Harvard is lacking in many things, such as quality of food and dorms.",
            "Author": "Junior",
            "Date": "2023-01-23T17:01:48.645778Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard truly stands alone in its culmination of resources and exposure! When you leave the institution, if done correctly, you'll leave with resources to prepare you for the job market, which makes the investment worth it!",
            "Author": "Senior",
            "Date": "2023-01-19T20:00:03.159866Z"
        },
        {
            "Rating": 3,
            "Review": "It is not as nice and as great as everyone makes it out to be but it is still a good place to go for an education",
            "Author": "Sophomore",
            "Date": "2023-01-17T12:27:00.00338Z"
        },
        {
            "Rating": 5,
            "Review": "I'm still a freshman, so I haven't been there for that long. What I can say about it is the experience is what you make of it. There's so much information within the school that is hard to find, but having a supportive network makes it easier.",
            "Author": "Freshman",
            "Date": "2023-01-16T06:16:30.642106Z"
        },
        {
            "Rating": 5,
            "Review": "Great environment with great professors! I have really enjoyed the classes I've taken thus far. I would recommend attending for all that are interested in social sciences.",
            "Author": "Freshman",
            "Date": "2022-12-08T19:02:35.027154Z"
        },
        {
            "Rating": 5,
            "Review": "Academics are great, but have not found them to be the most memorable part of my time here. Harvard's housing and dining system is one of a kind, and has helped develop such a strong community that makes me feel at home. The school (though often stingy with their finances) does have a lot of resources to take advantage of, and the student groups on campus provide a great artistic and social environment.",
            "Author": "Sophomore",
            "Date": "2022-11-26T04:24:52.131258Z"
        },
        {
            "Rating": 4,
            "Review": "There is no shortage of resources or support here. The faculty are phenomenal and allow you to think critically, creatively and chart your own path.",
            "Author": "Graduate Student",
            "Date": "2022-11-05T23:21:27.376119Z"
        },
        {
            "Rating": 4,
            "Review": "Great academics and resources, professors are amazing. Social aspect might use some work. Transportation is easy and campus is beautiful. Too many tourists.",
            "Author": "Niche User",
            "Date": "2022-10-27T19:41:41.198571Z"
        },
        {
            "Rating": 5,
            "Review": "I love my experience at Harvard. People are very supportive and everyone is motivated to learn. The community is the best part about the school -- you're pushed because you're surrounded by the best minds both in students and faculty.",
            "Author": "Freshman",
            "Date": "2022-10-26T04:18:54.349246Z"
        },
        {
            "Rating": 5,
            "Review": "It is literally everything you hear about. It is so wonderful and the people here are simultaneously such amazing humans and also so incredibly passionate and wonderful. I was intimidated at first that it wouldn't feel like a correct fit for me or that it would be too pretentious, but that was quickly dispelled upon moving in and realizing that everyone here is just a beautiful person.",
            "Author": "Freshman",
            "Date": "2022-10-17T02:00:03.586023Z"
        },
        {
            "Rating": 5,
            "Review": "I attend the extension school online. The value I receive in my education is wonderful and I am so thankful to have the opportunity.",
            "Author": "Junior",
            "Date": "2022-10-09T04:15:26.757601Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard university is very top notched university with some of the best qualified tutors in the world.",
            "Author": "Niche User",
            "Date": "2022-08-26T15:12:32.858348Z"
        },
        {
            "Rating": 5,
            "Review": "Everything I could have asked for. Campus is easy to navigate and welcoming. Classes are collaborative and professors have many opportunities outside of class for extra help and office hours. Part of the social culture is studying so you are never choosing between friends or academics. The teaching teams understand and value your passions outside of academia and are very willing to work around extracurricular activities.",
            "Author": "Sophomore",
            "Date": "2022-08-22T22:42:56.969605Z"
        },
        {
            "Rating": 5,
            "Review": "The online process is easy to navigate. The main benefit is that I can go to class and prove that I am a good student.",
            "Author": "Freshman",
            "Date": "2022-07-29T03:25:32.272762Z"
        },
        {
            "Rating": 3,
            "Review": "This university has a wealth of resources but they are extremely hard to access, especially if you are first-gen, low-income, a person of color, queer, disabled, neurodivergent, or exist with any other marginalized identity.",
            "Author": "Junior",
            "Date": "2022-07-14T16:08:20.396037Z"
        },
        {
            "Rating": 4,
            "Review": "The opportunities are unmatched! There are always amazing people and things to learn from. There are many ways to get involved with a diverse array of things, and the people have been really kind in my experience.",
            "Author": "Freshman",
            "Date": "2022-07-05T21:14:05.111507Z"
        },
        {
            "Rating": 3,
            "Review": "Some people have astronomical egos and believe that they're gods gift to the world because they got into Harvard; when in reality you find out that their good ol pops donated three buildings to the school. Food is okay I like the ramen shop but stay away from the pizza places near campus! I felt comfortable walking alone at night.",
            "Author": "Sophomore",
            "Date": "2022-06-30T23:16:10.246877Z"
        },
        {
            "Rating": 2,
            "Review": "Great academics with a variety of concentrations, classes, and world-renowned professors. Great extracurricular life and the ability to network with alumni, staff, and other students to reach your goals career-wise. However, this institution falls flat when it comes to social life. This university runs on exclusivity, especially with final clubs which are honestly just fancy fraternities and sororities which run on exacerbating class and racial differences. Additionally, there is little support for marginalized communities from Harvard, with LGBT events getting very little traction. The social groups come across as very cliquish — if you don’t make friends fast, it is very hard to get into a social group and connect with other people so you may feel lonely. The dining hall food is lackluster while the dining hall hours and locations are abysmal. The housing concept is great, but there’s very little community in the houses which makes it hard to connect with other students. Overrated!",
            "Author": "Junior",
            "Date": "2022-06-29T21:31:06.455056Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard Campus is busy with tourists. No parking. All off campus students take public transport. Academics are as great as you can imagine. Despite what data says, 85% of the population by eye is White or Asian, in my opinion. Professors are incredible. I can not speak on ROI due to my tuition being ~$0. I also stay off campus. Public transportation is tolerable.",
            "Author": "Sophomore",
            "Date": "2022-06-29T21:31:05.098097Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard is a place where you can make the experience whatever you'd want it to be. Find your group, explore your passions, and be ready to go anywhere in the world after graduating.",
            "Author": "Alum",
            "Date": "2022-06-23T23:14:57.056375Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard is an outstanding institute that offers high-quality top-class education. With convenient lecture rooms equipped with advanced technologies and scholars who are leading authorities in their fields, it is incomparable to any other institute. The environment is great, offering the best care and services to students coming from every region of the world. Havard university is the greatest thing that ever happened to me.",
            "Author": "Graduate Student",
            "Date": "2022-05-24T19:16:53.949192Z"
        },
        {
            "Rating": 5,
            "Review": "Professors have a wide range of experience to learn from. Other students, spread around the world, do as well. \nCourses are challenging but interesting.",
            "Author": "Graduate Student",
            "Date": "2022-05-24T01:40:06.17645Z"
        },
        {
            "Rating": 5,
            "Review": "Meet a great diverse group of people and learn much more than you expected. Plus the name doesn't hurt!",
            "Author": "Senior",
            "Date": "2022-05-23T21:21:38.322238Z"
        },
        {
            "Rating": 4,
            "Review": "Harvard is a place where you'll meet some really interesting and really intelligent people. The workaholic culture can be pretty draining, but it's a good place to be.",
            "Author": "Junior",
            "Date": "2022-05-23T05:34:01.314941Z"
        },
        {
            "Rating": 5,
            "Review": "At Harvard, I've really found a community that is so welcoming. People join for the academics, for the prestige, for the opportunities, but we stay for the people that we meet. Whether it is our fellow students, or our TFs, or even the professors that we meet, everyone is so helpful and community-oriented, ready to help you succeed in whatever you aspire to do.",
            "Author": "Sophomore",
            "Date": "2022-05-18T20:11:24.514828Z"
        },
        {
            "Rating": 5,
            "Review": "I love being here! So many opportunities and the people are much nicer and more humble than you expect them to be. The arts are really enjoyable as well.",
            "Author": "Sophomore",
            "Date": "2022-05-15T16:51:20.38255Z"
        },
        {
            "Rating": 4,
            "Review": "The best thing about being harvard, its the privilege everyone has to be in one of the best schools of the world. Teachers are great",
            "Author": "Junior",
            "Date": "2022-04-24T02:23:21.746786Z"
        },
        {
            "Rating": 4,
            "Review": "It is a pretty great school and it teaches beyond about a variety of subjects.It helps students get ready for their career,",
            "Author": "Niche User",
            "Date": "2022-04-01T12:49:33.567662Z"
        },
        {
            "Rating": 4,
            "Review": "You really learn a LOT from the people around you, you are constantly surrounded by people who know so much about a specific field and who are eager to apply their knowledge and learn more. Some professors are extremely good teachers, and care a lot about their students. However, some professors are just not meant to be teachers, they are brilliant people in their fields, but they aren't good teachers.",
            "Author": "Sophomore",
            "Date": "2022-03-17T18:29:52.996952Z"
        },
        {
            "Rating": 5,
            "Review": "Its been a really great program. Great resources. The campus is beautiful tooo! The campus is big so u need a bike.",
            "Author": "Alum",
            "Date": "2022-02-26T03:14:47.199363Z"
        },
        {
            "Rating": 5,
            "Review": "This is a top-ranked university for a reason. Students are surrounded by inspiring peers and teachers. Lots and lots of student support.",
            "Author": "Alum",
            "Date": "2022-01-27T12:12:02.123255Z"
        },
        {
            "Rating": 4,
            "Review": "A very dynamic, multifaceted community, full of opportunities to engage with people of ideas of diverse backgrounds, professors of the highest caliber, amidst a bustling, historic city.",
            "Author": "Alum",
            "Date": "2022-01-02T03:37:41.802798Z"
        },
        {
            "Rating": 5,
            "Review": "Just like anything else, Harvard is what you make it. So attending doesn't mean automatic success, but if you try, you have just about as good a chance of reaching your dreams as you do anywhere else. There is certainly no lack of resources, and I always feel taken care of as a student and individual.",
            "Author": "Sophomore",
            "Date": "2022-01-02T01:04:07.311243Z"
        },
        {
            "Rating": 5,
            "Review": "The Harvard University campus is extremely safe. I always felt comfortable walking around, even very late in the evenings and very early in the mornings. There are security guards who walk around the campus, and almost all the gates are closed in the evenings, other than a few main entrances. There are reliable, frequent shuttles, and there are multiple apps for real-time schedules and routes! The campus itself is based in Cambridge, so it is relatively urban, but I always felt very secure.",
            "Author": "Freshman",
            "Date": "2021-12-31T21:34:59.154303Z"
        },
        {
            "Rating": 5,
            "Review": "I haven't actually started in Harvard because I'm a transfer student but as far as I've seen, Harvard is a great school to go to. Nearly everything is top-notch (I said 'nearly' because nothing is perfect in this world). Harvard is diverse and I hope you will meet nice people there even though i can't guarantee everyone is nice there.\nHowever, concerning your academics, it might look tedious at the start but as you get more into it and make friends as well as an academic plan and a good schedule, you'll find out that its not as tiring as you felt it was.",
            "Author": "Junior",
            "Date": "2021-12-31T10:12:44.692741Z"
        },
        {
            "Rating": 4,
            "Review": "Make sure to do your research before deciding to apply or committing. Definitely a lot of prestige, resources, and amazing people. However, as an inner city kid from the midwest, the east coast, especially Boston, was sort of a culture shock. Social life is not as prominent as it is at other schools because academics and athletics definitely dominate the  scene. Boston is definitely a college CITY. With so many colleges in a 10 mile radius you only see college study out and about. Overall a very eye opening experience, just make sure to visit and be sure that this is what you seek in your college experience!",
            "Author": "Sophomore",
            "Date": "2021-12-30T21:31:57.425516Z"
        },
        {
            "Rating": 5,
            "Review": "There are endless opportunities for students at Harvard. I have made some of the greatest friendships with alumni, professors, and students. This university allows me to branch out into the person that I wish to become. Attending a place like Harvard opens my eyes to the many different backgrounds people orginate from. There is immense culture and knowledge shared between students.",
            "Author": "Sophomore",
            "Date": "2021-12-17T02:18:31.988765Z"
        },
        {
            "Rating": 5,
            "Review": "I took an online course with Harvard Business School Online and it was an amazing experience for a former homeschooler.\nI've only taken one course so far, but I wish to take several more in the near future.\n\nAllowing anyone over the age of 18 and providing knowledge to anyone out of high-school, the course provided me with eye-opening and inspirational education early on in my life that I've been able to take with me to further my education, to work with, as well as to use at home. \n\nI loved the interactive learning experience, the short interviews with experts of several fields, and I most of all liked the case studies. \n\nI can't say there was anything I didn't like.. about the school itself. \nThe only thing was some of the peer exercises. Some required students to interact with other students, and then to receive peer feedback. However, often times, I never did receive feedback.\n\nBesides that, everything else was fantastic.",
            "Author": "Niche User",
            "Date": "2021-11-22T08:54:43.852321Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard is considered the best for a reason. The experience was, in a word, magical. The students and professors are great, but the pressure and competitiveness do get to you.",
            "Author": "Alum",
            "Date": "2021-11-18T20:30:42.080437Z"
        },
        {
            "Rating": 5,
            "Review": "I came to Harvard as an advanced graduate student after experiences ranging from the University of Washington to German Universities includin Freiburg in the Black Forest, Tübingen, and Münster.\nHarvard distinguishes itself in the quality of fellow students, first, then a fine assortment of expert professors and a wondrous library and extensive museums.  Incoming students must plan their time carefully or risk missing one of the world's top cultural sites.  That said, a scholarly education is incomplete without experiences in other lands, where notions of team sports do not compete with university identities.  Find the best world-class professors in your areas of interest and go to them.  Stay as long as it takes to satisfy yourself.",
            "Author": "Alum",
            "Date": "2021-10-28T13:30:58.52579Z"
        },
        {
            "Rating": 1,
            "Review": "Havard is not a place for people who come from different backgrounds. Everyone is the same living off daddy's money and it is hard to get a job after you study here.",
            "Author": "Niche User",
            "Date": "2021-10-14T13:10:21.241565Z"
        },
        {
            "Rating": 1,
            "Review": "After attending Harvard and #1 being discriminated to the highest level by being locked out of my zoom for a course I payed for by the teacher Patricia Bellanca  and Dean Robert Neugenboren with no one answering emails, setting calls, nor the XXI, diversity, disabilities and admissions directors stepped in being cc’d from day 1 on the teachers misconduct, these are not responsible professionals these are bulling student tactics that are illegal and sexist. Also as a masters student you pay a higher tuition then everyone else yet share a class with sophomores in high school, associates, and bachelors levels. This is a ivy league lawsuit, scam, fraud. I had to dispute my tuition after the teacher claimed I had a neurological issue yet my other course I was asked to guest speak with effortless A. I would advise Harvard is not a safe nor credible school to attend. Educational abuse, deny student education, unsafe , discriminate, slander and poor mental health,writing and center help.",
            "Author": "Graduate Student",
            "Date": "2021-08-23T02:42:58.768653Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard is a wonderful university.  I have had the best and most versatile professors and feel blessed to have the opportunity to  work with them and the other students.",
            "Author": "Senior",
            "Date": "2021-07-22T14:23:38.776323Z"
        },
        {
            "Rating": 5,
            "Review": "I'm a rising sophomore at Harvard College, and even during the Covid pandemic, I had an amazing time at the school.  Sure, the classes are tougher than most places, but if you're here they assume that you can handle it.  I met the most amazing people in the world and from all around the world in my first year at Harvard, and I am so excited for the next three.",
            "Author": "Sophomore",
            "Date": "2021-05-20T21:49:27.749696Z"
        },
        {
            "Rating": 1,
            "Review": "Going into Harvard, I expected more than what was presented with. The teachers do not have time for individual help or tutoring. The rules are quite uptight to protect the image of the school, and students are only concerned with studying. While I had issues at the start of my freshman year, I figured out the \"Harvard Formula\" as I call it which is the structure of all of their tests. Harvard is quite overrated and is not challenging once you see past the money.",
            "Author": "Sophomore",
            "Date": "2021-05-14T15:17:38.148102Z"
        },
        {
            "Rating": 5,
            "Review": "Really welcoming for new students. Visitas is great and all the upperclassman are super friendly to reach out to.",
            "Author": "Freshman",
            "Date": "2021-05-06T10:08:12.832788Z"
        },
        {
            "Rating": 2,
            "Review": "The classes are nothing but pretentious, yes there are intelligent people here, but you’re paying for the name more than anything. I advise that you seek a college degree elsewhere, as here at Harvard, your pockets will be empty at the ripe old age of 19.",
            "Author": "Junior",
            "Date": "2021-04-15T19:07:11.197298Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard. What else do I need to say?  I mean is freakin' Harvard.  It's where JFK and Obama went to school, along with numerous presidents.",
            "Author": "Niche User",
            "Date": "2021-02-25T20:29:57.119859Z"
        },
        {
            "Rating": 4,
            "Review": "The academics here are top-notch and extracurriculars are all-around excellent, as you would expect of a place with Harvard's reputation. If you are looking for a party school, this is not the place for you - the scene is pretty standard for a large-sized American school and on the whole you are expected to work hard more than play hard. Students spend a lot of time networking and treat their clubs like full-time careers, and for good reason - they often secure job offers on the strengths of having well-known student groups and internships on their resumes. \n\nHowever, the school still needs to work on doing more than paying lip service to diversity. It has exceptional cultural diversity but doesn't do enough for its students who are low-income and black or Native American, for instance. The school's mental health efforts have also been largely misdirected.",
            "Author": "Alum",
            "Date": "2021-02-15T03:03:19.780388Z"
        },
        {
            "Rating": 5,
            "Review": "As a non-traditional transfer student enrolled through Harvard's Extension School, I am delighted by my experience so far. The administration staff and faculty are respectful and genuinely interested in helping each student reach their personal goals. The online classroom experience is excellent, the student communities are engaging and inspiring, and the academic expectations for excellence are challenging and rewarding.",
            "Author": "Sophomore",
            "Date": "2021-01-03T01:53:02.055309Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard is unlike any other university. The people you meet are unmatched and will amaze you everyday.",
            "Author": "Junior",
            "Date": "2021-01-03T01:05:24.529111Z"
        },
        {
            "Rating": 5,
            "Review": "The Harvard Extension School Program is a rich experience with numerous opportunities to build a community with other students.",
            "Author": "Graduate Student",
            "Date": "2020-12-30T21:10:46.514939Z"
        },
        {
            "Rating": 5,
            "Review": "Even with the freshmen on campus, we only had 30 cases of COVID, and some of those were false positives because the testing company screwed a few up. Great people and an amazing experience. The things you get to do here, the people and professors you meet, and the opportunities are legitimately endless--or at least have 40 billion dollars and 400 years behind it.",
            "Author": "Freshman",
            "Date": "2020-12-12T01:11:12.193572Z"
        },
        {
            "Rating": 5,
            "Review": "I really love harvard and wanted to be part of it. I was only in grade 9when I knew about it it is a excellent university I have seen ever and I wanted to be part of it since I watched Harry Potter film",
            "Author": "Niche User",
            "Date": "2020-12-07T21:53:13.728539Z"
        },
        {
            "Rating": 5,
            "Review": "Apparently, Harvard does a better pouring job than any other institution, at least according to the chart. Harvard University isn't necessarily the best, certainly not for most students.",
            "Author": "Freshman",
            "Date": "2020-11-25T12:56:31.26536Z"
        },
        {
            "Rating": 4,
            "Review": "I will begin Fall 2021. However I'm very excited and looking forward to beginning my graduate studies and earning a liberal arts degree in creatives writing.  I am seeking scholarships and grants to help cover costs to attend.  Hopefully I will win this scholarship.",
            "Author": "Graduate Student",
            "Date": "2020-10-01T18:20:07.994303Z"
        },
        {
            "Rating": 5,
            "Review": "Had an amazing experience at this university.\nHarvard University is an amazing university with a unique experience. I love them and it is because they show a commitment to excellence.",
            "Author": "Alum",
            "Date": "2020-09-17T07:09:44.150643Z"
        },
        {
            "Rating": 3,
            "Review": "Just google harvard lectures all the information is there anyway. I mean I guess it's a pretty good time for the most part, but we keep reusing information that's from 1636.",
            "Author": "Junior",
            "Date": "2020-09-07T03:30:26.94566Z"
        },
        {
            "Rating": 5,
            "Review": "I love the architecture at Harvard and students are very resourceful and intelligent. You get the feel for an old fashion atmosphere while also experiencing the modernness.",
            "Author": "Sophomore",
            "Date": "2020-08-05T00:07:50.395364Z"
        },
        {
            "Rating": 5,
            "Review": "I just got in and love it! It is absolutely amazing to be able to attend this world class institution!",
            "Author": "Graduate Student",
            "Date": "2020-08-01T02:49:00.012812Z"
        },
        {
            "Rating": 5,
            "Review": "Reputation and learning experience well earned and deserved.  You will not get a better college education anywhere else.",
            "Author": "Alum",
            "Date": "2020-07-22T22:17:09.952594Z"
        },
        {
            "Rating": 4,
            "Review": "It was amazing. Everyone took initiative to help one another. The professors are amazing and go above and beyond to help.",
            "Author": "Niche User",
            "Date": "2020-07-20T17:00:31.742402Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard has the most unique students on its campus. Students from all the world from various cultures economic backgrounds reflect their ideas experiences and perceptions that allows the whole student body to have the most engaging experience throughout their college life. It provides the students a platform to brainstorm and put their ideas onto while nurturing them into leaders and innovators and giving a structure to their ideas. It brings life to the abstract imagination of students and gives them the confidence and skill to pursue their passion and be the best among the rest. Students get an opportunity to share the hurdles and hardships of their communities and leave with a solution to their problems here at Harvard. The most illuminating alumni and a replica of passion pursuit are here at Harvard.",
            "Author": "Niche User",
            "Date": "2020-07-09T06:17:52.958891Z"
        },
        {
            "Rating": 4,
            "Review": "I am a pre-frosh so it's disappointing that we don't know how and where we are starting yet. I'd be even more disappointed if I were a senior.  However, I am not giving this as a grievance because they are working extremely hard trying to do the best for everyone.",
            "Author": "Freshman",
            "Date": "2020-06-15T16:43:26.155189Z"
        },
        {
            "Rating": 5,
            "Review": "Thus far it has been exceptional. Very intellectual engaging and you're surround by some of the brightest minds in the world.",
            "Author": "Graduate Student",
            "Date": "2020-05-29T23:49:52.449114Z"
        },
        {
            "Rating": 5,
            "Review": "The amazing professors are really what make the university so great! They hold each student to high expectations and help them achieve them.",
            "Author": "Junior",
            "Date": "2020-05-26T19:30:39.808683Z"
        },
        {
            "Rating": 5,
            "Review": "I completed a Summer program last year and I loved it!! The architecture was amazing and I had the pleasure of working with Harvard professors. I enjoyed the food, and the architecture of the building. I took a course in the psychology of attribution and I fell in love. The work and living dynamic at Harvard is fantastic. I was able to expand my learning and attend college seminars and workshops with college professors.",
            "Author": "Niche User",
            "Date": "2020-05-25T00:40:25.987196Z"
        },
        {
            "Rating": 5,
            "Review": "Great new programs and excellent professors. Much of a mixed student roster with people from all over the country enrolled in my online C.O.R.E Harvard Business School Classes. Online navigation is perfect and customer service are amazing.",
            "Author": "Freshman",
            "Date": "2020-05-22T09:06:13.632079Z"
        },
        {
            "Rating": 5,
            "Review": "An amazing experience, I would 100% recommend! I studied at the Harvard Divinity School and the faculty were incredible.",
            "Author": "Alum",
            "Date": "2020-05-15T21:37:20.478297Z"
        },
        {
            "Rating": 5,
            "Review": "Accepting and intellectual community of innovators, most of whom value knowledge sharing and global progress over prestige and profit.",
            "Author": "Graduate Student",
            "Date": "2020-04-11T13:50:00.903612Z"
        },
        {
            "Rating": 3,
            "Review": "Harvard does not value the arts enough and, consequently, artists struggle with having to lead a double life if they want to stay committed to their career while observing the obligations imposed by Harvard. In contrast, students from different fields tend to more easily connect their academic experiences with professional progression, and in the remaining time they can (relatively) freely invest in other areas of interest.",
            "Author": "Senior",
            "Date": "2020-03-29T20:10:16.913422Z"
        },
        {
            "Rating": 5,
            "Review": "An incredible university with some of the most brilliant, interesting, kind, passionate petiole in the world. I came in scared that this would be a cut-throat competitive nightmare but everyone lifts each other up rather than tears each other down. I absolutely love Harvard and am so grateful for all of the opportunities it affords.",
            "Author": "Freshman",
            "Date": "2020-03-03T15:08:52.695867Z"
        },
        {
            "Rating": 5,
            "Review": "very empowering experience, the summer program was very fun. We were provided with lunch and diner. The campus is very hisotrical and fantastic.",
            "Author": "Niche User",
            "Date": "2020-03-03T08:30:56.207608Z"
        },
        {
            "Rating": 5,
            "Review": "Great University! Worldwide renowned in research and academic excellence. Great place to get inspired and learn.",
            "Author": "Graduate Student",
            "Date": "2020-02-28T05:26:36.992615Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard is a great school, I would definitely recommend Harvard to anyone who would like to attend a secondary school.",
            "Author": "Freshman",
            "Date": "2020-02-24T18:21:12.795138Z"
        },
        {
            "Rating": 2,
            "Review": "Pretentious!! In one word...So glad I transferred from that school..So overrated... Phoniest people in the world...Happy to be back in Michigan..",
            "Author": "Sophomore",
            "Date": "2020-02-23T23:14:38.330478Z"
        },
        {
            "Rating": 5,
            "Review": "I had the opportunity to go on a campus visit (and stayed in the dorms for a few days.) I sat in on the business class, which was a good experience because I got a sense of what it’s like to be a Harvard Student. Everyone came to class prepared and ready to learn. I got a tour of Harvard’s medical school as well. The dorms were nice but a little small, at least the ones I stayed at. The food was great and I even got to eat at the Freshman Dining Hall. The campus in general is nice and clean. It’s a good environment to be in.",
            "Author": "Niche User",
            "Date": "2020-02-04T20:05:11.481388Z"
        },
        {
            "Rating": 5,
            "Review": "There are great professors who are clearly expert in their fields. The work is rigorous, but everything is structured so that you are continually improving.",
            "Author": "Sophomore",
            "Date": "2020-01-14T00:24:04.762979Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard is incredible! The campus is vibrant and there are always tourists. It is especially busy during fall because the foliage is beautiful. The professors are very knowledgeable. Most write their own textbooks, so they truly know what they are teaching. The students are also great; they are intellectual, fun, and laidback. It is a great experience studying here!",
            "Author": "Freshman",
            "Date": "2020-01-09T17:50:38.266584Z"
        },
        {
            "Rating": 5,
            "Review": "It's Harvard: it's been amazing. There are so many opportunities and so many amazing and kind people there. It truly is an experience, one I am so grateful for.",
            "Author": "Junior",
            "Date": "2019-12-31T18:31:25.436595Z"
        },
        {
            "Rating": 5,
            "Review": "I'm just girl waiting to get in my dream college but I can see it gonna be tough but I can do it.i really love this college and I think so will you",
            "Author": "Niche User",
            "Date": "2019-12-30T04:44:56.231867Z"
        },
        {
            "Rating": 5,
            "Review": "Have heard and experienced amazing things. Ten out of ten recommend. All around amazing if you are looking for a very well managed all around great college consider going here.",
            "Author": "Niche User",
            "Date": "2019-12-24T00:35:18.866162Z"
        },
        {
            "Rating": 5,
            "Review": "There is absolutely nothing I would change about this college. The curriculum is excellent and it has everything I would want from a college. I love the campus experience and the school itself is absolutely stunning.",
            "Author": "Niche User",
            "Date": "2019-12-02T01:31:05.975267Z"
        },
        {
            "Rating": 5,
            "Review": "My time at Harvard has been life changing to say the least! I have discovered a new side of myself and have grown tremendously in all aspects of life.",
            "Author": "Freshman",
            "Date": "2019-11-15T05:54:13.201935Z"
        },
        {
            "Rating": 4,
            "Review": "Great experience in learning. All facilities and campus offered all that was needed to have a complete learning experience at the highest level",
            "Author": "Alum",
            "Date": "2019-11-14T18:14:56.65484Z"
        },
        {
            "Rating": 5,
            "Review": "In this school it was amazing, the teachers I had for a summer program where very upbeat about many things and were able to communicate with the students. It was not only them but also a lot of other people that went to school there were very nice and helpful.",
            "Author": "Niche User",
            "Date": "2019-11-04T15:13:32.610848Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard University is the most amazing school in the world. If you get in, you should go. Beautiful campus, top-notch academics, Cambridge is amazing.",
            "Author": "Niche User",
            "Date": "2019-10-30T02:44:28.670135Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard is a really cool University and I would love to enroll there..I mean Harvard Medical School of course because I wanna be a cardiologist in future.. Harvard is the best.",
            "Author": "Niche User",
            "Date": "2019-10-25T19:37:49.719428Z"
        },
        {
            "Rating": 5,
            "Review": "I loved the campus and the teachers, especially my professors. I really got a chance to connect with them while on campus! I loved their teaching methods; they really let us explore the topics we covered, by ourselves, and with our own interest. They gave us constructive criticism and we gladly grew and flourished in that environment. I would like to change one though, and that is the parking on campus. Harvard has a major parking problem, and that should really be taken a look at.",
            "Author": "Alum",
            "Date": "2019-10-17T16:21:10.875416Z"
        },
        {
            "Rating": 5,
            "Review": "The campus is beautiful there, everything was conveniently nearby: restaurants, beaches, malls, and of course, Boston. Student centers like the Smith Center or the Cabot Library in the Science Center are very helpful for study groups, or tutoring sessions with the reservable rooms available. Widener Library is also a very relaxing place to be in general. There was a wide range of diversity in people, personalities, experiences and expertise. Everyone is willing to help others and it is very easy to meet people. While the majority of the time the campus and the centers feel very safe, I constantly hear about incidents occurring mainly during night at certain areas close by. The professors there are very helpful, and the lessons tend to be interactive and actually enjoyable. Although the courses were extremely difficult, unlike anything I've ever experienced before, learning the information was fun although tedious.",
            "Author": "Niche User",
            "Date": "2019-09-30T06:11:43.950955Z"
        },
        {
            "Rating": 5,
            "Review": "I went to Harvard University for two weeks in the summer at a debate camp, in which we learned national-level techniques for speech and debate. They taught us how to cross-examine, how to organize and format arguments, speech exercises, and research methods. It was profoundly informative. Furthermore, the professors were highly helpful and educated and the dorms were of decent quality, despite lacking air conditioning. The campus was quite beautiful, with vast fields of greenery and trees. We went to one party on the Fourth of July with amazing food and a wonderful friend atmosphere. The local area had high-quality restaurants with interesting, modern attractions. The campus food itself was suitable, but not excellent compared to the food sold at restaurants nearby.",
            "Author": "Niche User",
            "Date": "2019-08-27T00:12:19.906821Z"
        },
        {
            "Rating": 4,
            "Review": "Great atmosphere with respectable diversity and a standard of learning and engagement that matches its name.",
            "Author": "Sophomore",
            "Date": "2019-08-11T04:44:17.234709Z"
        },
        {
            "Rating": 5,
            "Review": "I had an absolutely amazing experience with Harvard University, as I spent the summer after my high school sophomore year taking an undergraduate course called Principles of Economics with three extremely notable professors - Dr. Daron Acemoglu (MIT), Dr. David Laibson (Harvard), and Dr. John A. List (UChicago). The campus is amazing, and there are are hundreds of tourists everywhere. Libraries and other campus resources are easily accessible, but it is difficult to get good vegetarian options during lunch and dinner at Annenberg Hall. Professors are very open and we had lots of excellent discussions over research they've done and books they've written, and it was the best summer of my entire life.",
            "Author": "Niche User",
            "Date": "2019-08-06T22:54:24.2278Z"
        },
        {
            "Rating": 5,
            "Review": "For me, the best part of my experience at Harvard is the individuals I have met. These people whether it be professors, students or faculty are so immersed in learning and teaching others.",
            "Author": "Junior",
            "Date": "2019-07-31T23:52:41.651103Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard was an incredible experience unlike any other. I instantly felt connected as a global citizen like never before, meeting some of the most intelligent and unique people I am likely to come across in my life. The institution prides itself on maintaining high standards, and one leaves its gates understanding not \"what\" to think but \"how\" to think - the most valuable skillset of all.",
            "Author": "Alum",
            "Date": "2019-07-30T23:35:54.543877Z"
        },
        {
            "Rating": 5,
            "Review": "I love it! I have experienced once in a life time opportunities overall it is an enjoyable experience.",
            "Author": "Graduate Student",
            "Date": "2019-07-27T11:53:37.326133Z"
        },
        {
            "Rating": 5,
            "Review": "The opportunities are truly endless, and the campus culture is very positive and collaborative. Professors are at the top of their fields, and student dorms/dining is great (Annenberg, the freshman dining hall, could be better though). There's a very diverse and incredibly talented student population to inspire you and most of the courses are very well-taught. I'm so grateful to be able to attend Harvard!",
            "Author": "Freshman",
            "Date": "2019-07-25T14:30:07.129307Z"
        },
        {
            "Rating": 5,
            "Review": "There are tremendous opportunities to discover your passions. Career services is a great resource to learn about job and internship opportunities",
            "Author": "Freshman",
            "Date": "2019-07-12T18:32:39.627586Z"
        },
        {
            "Rating": 5,
            "Review": "I will be first generation going to college and I want to give my best and I want to go into political science and Harvard is an awesome school. The only mini problem is that there could be sometimes many diversity. I am a Latina girl looking forward to representing my community and I want to do a really good job. I want to show other immigrants that everything can be possible. Anything is possible if I keep on trying and working hard. I know that I want to make my parents proud and I would keep on working hard and giving all my ef",
            "Author": "Niche User",
            "Date": "2019-07-10T04:34:22.762416Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard is a great University for the students , both international and national. It provides the best environment to study and the tools there are also so available get to research in different fields .It opens a door for the students to create something . That's why it's the best university in the world. All the new ideas come from this university which makes this world developed.",
            "Author": "Freshman",
            "Date": "2019-07-07T05:41:15.612559Z"
        },
        {
            "Rating": 5,
            "Review": "Incredible student culture as well as history.  The great thing about Ivy Leagues is that everyone had to work hard in one way or another to get in, so there are very few people slacking or truly disinterested in being there, including the teachers.  Tuition has been very hard but the more prepared your family was for college and the more scholarships you apply for, the better the experience, and that goes for any college.",
            "Author": "Niche User",
            "Date": "2019-07-04T01:56:12.19022Z"
        },
        {
            "Rating": 4,
            "Review": "I enjoy Harvard, there are very few places where the greatest minds in a generation can gather and truly create an open community. Harvard has a tendency to advocate for diversity, but they despise diversity of thought. The only thing the university cares about is diversity of background and ethnicity in order to appear more welcoming. I wouldn't trade my athletic and academic experience for anything, but the social aspect leaves more to be desired.",
            "Author": "Junior",
            "Date": "2019-06-26T00:02:02.458975Z"
        },
        {
            "Rating": 5,
            "Review": "I love how everyone there is so friendly! It's amazing to see such a group of talented and passionate individuals.",
            "Author": "Freshman",
            "Date": "2019-05-25T21:47:00.892741Z"
        },
        {
            "Rating": 5,
            "Review": "I am an adult returning to finish my bachelor's degree. I love the school, the campus and the environment",
            "Author": "Niche User",
            "Date": "2019-05-23T12:48:12.184846Z"
        },
        {
            "Rating": 5,
            "Review": "I just finished my first year at Harvard.  I had a rocky transition at first, but I am really loving it!  The professors and TFs I have had are all really friendly and accessible, and there is an endless list of classes that I want to take.  Conversations with peers are really thought-provoking and deep.  You can find so many great communities through different activities, and there are so many great people on campus.  Even as a freshman, I have been offered so many unique opportunities that I know come from Harvard's resources.  I never thought it could, but Harvard has really become my home this year.",
            "Author": "Freshman",
            "Date": "2019-05-22T15:30:51.029868Z"
        },
        {
            "Rating": 5,
            "Review": "Party scene is the best in the country! Nerds sure do know how to party! I went to a yAle part and it got notin on dis Harvard 1. So you're probably thinking about Stanford parties? They suck too. I went there for 8 years for my undergrad.",
            "Author": "Alum",
            "Date": "2019-05-21T15:01:35.659959Z"
        },
        {
            "Rating": 5,
            "Review": "Currently, I am a registered student with the Harvard Extension School through Harvard University. I appreciate how this program caters to non-traditional students who are going back to school and want a top-notch education from a premiere university.",
            "Author": "Junior",
            "Date": "2019-05-09T15:15:02.944385Z"
        },
        {
            "Rating": 5,
            "Review": "taking a virtual tour in to the word in Harvard is just like you are there in person and i assure you that you want to be there in person ,to witness the crimson way ,experiencing diversity and cultural heritage in this A+ institution.outside this is the beautiful structures the school has from the beautiful dorms to the epic library and lovely sight of nature from the top dome .Also the part life in Harvard is dope ,the step out when it comes to partying ,sport and food.\nOmg!! their football team is cold,after taking a virtual tour i went ahead watching their football game and it was legendary.",
            "Author": "Niche User",
            "Date": "2019-05-06T05:54:04.978863Z"
        },
        {
            "Rating": 5,
            "Review": "I like Harvard very much because it is a great university and challenges me to learn more and stretch myself. Its academics are number one.",
            "Author": "Freshman",
            "Date": "2019-04-02T19:52:14.681546Z"
        },
        {
            "Rating": 5,
            "Review": "What i liked was the environment. They have great professors that can really help you learn about your major. This is a great place to be . You wont regret coming here.",
            "Author": "Junior",
            "Date": "2019-04-02T12:11:20.044777Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard Square, Cambridge, and the Greater Boston Area is a great place to live and work. It's filled with diversity and excellent events and opportunities. Harvard faculty members are caring, and the dorms are comfortable to live in.",
            "Author": "Works Here",
            "Date": "2019-04-01T13:01:53.106014Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard is a place where education is approached from a different perspective as the university values learning and curiosity more than recognition. Students at Harvard are so genuinely passionate about learning that they're able to achieve a level of thinking that not many people can achieve, which is metacognition: thinking about your thinking or learning process. The interdisciplinary and collaborative environment, as well as the passionate friends I have made, have allowed me to unleash my curiosity and creativity. Harvard is not only a school for intellects, it is a school for passionate people. People work hard, are determined, and believe in what they do. The most beautiful aspect about Harvard is the fact that hierarchy is not relevant. Professors do not brag about their awards and degrees, graduate and undergraduate students work together, and everyone is open to help each other. Harvard is a beautiful and intellectually stimulating place to study.",
            "Author": "Freshman",
            "Date": "2019-03-29T16:44:45.038464Z"
        },
        {
            "Rating": 4,
            "Review": "Prestigious. Knowledgeable staff. Smart students. Beautiful campus.  Dorm is old. Buildings are old.",
            "Author": "Graduate Student",
            "Date": "2019-03-20T13:49:27.702856Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard University is a great campus that's dedicated to teaching students how to change the world. Their general facilities, professors, and students, make it very easy to get connected with some of the best minds in the world. Harvard is a university that is truly top tier and the students who attend Harvard are some of the most dedicated and hard working individuals in this world. In addition, other living aspects of the college like the campus and extracurricular events like recreational sports, study groups, and organized parties are extremely fun and engaging. These events make it extremely easy to get plugged in and make lasting social relations.",
            "Author": "Graduate Student",
            "Date": "2019-03-05T02:35:24.906937Z"
        },
        {
            "Rating": 5,
            "Review": "The university offers excellent tuition to students. The professors are good and very experienced.The dormitories have a lot of facilities to make one enjoy their stay on campus.",
            "Author": "Niche User",
            "Date": "2019-02-03T15:36:59.43932Z"
        },
        {
            "Rating": 5,
            "Review": "Excellent resources and professors. The classes are kept to a small number of students and there is plenty of opportunity to share and to discuss topics in a more in-depth manner. Professors are available to meet with you and to help support your learning. The campus is full of events and the time you have with friends to discuss your learning is excellent.",
            "Author": "Graduate Student",
            "Date": "2019-02-01T16:47:20.636624Z"
        },
        {
            "Rating": 5,
            "Review": "This university is without a doubt worth five stars. I would give the academics five stars.  I would give the return on investment five stars.  I would give the diversity five stars.  I would give the campus five stars.  I would give the athletics five stars.  I would give the party scene five stars.  I would give the professors five stars.",
            "Author": "Niche User",
            "Date": "2019-02-01T03:40:31.19569Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard has a great reputation. A degree from Harvard will certainly help my future career. Harvard has excellent Professors with multiple research opportunities. Harvard has almost unlimited resources.",
            "Author": "Freshman",
            "Date": "2019-01-18T00:44:40.522513Z"
        },
        {
            "Rating": 5,
            "Review": "It is a great experience to interact with motivated, interesting people from all over the world. The classes are engaging and challenging.",
            "Author": "Senior",
            "Date": "2018-12-29T14:56:29.011919Z"
        },
        {
            "Rating": 5,
            "Review": "It is a very beautiful and antique building that really brings students to enjoy their college life.",
            "Author": "Niche User",
            "Date": "2018-12-07T05:38:23.009544Z"
        },
        {
            "Rating": 5,
            "Review": "It is Harvard. The education is not only excellent but also world known, by studying in a such an institute you will create connections with people all over the world.",
            "Author": "Niche User",
            "Date": "2018-12-07T02:16:06.557454Z"
        },
        {
            "Rating": 5,
            "Review": "Great school with great traditions and academics. World renowned education that challenges the students",
            "Author": "Graduate Student",
            "Date": "2018-12-06T06:35:36.067542Z"
        },
        {
            "Rating": 5,
            "Review": "Went on a 7 week Pre-collegiate course here and I fell in love instantly! Proud to say it was the  first college I've ever been too. Area is amazing and the diverse personalities from all walks of life has inspired me to raise my standards exponetially ever since. There's no place I'd rather be than back in Harvard Yard for my freshman year of college ! #GoCrimson",
            "Author": "Niche User",
            "Date": "2018-12-02T08:16:43.29833Z"
        },
        {
            "Rating": 4,
            "Review": "I am attending Harvard for my premedical studies. The resources are great and extremely beneficial to my learning. The overall teaching is also amazing and the professors truly care about the students.",
            "Author": "Graduate Student",
            "Date": "2018-11-04T06:32:16.388474Z"
        },
        {
            "Rating": 5,
            "Review": "I enjoyed the campus, it was very nice and clean. The people were very welcoming and helpful in finding places and stores around campus.",
            "Author": "Niche User",
            "Date": "2018-11-01T02:19:52.449289Z"
        },
        {
            "Rating": 3,
            "Review": "some of the professors are very rude, but besides that everything else is okay the oly other thing is that they can work on getting better food for how much it cost to attend.",
            "Author": "Graduate Student",
            "Date": "2018-10-17T15:01:07.958407Z"
        },
        {
            "Rating": 2,
            "Review": "Harvard should be the best when it comes to mental health and mental health issues among students yet it is clear there is a lack of training, understanding, and community that helps students who begin to struggle while they are at the university. Without catching students early it could impact a class grade. A student can not fail a class at Harvard without major consequences. There needs to be some or more training for advisers, deans, teaching fellows and professors to watch for students who start to withdraw and are having mental health issues.",
            "Author": "Junior",
            "Date": "2018-10-08T04:33:34.682214Z"
        },
        {
            "Rating": 5,
            "Review": "Strong support system for its students. Embracing and diverse community of students. A place of boundless opportunities and chances to hire.",
            "Author": "Freshman",
            "Date": "2018-10-07T07:22:35.593587Z"
        },
        {
            "Rating": 5,
            "Review": "Beautiful campus, diverse faculty and students, and great educational experience; both online and in-person.",
            "Author": "Niche User",
            "Date": "2018-09-02T05:34:58.151051Z"
        },
        {
            "Rating": 5,
            "Review": "Though it took some time, Harvard came to be my home away from home and I loved my time there. From the academic diversity to the amazing students and faculty, there's so much to learn in just a few short years.",
            "Author": "Alum",
            "Date": "2018-08-31T14:38:24.114908Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard University has excellent programs for graduate students. The courses are flexible and fit around work schedules. However, the material can be challenging and very time consuming. I would recommend going to graduate school here.",
            "Author": "Graduate Student",
            "Date": "2018-08-15T00:56:53.189524Z"
        },
        {
            "Rating": 4,
            "Review": "I loved the general campus feel. The academics were wide and diverse providing me an outlet for creative growth.",
            "Author": "Niche User",
            "Date": "2018-08-10T22:12:58.107752Z"
        },
        {
            "Rating": 5,
            "Review": "The best university in the world, period. The quality of the people at Harvard from professors to your classmates is simply tremendous. Every day at Harvard is a learning experience from the best and brightest in the world. Harvard will give you a valuable opportunity to learn and grow as a human being while forging lifelong friendships with amazing people.",
            "Author": "Alum",
            "Date": "2018-08-02T16:30:14.643387Z"
        },
        {
            "Rating": 5,
            "Review": "Interaction with intelligent people unbelievable.  Missing in other universities and areas.  The environment around HU is also very stimulating and a lot of interesting events going on.  Hard to bead",
            "Author": "Works Here",
            "Date": "2018-07-24T02:01:26.015924Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard has been amazing. Coming from Khartoum, Sudan, the shift to life in America was very drastic. Thankfully, Harvard was the ideal environment for me to acclimate myself to all the differences in lifestyle and academic rigor.",
            "Author": "Sophomore",
            "Date": "2018-07-20T02:13:51.067583Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard University gave me a lot of tools and skills to success in academic as well as my future career. I would definitely recommend it to anyone who come here to study. However, the classrooms are a little bit old and needed to remodel badly.",
            "Author": "Alum",
            "Date": "2018-07-17T01:23:58.500095Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard University is the best university one could get into for education due to the unmatched intellectual atmosphere consisting of the world's top brains with cutting edge research being done in all fields leading to new interdisciplinary collaborations.",
            "Author": "Graduate Student",
            "Date": "2018-07-07T16:35:12.294759Z"
        },
        {
            "Rating": 4,
            "Review": "I had a hard time adjusting my first semester, but now I am looking forward to my next three years here. The weather is a bit terrible, but there are so many exciting things going on all the time!",
            "Author": "Sophomore",
            "Date": "2018-06-29T20:29:33.900709Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard University is an institution that is constantly reviewing and improving upon itself. Whether its the constant renovations, multiple opportunities for student voices to be heard, or the emphasis on academic areas that the school is not known for (i.e. STEM), Harvard is constantly working to EARN it's title as the number one Ivy, and one of the best universities in the world.",
            "Author": "Sophomore",
            "Date": "2018-05-18T05:17:07.787513Z"
        },
        {
            "Rating": 5,
            "Review": "Great place.  Great academics. Great students.  Great professors.   All around great great.  Great.  Great.    Kk.",
            "Author": "Alum",
            "Date": "2018-05-11T18:18:06.219619Z"
        },
        {
            "Rating": 5,
            "Review": "It's a prestigious university, but it isn't the school, it's the student. A college name is just a name, but everything else is developed through self-determination.",
            "Author": "Niche User",
            "Date": "2018-04-10T21:45:56.689034Z"
        }
    ],
    "Student%20Life": [
        {
            "Rating": 4,
            "Review": "Very diverse by race and location. It does seem to skew towards higher income levels but that has many reasons for being so.",
            "Author": "College Senior",
            "Date": "2016-09-07T21:45:16Z"
        },
        {
            "Rating": 3,
            "Review": "Don't really know that much about Greek Life here, for grad students it's a non-issue and doesn't seem overly important to students.",
            "Author": "College Senior",
            "Date": "2016-09-07T21:32:28Z"
        },
        {
            "Rating": 4,
            "Review": "The gyms and everything are pretty nice but nothing to write home about. Not as nice as I thought they'd be.",
            "Author": "College Senior",
            "Date": "2016-09-07T21:31:40Z"
        },
        {
            "Rating": 3,
            "Review": "Greek life isn't  a big part of the school.",
            "Author": "College Freshman",
            "Date": "2016-08-31T18:31:04Z"
        },
        {
            "Rating": 4,
            "Review": "A surprising number of people are varsity athletes and are world class.",
            "Author": "College Freshman",
            "Date": "2016-08-31T18:30:22Z"
        },
        {
            "Rating": 4,
            "Review": "The athletic opportunities are amazing. Just probe around and you'll find anything that suits you.",
            "Author": "College Senior",
            "Date": "2016-07-18T16:12:27Z"
        },
        {
            "Rating": 3,
            "Review": "Eh. Harvard is not known for its Greek life.",
            "Author": "College Freshman",
            "Date": "2016-07-03T13:33:59Z"
        },
        {
            "Rating": 4,
            "Review": "I think that Harvard is very subtle in its adoration for sports. It has the most division I NCAA teams of any school in the country, but you'd hardly know it from the outside looking in.",
            "Author": "College Freshman",
            "Date": "2016-07-03T13:33:01Z"
        },
        {
            "Rating": 4,
            "Review": "The teams are great, fans not so much.",
            "Author": "College Sophomore",
            "Date": "2016-07-02T21:58:56Z"
        },
        {
            "Rating": 3,
            "Review": "Under a lot of flack lately. Very controversial recently.",
            "Author": "College Sophomore",
            "Date": "2016-06-29T19:59:34Z"
        },
        {
            "Rating": 3,
            "Review": "Good athletics program with some great sports teams. School spirit is not too high, except during Harvard-Yale.",
            "Author": "College Sophomore",
            "Date": "2016-06-29T19:58:47Z"
        },
        {
            "Rating": 3,
            "Review": "Not really a big deal on campus.",
            "Author": "College Sophomore",
            "Date": "2016-06-22T12:55:11Z"
        },
        {
            "Rating": 2,
            "Review": "We have some surprisingly good teams, but the majority of the student population could care less about any sports.",
            "Author": "College Sophomore",
            "Date": "2016-06-22T12:54:36Z"
        },
        {
            "Rating": 3,
            "Review": "i don't really know. but i think i shouldn't create significant troubles",
            "Author": "College Sophomore",
            "Date": "2016-05-22T03:59:04Z"
        },
        {
            "Rating": 5,
            "Review": "the school has variety of clubs that you can utilize and develop your interest in sports on a deeper level",
            "Author": "College Sophomore",
            "Date": "2016-05-22T03:58:14Z"
        },
        {
            "Rating": 3,
            "Review": "I don't participate in Greek life so I don't really know, but it seems like a nice group of people for whom it's not a huge deal but adds if you're seeking that out.",
            "Author": "College Freshman",
            "Date": "2016-05-05T13:39:50Z"
        },
        {
            "Rating": 3,
            "Review": "The facilities are good for both athletes and students, but no one really cares about varsity sports unless it's the Harvard-Yale game.",
            "Author": "College Freshman",
            "Date": "2016-05-05T13:38:55Z"
        },
        {
            "Rating": 3,
            "Review": "Some facilities are great while some are mediocre.",
            "Author": "College Freshman",
            "Date": "2016-04-22T09:24:11Z"
        },
        {
            "Rating": 3,
            "Review": "I love the club sports, but club sports like cheerleading are underfunded.",
            "Author": "College Sophomore",
            "Date": "2016-04-16T03:51:02Z"
        },
        {
            "Rating": 4,
            "Review": "I play soccer for my school and I have fun with my friends through practicing soccer together.",
            "Author": "College Student",
            "Date": "2016-03-31T06:52:18Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard targets and hits specific %s.",
            "Author": "College Junior",
            "Date": "2016-03-30T14:30:11Z"
        },
        {
            "Rating": 3,
            "Review": "Final Clubs are way more important.",
            "Author": "College Junior",
            "Date": "2016-02-18T10:52:05Z"
        },
        {
            "Rating": 5,
            "Review": "No one really cares about them but I love going to games.",
            "Author": "College Junior",
            "Date": "2016-02-18T10:51:30Z"
        },
        {
            "Rating": 5,
            "Review": "greatest athletic facilities in the world",
            "Author": "College Student",
            "Date": "2016-02-17T02:47:09Z"
        },
        {
            "Rating": 4,
            "Review": "Everyone can go to the parties, if they're interested",
            "Author": "Recent Alumnus",
            "Date": "2016-02-16T18:13:48Z"
        },
        {
            "Rating": 3,
            "Review": "Not much variety in terms of sororities, there are few black sororities and fraternities which is sad. Harvard isn't doing anything about this even after it has been brought to their attention MANY times, and that's even worse.",
            "Author": "College Sophomore",
            "Date": "2016-01-30T19:28:18Z"
        },
        {
            "Rating": 3,
            "Review": "Frats at Harvard are different—not snobby, overly fratty, or obnoxious. Joining a frat is somewhat pitied because much more importance is placed on joining a Harvard Final Club as an upperclassman.",
            "Author": "College Freshman",
            "Date": "2016-01-19T04:45:33Z"
        },
        {
            "Rating": 5,
            "Review": "Athletics aren't all encompassing for student life—the football team doesn't rule the school—but they do provide a strong focal point for school spirit and community, especially through our rivalry with Yale.",
            "Author": "College Freshman",
            "Date": "2016-01-19T04:43:02Z"
        },
        {
            "Rating": 3,
            "Review": "Greek life is very low at Harvard. It is not a main priority for many students but it is available for those who wish to get involved.",
            "Author": "College Junior",
            "Date": "2016-01-13T14:29:15Z"
        },
        {
            "Rating": 3,
            "Review": "There is very limited school spirit when it comes to athletics",
            "Author": "College Junior",
            "Date": "2016-01-13T14:27:18Z"
        },
        {
            "Rating": 3,
            "Review": "I don't really know a lot about it, the two groups pretty much keep to themselves",
            "Author": "College Senior",
            "Date": "2016-01-10T16:26:07Z"
        },
        {
            "Rating": 4,
            "Review": "Athletics are popular, especially the Harvard-Yale Game",
            "Author": "College Senior",
            "Date": "2016-01-10T16:24:15Z"
        },
        {
            "Rating": 3,
            "Review": "Harvard leans on the side of being too liberal, where more moderate opinions can sometimes feel stifled.",
            "Author": "College Freshman",
            "Date": "2016-01-04T22:19:30Z"
        },
        {
            "Rating": 5,
            "Review": "Greek life seems great because if you want to join you can, and if you don't, you aren't bothered by it. It's a part of campus, but a quiet one which is both accessible and ignorable.",
            "Author": "College Sophomore",
            "Date": "2016-01-03T16:19:29Z"
        },
        {
            "Rating": 5,
            "Review": "Athletics are perfect. They are a part of the campus, but not central to the campus. Athletes are as focused on their studies as anybody else. It's a fun sideshow -- but nothing more, nor should it be.",
            "Author": "College Sophomore",
            "Date": "2016-01-03T16:18:03Z"
        },
        {
            "Rating": 3,
            "Review": "I have no experience with Greek life.",
            "Author": "College Sophomore",
            "Date": "2015-12-29T17:03:13Z"
        },
        {
            "Rating": 3,
            "Review": "Greek life is kind of small. Not many frats or sororities, and students involved in Greek life aren't viewed differently as those not involved in Greek life.",
            "Author": "College Freshman",
            "Date": "2015-12-29T16:22:12Z"
        },
        {
            "Rating": 3,
            "Review": "Pretty good athletics. There are a lot of varsity athletes and club athletes, but the events aren't attended by a lot of fans for the most part.",
            "Author": "College Freshman",
            "Date": "2015-12-29T16:20:42Z"
        },
        {
            "Rating": 3,
            "Review": "Harvard-Yale football game is the most important sporting event but most people don't attend the others.",
            "Author": "College Freshman",
            "Date": "2015-12-29T12:11:25Z"
        },
        {
            "Rating": 4,
            "Review": "We have really good football and basketball teams. I don't know much about the other sports but most people support our sports teams. As you can imagine, not everybody at Harvard is into sports..",
            "Author": "College Freshman",
            "Date": "2015-12-27T00:41:44Z"
        },
        {
            "Rating": 4,
            "Review": "Somewhat strict, but overall the administration is very fair.",
            "Author": "College Freshman",
            "Date": "2015-03-15T17:42:35Z"
        },
        {
            "Rating": 3,
            "Review": "Never met anyone interested in school athletics here",
            "Author": "College Sophomore",
            "Date": "2015-01-29T15:42:17Z"
        },
        {
            "Rating": 3,
            "Review": "Haven't seen any issues myself but seems to be not a problem",
            "Author": "College Sophomore",
            "Date": "2015-01-29T15:40:18Z"
        },
        {
            "Rating": 3,
            "Review": "I really have no interaction with Greek life on campus",
            "Author": "College Sophomore",
            "Date": "2015-01-29T15:33:20Z"
        },
        {
            "Rating": 4,
            "Review": "The administration is very helpful here. There is always somebody to lend an ear or be of any support.",
            "Author": "College Freshman",
            "Date": "2014-10-09T14:33:38Z"
        },
        {
            "Rating": 5,
            "Review": "We have order and discipline",
            "Author": "College Freshman",
            "Date": "2014-10-04T20:42:48Z"
        },
        {
            "Rating": 3,
            "Review": "Every rule and regulation is in place not to punish students if they get caught, but to make sure they're safe despite their decisions.",
            "Author": "College Freshman",
            "Date": "2014-09-26T14:52:55Z"
        },
        {
            "Rating": 5,
            "Review": "HUPD officers are awesome - they genuinely want to protect students, not ruin their fun. They also want to get to know the students. I even had several HUPD officers sing me an enthusiastic \"Happy Birthday\" on my birthday, and I often stop and have conversations with them around campus. Generally, the administration at Harvard takes a pretty lenient position on disciplining students. I was busted twice by my proctor for having alcohol in my dorm room as a freshman, and nothing happened; he didn't even write down the offenses for records. This is the general attitude of most administrators toward alcohol, marijuana, and noise violations.",
            "Author": "College Sophomore",
            "Date": "2014-08-18T01:44:06Z"
        },
        {
            "Rating": 4,
            "Review": "Few people realize that all of Harvard's varsity sports are Division I and that Harvard has the largest varsity sports program in the country in terms of number of sports and number of athletes. That being said, athletics aren't one of the most important aspects of the Harvard scene. There's a reason why all sporting events are free for undergraduates. Most students go to a least a few home games, but you may see students doing their homework in the stadium. However, the Harvard-Yale football game (\"The Game\") is one of the biggest events of the year for students, alumni, faculty, and administrators. Everyone goes to The Game every single year, and everyone has an awesome time.",
            "Author": "College Sophomore",
            "Date": "2014-08-18T01:24:36Z"
        },
        {
            "Rating": 3,
            "Review": "I'm in one of the four sororities on campus, and honestly I don't consider a very important aspect of my college experience. None of the Greek organizations are officially recognized by the university, and none of the sororities even have houses. Very, very few students live in the frat houses; the houses are mostly used for parties. While it's nice to forge connections and friendships with students from different years with different interests, Greek life doesn't play a huge role in the social scene at Harvard. Male final clubs are far more popular, and their parties are better-attended.",
            "Author": "College Sophomore",
            "Date": "2014-08-18T01:20:09Z"
        },
        {
            "Rating": 4,
            "Review": "The only downside that can be stated is that Harvard does not excel in \"popular\" sports. Football, soccer, etc. are pretty mediocre when compared to the rest of the country. However, we are generally top in our league, and the basketball team has participated and made a good showing in March Madness several times now. Furthermore, if niche sports are your thing, you can't beat Harvard. The crew, squash, and sailing teams are often world renowned and compete internationally. The athletic facilities are also fairly state of the art and gorgeous.",
            "Author": "College Junior",
            "Date": "2014-08-04T18:21:18Z"
        },
        {
            "Rating": 4,
            "Review": "Harvard gets a bad rap for being \"stuck up\" or \"snooty,\" but when I hear that, I want to question who that person has chosen to hang out with. Yes, there can be a WASPy vibe at the finals clubs, but if that is not your scene, there are countless other options. The girls can be preppy, and there is an over abundance of vineyard vine items, but it is more a factor of being in New England, rather than Boston.",
            "Author": "College Junior",
            "Date": "2014-08-04T18:13:59Z"
        },
        {
            "Rating": 4,
            "Review": "Harvard does a great job of investing in a diverse student body, very supportive of other sexualities and strong vocal presence of minorities.",
            "Author": "College Junior",
            "Date": "2014-08-04T17:54:52Z"
        },
        {
            "Rating": 2,
            "Review": "There are about three small frats and three sororities on campus. Not much else to say about that...",
            "Author": "College Junior",
            "Date": "2014-08-04T17:47:36Z"
        },
        {
            "Rating": 3,
            "Review": "Harvard guys are a bit of a conundrum.  Relationships aren't really a thing here.",
            "Author": "College Sophomore",
            "Date": "2014-07-15T20:20:44Z"
        },
        {
            "Rating": 4,
            "Review": "I would say Harvard isn't too strict about alcohol use.  Freshmen aren't allowed to have alcohol in their dorms, but it's give or take whether or not parties that happen get busted/the host(s) get into trouble.  In the Houses, parties are free to occur so long as they don't create extreme amounts of noise, and varies depending on the proctor living in the dorm.  Harvard hates when its students protest though.",
            "Author": "College Sophomore",
            "Date": "2014-07-15T20:16:31Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard is an extremely diverse place in terms of race, background, economic status, sexual orientation, country of origin, all that stuff. People here tend to have a unique perspective and something that they contribute to the community around them.",
            "Author": "College Sophomore",
            "Date": "2014-06-29T21:36:02Z"
        },
        {
            "Rating": 5,
            "Review": "I've never encountered any problems.  Freshman parties get broken up every so often if they are noisy.  Basically you have to do something really bad and stupid to get in any real trouble.",
            "Author": "College Sophomore",
            "Date": "2014-06-09T22:36:11Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard is interesting - not the ugly-nerd stereotype many expect.  We have world-class athletes and rich legacy kids, which definitely contribute to overall attractiveness, but also i've found that smart people are much better-looking than i expected.  Overall, the students are attractive AND smart, interesting, and put-together.",
            "Author": "College Sophomore",
            "Date": "2014-06-09T22:34:15Z"
        },
        {
            "Rating": 3,
            "Review": "There are 4 sororities & 4 fraternities.  Great alternatives to the final clubs if you are interested in joining a social group.  The frats have parties.",
            "Author": "College Sophomore",
            "Date": "2014-06-09T22:30:33Z"
        },
        {
            "Rating": 5,
            "Review": "It's nice that it isn't the only important thing here, but the spirit and athleticism is definitely apparent.  We have great facilities and world-class athletes.  I have several friends who either were in the olympics already or are on the fast-track to be in them soon.  Games are fun and well-attended, and club/intramural athletes are well-respected as well.  Sports teams also hold parties regularly :)",
            "Author": "College Sophomore",
            "Date": "2014-06-09T22:23:26Z"
        },
        {
            "Rating": 5,
            "Review": "Very diverse place where most people are open to hearing others' opinions, and actually interested in expanding their own views in an intellectual manner.",
            "Author": "College Sophomore",
            "Date": "2014-06-09T22:19:49Z"
        },
        {
            "Rating": 5,
            "Review": "I've never had any problems! If you respect the people around you and yourself neither will you!",
            "Author": "College Freshman",
            "Date": "2014-04-28T11:13:13Z"
        },
        {
            "Rating": 3,
            "Review": "Look to I, Too, Am Harvard to see how well our school does with racial equality.  Luckily, the conservatives on campus are few and far between.",
            "Author": "College Freshman",
            "Date": "2014-04-08T21:13:55Z"
        },
        {
            "Rating": 4,
            "Review": "People only get excited about sports around Harvard/Yale or the NCAA, but we're decent.",
            "Author": "College Freshman",
            "Date": "2014-04-08T21:03:25Z"
        },
        {
            "Rating": 4,
            "Review": "We are all pretty smart, and fairly good looking. A lot of people like to let everyone know they are smart and can come off as a bit snobbish. But there are also some people out there who don't do that.",
            "Author": "College Junior",
            "Date": "2014-04-08T01:40:53Z"
        },
        {
            "Rating": 3,
            "Review": "Depending on if we are talking about academics or social strictness, the rating would change.",
            "Author": "College Junior",
            "Date": "2014-04-08T01:39:42Z"
        },
        {
            "Rating": 5,
            "Review": "We don't feel like we are confined when it comes to our social lives. The amnesty policy helps people get help if they need it.",
            "Author": "College Sophomore",
            "Date": "2014-03-25T17:26:05Z"
        },
        {
            "Rating": 5,
            "Review": "We have sororities, fraternities, final clubs, and many other clubs that create a diverse social atmosphere on campus. There is also a lot of diversity in fashion, from boho to preppy to edgy.",
            "Author": "College Sophomore",
            "Date": "2014-03-25T17:24:38Z"
        },
        {
            "Rating": 5,
            "Review": "There is an incredible amount of diversity at Harvard, a fact that is evident in many of the clubs and organizations devoted to the celebration of such diversity and bringing together or like-minded individuals.",
            "Author": "College Sophomore",
            "Date": "2014-03-25T17:22:41Z"
        },
        {
            "Rating": 4,
            "Review": "Harvard consistently does well in the Ivies, and there's always a lot of crimson pride repping at games, especially Harvard-Yale every year.",
            "Author": "College Sophomore",
            "Date": "2014-03-25T17:15:20Z"
        },
        {
            "Rating": 3,
            "Review": "Student involvement in athletics is high, but athletics aren't a big part of campus life. At times, school spirit is lacking.",
            "Author": "College Freshman",
            "Date": "2014-03-14T13:27:43Z"
        },
        {
            "Rating": 5,
            "Review": "The administration is more than fair. They are more concerned with the safety and well-being of the student body.",
            "Author": "College Freshman",
            "Date": "2014-03-14T13:26:05Z"
        },
        {
            "Rating": 4,
            "Review": "Overall, the student body is very accepting and tolerant. But, like anywhere else, there are always exceptions and sometimes those exceptions are very vocal.",
            "Author": "College Freshman",
            "Date": "2014-03-14T13:24:16Z"
        },
        {
            "Rating": 5,
            "Review": "There are students from all over and everyone is pretty respectful.",
            "Author": "Recent Alumnus",
            "Date": "2014-03-10T21:16:53Z"
        },
        {
            "Rating": 4,
            "Review": "No problems, even with underage drinking. Use common sense.",
            "Author": "Recent Alumnus",
            "Date": "2014-03-10T21:16:04Z"
        },
        {
            "Rating": 3,
            "Review": "Harvard's Greek presence is small but growing. Many organizations don't have their own housing, which makes it hard to achieve the Greek culture that exists on other campuses.",
            "Author": "Recent Alumnus",
            "Date": "2014-03-10T21:05:36Z"
        },
        {
            "Rating": 3,
            "Review": "People are pretty accepting. there are many different people",
            "Author": "College Junior",
            "Date": "2014-02-24T00:07:34Z"
        },
        {
            "Rating": 5,
            "Review": "HUPD is literally the best thing on the planet. Literally everyone wants to hang out with HUPD. They're all super nice, funny, willing to help. The Amnesty Policy is amazing — if you or a friend has over-imbibed, you can take them to UHS or call HUPD to take care of them with no risk of getting in trouble. Goes to show that student safety takes priority over needless disciplinary action.",
            "Author": "College Freshman",
            "Date": "2014-02-16T15:45:11Z"
        },
        {
            "Rating": 4,
            "Review": "Wicked diverse. Everyone has a different background. Obviously you're gonna get the waspy New Englanders and SoCal kids, but that's part of the diversity.",
            "Author": "College Freshman",
            "Date": "2014-02-16T15:43:03Z"
        },
        {
            "Rating": 5,
            "Review": "Somehow, Harvard's sports are kinda sick. Crew is perennial national champs, basketball is killin it, squash is ridiculous, football is Ivy League champs — not bad at all. Lots of fun to attend the big events (e.g. Harvard-Yale football game, squash nationals, Head of the Charles, etc.). Facilities are wicked nice and under constant renovation to make them nicer.",
            "Author": "College Freshman",
            "Date": "2014-02-16T15:31:21Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard is super diverse. Just my group of close friends comes from all over the US and several different foreign countries. Everyone is pretty accepting of each other, and willing to learn from other people's viewpoints instead of putting them down when they disagree.",
            "Author": "College Freshman",
            "Date": "2013-12-28T16:56:37Z"
        },
        {
            "Rating": 4,
            "Review": "We're division 1, but varsity sports don't rule the school, which I think is a good thing. I don't know much about the club sports but I think the intramurals get big after freshman year. There are several gyms available for anyone to use (I use the law school gym for example) and they're really nice, with great hours.",
            "Author": "College Freshman",
            "Date": "2013-12-28T16:54:48Z"
        },
        {
            "Rating": 3,
            "Review": "We arent a big athletic school like USC but we do have great varsity facilities that are world renowned. I mean just google Harvard Stadium and gape in awe.",
            "Author": "College Sophomore",
            "Date": "2013-12-01T13:32:00Z"
        },
        {
            "Rating": 4,
            "Review": "You will meet fascinating people from all over the world. You will learn so much from them in addition to great classes.",
            "Author": "College Sophomore",
            "Date": "2013-12-01T13:30:35Z"
        },
        {
            "Rating": 3,
            "Review": "We do not have Frats or sorority houses but have groups of people that belong to them. We also have these things called Final Clubs which are similar. They are male and female final clubs that have a house to socialize and have events but you dont live there. They are pretty exclusive.",
            "Author": "College Sophomore",
            "Date": "2013-12-01T13:29:05Z"
        },
        {
            "Rating": 4,
            "Review": "It is better than other schools I have been to",
            "Author": "College Sophomore",
            "Date": "2013-12-01T13:17:21Z"
        },
        {
            "Rating": 5,
            "Review": "People here come from all different backgrounds.  There is a noticeably large number of white, rich, American students, but they are becoming fewer and further between.",
            "Author": "College Freshman",
            "Date": "2013-11-20T21:33:21Z"
        },
        {
            "Rating": 4,
            "Review": "Harvard trusts us.  There are some rules about alcohol in freshman dorms (as long as you aren't loud you're fine), and there is absolutely no supervision in the Houses once you're an upperclassmen.",
            "Author": "College Freshman",
            "Date": "2013-11-20T21:29:10Z"
        },
        {
            "Rating": 3,
            "Review": "The administration is good about enforcing rules that better the community in some shape or form. Drinking isn't allowed in freshman dorms, but they are relatively chill about it in upperclassman dorms. It is very easy to get ahold of alcohol, but the administration makes sure that students know how to do it safely should they choose to or where to go/what to do when things go wrong.",
            "Author": "College Freshman",
            "Date": "2013-11-04T19:23:36Z"
        },
        {
            "Rating": 2,
            "Review": "There's something for everyone, just don't miss hanging out with all the different cool people.",
            "Author": "College Junior",
            "Date": "2013-11-01T17:42:39Z"
        },
        {
            "Rating": 4,
            "Review": "Harvard has the resources to makes sure it creates as diverse an environment as possible, and the campus actively works to celebrate, discuss, and accommodate people of all different.",
            "Author": "College Junior",
            "Date": "2013-11-01T17:34:01Z"
        },
        {
            "Rating": 1,
            "Review": "Greek life is purely for a dedicated social organization here. They all have their own houses that maybe 6-8 people will live in every semester, but the houses are mainly for hanging out in and partying in. People don't care if you are in the Greek system or not. A lot of people kind of see it as a social system they would never want to be a part of either due to \"bro-ness,\" the idea of essentially paying to hang out with people, or because the Greek system often supports societal systems that they find personally perturbing. Some people also really like the idea of sororities and fraternities. But even with all of that no one cares what you do after you've joined. Everyone I know that's in one is happy with it, and in the end that's all anyone else cares about.",
            "Author": "College Junior",
            "Date": "2013-11-01T17:09:09Z"
        },
        {
            "Rating": 2,
            "Review": "Sports here don't matter except for one game a year - The Game. It's the weekend we play against Yale, and literally the entire school goes. When it's at Yale the school provides buses and then entire student body (not to mention several generations of alumni) goes to New Haven for the weekend to tailgate and trash talk. When The Game is at Harvard same thing, but all the Yale students come to our campus.",
            "Author": "College Junior",
            "Date": "2013-11-01T16:49:53Z"
        },
        {
            "Rating": 3,
            "Review": "It really depends what crowd you find yourself in. The final club/more social crowd is definitely rated as an \"A\" but the typical Harvard student is about average.",
            "Author": "College Sophomore",
            "Date": "2013-09-26T15:28:46.737Z"
        },
        {
            "Rating": 4,
            "Review": "Better not get caught with drugs! But drinking strictness is relaxed.",
            "Author": "College Senior",
            "Date": "2013-08-25T19:50:06.467Z"
        },
        {
            "Rating": 3,
            "Review": "The Amnesty Policy regarding alcohol is fair if you don't abuse it.",
            "Author": "College Junior",
            "Date": "2013-07-18T18:22:15.233Z"
        },
        {
            "Rating": 4,
            "Review": "The expect us to behave like the adults that we are, and for the most part, it happens",
            "Author": "College Freshman",
            "Date": "2013-05-20T16:12:33.55Z"
        },
        {
            "Rating": 4,
            "Review": "Students are polished and ambitious, not to mention well-rounded.",
            "Author": "Recent Alumnus",
            "Date": "2013-05-06T20:47:28.567Z"
        },
        {
            "Rating": 4,
            "Review": "I think the policies in place are very fair and upheld in a fair manner as well.",
            "Author": "Recent Alumnus",
            "Date": "2013-05-06T20:45:38.18Z"
        },
        {
            "Rating": 3,
            "Review": "The police choose what they want to deal with rather than what they are required to deal with. When it comes to noise control, they don't care. When it comes to gunman on the loose, they are right there. The issue here is that they should care about both.",
            "Author": "College Senior",
            "Date": "2013-03-30T20:21:38.86Z"
        },
        {
            "Rating": 5,
            "Review": "Varsity sports at Harvard University are pretty huge, especially the way campus treats us. We have wonderful training and workout facilities, including our own trainers, psychologists, and academic advisers. IM sports are pretty huge, too, because anyone can play. We have some pretty diverse ones, too, though I'm not really sure how popular inner tube water polo is.",
            "Author": "College Sophomore",
            "Date": "2013-01-04T10:42:10.51Z"
        },
        {
            "Rating": 3,
            "Review": "It's strict as a freshman, but as soon as you move out of the yard things become much more lenient. The campus alcohol policy is fair and the security guards and police are great. It's really just freshman dorms that are really strict.",
            "Author": "College Freshman",
            "Date": "2012-12-17T11:36:10.763Z"
        },
        {
            "Rating": 5,
            "Review": "There is an amazing amount of diversity at Harvard. This is most likely due to the fact that this is a very well-known university but I have met people from all around the world (my roommates and closest friends are from all corners of the earth such as India, Sri Lanka, Sweden, Tanzania, and much more). Of course the number of international and different ethnicity students don't outnumber the \"white american\" population. Most of the students, regardless of religion, ethnicity, sexual orientation, political beliefs are open minded about other cultures and also love the amount of diversity that Harvard provides. Harvard also has amazing financial aid support so there are students from so many different economic situations that no one would ever feel isolated due to their economic background.",
            "Author": "College Sophomore",
            "Date": "2012-10-08T04:45:22.687Z"
        },
        {
            "Rating": 4,
            "Review": "Sports Are Just Part of the Picture – Athletes are included in everything on campus and are really just some of the talented people among the students here. They are not seen as super stars, but often they appreciate feeling mainstream.",
            "Author": "College Sophomore",
            "Date": "2012-08-13T12:46:42.643Z"
        },
        {
            "Rating": 2,
            "Review": "Barely Exists – There are 3 sororities and 3 fraternities on campus. None of them have residential houses and one fraternity is the only Greek organization with property in the square. Many of the frats and sororities rent spaces in the square for meetings that barely hold all of the members. They are a good outlet for making new friends and for parties and mixers, however final clubs dominate the social scene more than frats/sororities.",
            "Author": "College Senior",
            "Date": "2012-05-15T15:36:27.96Z"
        },
        {
            "Rating": 4,
            "Review": "The great thing about athletics at Harvard is that they do not give out scholarships solely for athletic ability.  Students must excel at academics first, with sports as a worthwhile extracurricular activity which may or may not be varsity.  Physical fitness is stressed on campus, but not as a business which trumps education.  I would prefer that athletic facilites (gyms, tracks, etc.) be more accessible to the wider student body at lower prices, but otherwise, I'm quite happy with the program.",
            "Author": "College Sophomore",
            "Date": "2012-05-06T14:50:49.177Z"
        },
        {
            "Rating": 3,
            "Review": "Fairly Safe People Tend to Be Responsible Enough for Themselves – Stay to the lit paths and be ethical and sensible and you will be fine.",
            "Author": "Recent Alumnus",
            "Date": "2012-04-24T16:07:54.01Z"
        },
        {
            "Rating": 5,
            "Review": "Citizens of the World on Campus – Harvard University is able to bring to its campus some of the best students from all over the world.  When I returned for the 30th anniversary of the African American Studies Dept and the Gospel Choir, Kumba Singers, I was surprised to see that the choir started when I was there and a member of predominantly black students now had whites, Asians, blacks and every kind of person singing gospel music.",
            "Author": "Recent Alumnus",
            "Date": "2012-04-10T19:48:17.34Z"
        },
        {
            "Rating": 4,
            "Review": "While there are occasional single-incident problems, usually related to social issues rather than direct prejudice or discrimination, Harvard is pretty calm and tolerant of all people from all backgrounds. There's large international student community, and those from the US are from every corner of the country with immensely different backgrounds and circumstances. Over all, a very easy-going environment for any kind of person/background.",
            "Author": "Recent Alumnus",
            "Date": "2012-04-03T09:46:58.973Z"
        },
        {
            "Rating": 3,
            "Review": "No Greek, All Elite – There isn't a huge greek life scene, but the social events are dominated by Final Clubs, which throw similar parties involving a lot of drinking and generally expected debauchery!",
            "Author": "Recent Alumnus",
            "Date": "2012-04-03T09:39:49.297Z"
        },
        {
            "Rating": 3,
            "Review": "Go Crimson! Sporting events are not particularly well attended, and not all of our teams shine through.  But when they do, we're there!",
            "Author": "College Freshman",
            "Date": "2012-03-22T15:45:45.04Z"
        },
        {
            "Rating": 3,
            "Review": "There are definitely plenty of nerds, both guys and girls, but also some very fashionable dressers and people who do seem to care more about looking good for class and parties than studying...",
            "Author": "Recent Alumnus",
            "Date": "2012-02-28T14:05:48.81Z"
        },
        {
            "Rating": 4,
            "Review": "really not so bad, just study and don't do dumb things",
            "Author": "College Student",
            "Date": "2012-01-11T18:06:50.887Z"
        },
        {
            "Rating": 3,
            "Review": "Getting There – Football and basketball are on the rise this year! Crew and squash are the only teams that consistently do well, though.",
            "Author": "College Freshman",
            "Date": "2011-12-28T14:00:43.527Z"
        },
        {
            "Rating": 5,
            "Review": "Absolutely phenomenal - Harvard has the money to attract students of all sorts of backgrounds, economic or ethnic, and being with this diverse group of students has really opened my eyes to the different conditions people come from.",
            "Author": "College Freshman",
            "Date": "2011-12-28T14:00:07.99Z"
        },
        {
            "Rating": 3,
            "Review": "Sports teams get lots of resources (aka money), but the quality of the team and coaches depends a lot on the sport.  Also, the culture of Harvard is that \"coolness\" depends on things other than athletic prowess, which I think is a shocker for some of the athletes.  Here you're cool if you're smart and successful.  Athletes have to work really hard to get great grades and still keep up with their sports.  We have a great women's hockey team, men's basketball team, crew teams, etc.  Don't come to Harvard for volleyball.  I'm not really familiar with the other sports.  Don't come to Harvard if you want to go pro, but do come if you want to play sports in college and then go into a different profession.",
            "Author": "College Senior",
            "Date": "2011-12-15T02:18:40.337Z"
        },
        {
            "Rating": 3,
            "Review": "It's harvard. They want to preserve the pristine campus.",
            "Author": "College Sophomore",
            "Date": "2011-06-24T11:58:31.733Z"
        },
        {
            "Rating": 3,
            "Review": "It's There – It's there, it's fun, it's big, it's successful. That's most students' attitude--acknowledging the existence of sports on campus, but not having enough time to actually participate ( as an athlete or spectator ( unless you're on a team of course, in which case good luck))",
            "Author": "College Sophomore",
            "Date": "2011-06-24T11:57:19.817Z"
        },
        {
            "Rating": 3,
            "Review": "There are students of almost every race, ethnicity, religion, and background here. As with many schools, a fair amount of students are white, but when walking around campus, you easily all different types of people.",
            "Author": "College Sophomore",
            "Date": "2011-02-16T17:08:39.187Z"
        },
        {
            "Rating": 5,
            "Review": "There are many kinds of sport facilities at Harvard, at campus there are sport courts and students can use them every day. I think it is a great oppurtunity to relax after lessons",
            "Author": "College Student",
            "Date": "2011-02-11T04:53:07.217Z"
        },
        {
            "Rating": 3,
            "Review": "Great Niche Sports – Not a big deal here except for the Harvard-Yale Football Game.",
            "Author": "College Freshman",
            "Date": "2011-02-01T16:46:20.203Z"
        },
        {
            "Rating": 4,
            "Review": "What Should It Matter? Contrary to the stereotype, all Harvard students aren't weak, preppy geeks. It's hard to place a general image on the \"typical\" girl or guy because the students are so diverse. There are pretty gorgeous girls on campus. Some guys are hot, but most are average or could use improvement. A good percentage are gay, so if you're a straight girl looking for some lovin' you might have to do some digging. In any case, everyone is interesting and has a distinct passion. Most are dedicated to studies, and the parties and drinking will begin Thursday the most. Extracurriculars are given good priority. Great cafes and places to hide in around Harvard Square.",
            "Author": "College Freshman",
            "Date": "2011-01-08T15:03:12.1Z"
        },
        {
            "Rating": 2,
            "Review": "Finals Clubs – Technically, Greek life is limited to a few off-campus sororities that don't really have a presence in the social scene. However, the Finals Clubs essentially take the place of Greek life. They're pretentious, exclusive (often likened to \"good old boys' clubs\"), and much-criticized by the feminist groups (they only admit men.) Of course, freshman girls are encouraged to come to parties. I know people who do go to their parties every weekend, but I'd say the majority of the Harvard community doesn't.",
            "Author": "College Freshman",
            "Date": "2010-10-14T07:52:50.993Z"
        },
        {
            "Rating": 5,
            "Review": "College Is Freedom – Rules and laws are bent and broken with regularity - and few people get hurt",
            "Author": "College Junior",
            "Date": "2010-07-30T17:36:04.793Z"
        },
        {
            "Rating": 3,
            "Review": "Not Enough Spirit – Our teams are quite competitive in a lot of Ivy League sports, but too few students get out to support the teams.",
            "Author": "College Junior",
            "Date": "2010-07-30T17:34:54.33Z"
        },
        {
            "Rating": 3,
            "Review": "Greek life is there, but it's definitely not as prominent as on other campuses. There are about four fraternities and three sororities. There is only one frat house. \"Final Clubs\" dominate our party scene, which are similar to fraternities but are much older and more pretentious.",
            "Author": "College Sophomore",
            "Date": "2010-07-19T20:54:21.323Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard's greatest asset is its people. Students and faculty represent every race, ethnicity, creed - I have met so many people that I would never have met if I stayed in my small town!",
            "Author": "College Sophomore",
            "Date": "2010-07-19T20:50:18.813Z"
        },
        {
            "Rating": 3,
            "Review": "So and So – People got in here for their brains, not beauty. The 10% of students who are wealthy legacies or athletes tend to look very attractive, but the vast majority are average to ugly. The few bombshells are invariably shallow and conceited, as well as remarkably vapid.",
            "Author": "College Sophomore",
            "Date": "2010-05-30T16:06:19.977Z"
        },
        {
            "Rating": 3,
            "Review": "Girls Are Bad – It is hard to find a good looking girl who can hold a conversation",
            "Author": "College Freshman",
            "Date": "2010-05-18T05:11:38.683Z"
        },
        {
            "Rating": 5,
            "Review": "Very Integrated Compared to Other Schools. Students come from all socio economic backrounds and all parts of the world",
            "Author": "College Freshman",
            "Date": "2010-05-18T05:10:51.367Z"
        },
        {
            "Rating": 3,
            "Review": "Parties Are Go, School's Not a Game – The Administrative Board, the entity that currently determines the fate of students not meeting academic standards or otherwise breaking campus rules, can be kind of shady, but that's currently going under review. Parties need to be registered in advance, but an unregistered party will just get shut down without any real consequences. Theoretically underage drinking can be punished, but this is usually enforced mainly in the freshman dorms. There's also an amnesty policy at the University hospital so that drunk students and their friends who go there for help won't get into any disciplinary trouble for it. The most important thing is just not to do anything academically dishonest and try to keep your grades up, because the Ad Board nearly always tells a student being disciplined to take a year off (and work/do something deep while on leave).",
            "Author": "College Junior",
            "Date": "2010-05-07T12:26:52.317Z"
        },
        {
            "Rating": 3,
            "Review": "Not Bad, but No Attention – Within the Ivy League, Harvard does very well for itself. That said, it's not a sports-oriented school, and compared to other universities is definitely the small fish in the ocean. The one big sports event that brings everyone together is the Harvard/Yale football game. Other than that, it's pretty rare for a sports event to get much attention from the student body at large.",
            "Author": "College Junior",
            "Date": "2010-05-07T12:07:32.923Z"
        }
    ],
    "Academics": [
        {
            "Rating": 5,
            "Review": "You have the best of the best here all leaders in there field that are doing incredible things. You also have endless options of what you want to do and study.",
            "Author": "College Senior",
            "Date": "2016-09-07T21:46:36Z"
        },
        {
            "Rating": 5,
            "Review": "Professors are always experts in their field and the TAs are super helpful and kind as well.",
            "Author": "College Freshman",
            "Date": "2016-01-04T22:17:33Z"
        },
        {
            "Rating": 5,
            "Review": "The academics are absolutely fantastic. They vary, of course, depending on student choice. Many students take only bland huge introductory lecture classes and then complain about how they've never met their professors. However, there are literally thousands of options of the beaten path for small seminar classes in countless areas. I have tried to take as many of these as possible, and my average class size has been about five. Going to dinner at professors' houses is not uncommon, and the vast majority of professors put a lot of time into getting to know students. Every professor holds generous office hours, so any complaint that professors are inaccessible generally rests with the student. After my two-person class last year, which often went hours over, we sometimes went for drinks. Students and professors seem to be parts of the same community, not separate entities. I highly recommend putting at least two small and obscure classes on your schedule every term. Overall, Harvard's academics lives up to its name.",
            "Author": "College Sophomore",
            "Date": "2016-01-03T16:41:03Z"
        },
        {
            "Rating": 4,
            "Review": "I'm learning about relevant topics.",
            "Author": "College Sophomore",
            "Date": "2015-12-29T17:35:32Z"
        },
        {
            "Rating": 5,
            "Review": "Tough academics that really push you. The workload depends on what classes you take, but generally, the workload can be pretty heavy. Shopping week for actually being able to sit in on classes before you register for them is really useful.",
            "Author": "College Freshman",
            "Date": "2015-12-29T16:32:16Z"
        },
        {
            "Rating": 5,
            "Review": "Great internship opportunities, excellent course availability.",
            "Author": "College Junior",
            "Date": "2014-08-04T19:15:29Z"
        },
        {
            "Rating": 4,
            "Review": "No select criteria per major, everyone just applies to the college.",
            "Author": "College Junior",
            "Date": "2014-08-04T19:15:29Z"
        },
        {
            "Rating": 5,
            "Review": "The classes can be small seminars or large lectures, depending on your preference, as both are offered. The professors are incredible and you rarely meet one who is not interested in actually teaching and getting to know you. Office hours are a must. The work load is generally quite manageable and rarely will you find that you actually need to do all the reading assigned; this varies major to major though.",
            "Author": "College Junior",
            "Date": "2014-08-04T18:10:25Z"
        },
        {
            "Rating": 5,
            "Review": "The government major is one of the largest offered on campus and there is a plethora of resources available and no shortage of classes. I have never not gotten into a class I have truly wanted; often begging a professor is all it takes if you miss the lottery. The work load is not too bad, as long as you accept that you will never do all the readings. And the professors do not expect you to - literally! I have had professors actually say that you should pick the more important readings and start from there. What makes this major amazing at Harvard is the availability of graduate classes to the undergrads, with access to both the law school and the Kennedy school of government.",
            "Author": "College Junior",
            "Date": "2014-08-04T18:10:25Z"
        },
        {
            "Rating": 5,
            "Review": "Amazing professors, great variety of classes to take.  The classes are quite hard, and despite claims that everyone here gets an A, you have to work diligently in order to do well.",
            "Author": "College Sophomore",
            "Date": "2014-07-15T20:00:42Z"
        },
        {
            "Rating": 5,
            "Review": "If you major in humanities you automatically get more attention because not many people major in humanities. Most departments are small and friendly.",
            "Author": "College Sophomore",
            "Date": "2014-06-30T06:16:49Z"
        },
        {
            "Rating": 5,
            "Review": "Special concentrations and are plethora of libraries are two of my favorite academic offerings.",
            "Author": "College Sophomore",
            "Date": "2014-06-30T06:16:49Z"
        },
        {
            "Rating": 5,
            "Review": "Tons! although there are lots of requirements for each one",
            "Author": "College Sophomore",
            "Date": "2014-06-09T22:41:38Z"
        },
        {
            "Rating": 5,
            "Review": "You don't have to apply like at other schools.  You just choose, unless you're doing social studies.",
            "Author": "College Sophomore",
            "Date": "2014-06-09T22:26:57Z"
        },
        {
            "Rating": 5,
            "Review": "It's Harvard.  Everything you could dream of is here if you look for it and aren't afraid to ask.  It can be difficult but so worthwhile.",
            "Author": "College Sophomore",
            "Date": "2014-06-09T22:25:24Z"
        },
        {
            "Rating": 5,
            "Review": "It's Harvard... and it lives up to its reputation 100%",
            "Author": "College Sophomore",
            "Date": "2014-06-09T22:25:24Z"
        },
        {
            "Rating": 5,
            "Review": "Super easy to switch between majors. I love it!",
            "Author": "College Freshman",
            "Date": "2014-04-28T11:07:52Z"
        },
        {
            "Rating": 4,
            "Review": "I have not been in an internship yet but there are plenty of opportunities and i have heard nothing but great things from other people who have taken internships.",
            "Author": "College Freshman",
            "Date": "2014-04-28T11:07:52Z"
        },
        {
            "Rating": 4,
            "Review": "The program is small but caring, and the courses are diverse and informative.  There is much to be done about accommodations for students with underlying disabilities/illnesses.",
            "Author": "College Freshman",
            "Date": "2014-04-08T21:11:54Z"
        },
        {
            "Rating": 5,
            "Review": "I have actually just been accepted to study abroad through Harvard. They offer programs in Scandanavia, Japan, Italy, etc. and provide a diverse curriculum in all. Economics is a very popular concentration, as well as Government and Psychology.",
            "Author": "College Sophomore",
            "Date": "2014-03-25T17:20:57Z"
        },
        {
            "Rating": 3,
            "Review": "There are very diverse majors offered, however, other majors like business management or supply chain and logistics for example that might translate directly to the job field are not offered.",
            "Author": "College Sophomore",
            "Date": "2014-03-25T17:18:06Z"
        },
        {
            "Rating": 5,
            "Review": "No admissions criteria. Just be interested in the subject.",
            "Author": "Recent Alumnus",
            "Date": "2014-03-10T21:14:56Z"
        },
        {
            "Rating": 4,
            "Review": "East Asian Studies is a strong program at Harvard. The language classes were amazing and the course offerings were varied and broad.",
            "Author": "Recent Alumnus",
            "Date": "2014-03-10T21:08:09Z"
        },
        {
            "Rating": 4,
            "Review": "It not only offers the intellectual stimulation I am looking for, it offers courses taught by Harvard professors that are looking to expand their students minds.  It is the stepping-stone I need in order to reach my goal of someday becoming the excellent doctor I hope to be.",
            "Author": "College Junior",
            "Date": "2014-02-24T00:03:52Z"
        },
        {
            "Rating": 5,
            "Review": "There is an unlimited availability of all areas of academics. The world is open to you for whatever.",
            "Author": "College Sophomore",
            "Date": "2013-12-01T13:38:48Z"
        },
        {
            "Rating": 5,
            "Review": "It is Harvard. Being world-renowned is no joke.",
            "Author": "College Sophomore",
            "Date": "2013-12-01T13:38:48Z"
        },
        {
            "Rating": 3,
            "Review": "I love all of my professors and classes, and my workload is DEFINITELY manageable -- if you were near the top of your class in high school (which most people here were) then you will, for the most part, have enough time to do your work.  There is definitely more work here than in high school (and I went to a pretty competitive high school), but you're in class for so many fewer hours that it's not so bad.  It's all about time management. One problem with classes here is that many big classes are taught by TF's (our version of TA's), so it can be hard to get face time with the professor.  Once you get to upper level classes, however, class size shrinks dramatically.",
            "Author": "College Freshman",
            "Date": "2013-11-20T18:43:40Z"
        },
        {
            "Rating": 4,
            "Review": "Harvard's academics are the best. Shopping Period is great.",
            "Author": "College Junior",
            "Date": "2013-11-01T17:31:58Z"
        },
        {
            "Rating": 4,
            "Review": "I'm a Joint Major\r\nThe East Asian Studies department is perhaps the top in the country. They have the largest collection of literature on East Asia outside of the Asian continent. They have anything ranging from obscure Chinese films from the 1920's to original scrolls from the Ming Dynasty, to modern Japanese anime. Workload can be heavy but manageable, and it's always with really knowledgeable and passionate professors. The Mandarin language classes are really far away. \r\n\r\nThe Social Anthropology department is also pretty good. A few classes can be a little aggravatingly unstructured or ambiguous in nature, but without fail the professor will be interesting and fantastic. Also all of the teachers have written some of the most popular ethnographic texts of our time.",
            "Author": "College Junior",
            "Date": "2013-11-01T17:31:57Z"
        },
        {
            "Rating": 5,
            "Review": "It has been rated the top academic university in the world since ARWU started ranking them.  Academics are the best thing about Harvard.  People envy the class registration / shopping period process.  Classes are rigorous.",
            "Author": "College Sophomore",
            "Date": "2013-08-25T17:27:54.84Z"
        },
        {
            "Rating": 3,
            "Review": "I'm an econ concentrator and there are complaints about that department since it's so big and students get lost in it.  But internships and post-college jobs are very gettable.  Academic advising at Harvard is great.",
            "Author": "College Sophomore",
            "Date": "2013-08-25T17:24:57.997Z"
        },
        {
            "Rating": 4,
            "Review": "Academics at Harvard are excellent. The work is challening and demanding even for exceptionally well prepared students. It is not a place for the the feint of heart.",
            "Author": "College Senior",
            "Date": "2013-06-28T17:27:40.883Z"
        },
        {
            "Rating": 5,
            "Review": "Extremely difficult program, but taught by world leaders in their respective fields.",
            "Author": "College Student",
            "Date": "2013-06-08T23:57:08.593Z"
        },
        {
            "Rating": 4,
            "Review": "While the academics are certainly very challenging, I feel that I can hold my own in the classes. Even though I didn't have a perfect GPA or perfect SAT score in high school, I still feel prepared and am really getting the most out of my classes.",
            "Author": "College Freshman",
            "Date": "2013-05-31T22:32:21.57Z"
        },
        {
            "Rating": 4,
            "Review": "I've had a few unpaid political internships, which I felt have been great! However, the search for internships each year can always be a bit stressful.",
            "Author": "College Freshman",
            "Date": "2013-05-31T22:31:03.273Z"
        },
        {
            "Rating": 5,
            "Review": "There are a multitude of concentrations (majors) in as many academic fields as you could imagine! I love that Harvard does not only offer courses in \"traditional\" fields, but really allows students to find their own niches!",
            "Author": "College Freshman",
            "Date": "2013-05-31T22:25:00.367Z"
        },
        {
            "Rating": 4,
            "Review": "While the application itself was very simple (optional essay question, etc.), the idea of applying to Harvard was, in itself, a bit stressful. Other than that, I don't think I encountered any obstacles in the application process...it's all about sending in your application and crossing your fingers!",
            "Author": "College Freshman",
            "Date": "2013-05-31T22:15:57.563Z"
        },
        {
            "Rating": 5,
            "Review": "The academics are great with the professors being top-notch. Workload can vary from class to class, but is manageable overall.",
            "Author": "College Sophomore",
            "Date": "2013-05-22T10:03:56.917Z"
        },
        {
            "Rating": 4,
            "Review": "The professors are top-notch, oftentimes, however, classes are very large and teaching fellows can vary in quality.",
            "Author": "College Sophomore",
            "Date": "2013-05-22T09:55:52.58Z"
        },
        {
            "Rating": 5,
            "Review": "Although there is a lot of work, you learn so much in such a short period of time.  The professors are world class and most are really great lecturers and teachers.  Everybody loves whatever major they choose, because they are all great.",
            "Author": "College Freshman",
            "Date": "2013-05-18T12:30:37.057Z"
        },
        {
            "Rating": 5,
            "Review": "I am thrilled I was accepted to Harvard.  Now the work begins and I am looking forward to that but concerned about financing one year of school.",
            "Author": "Recent Alumnus",
            "Date": "2013-04-15T10:37:55.223Z"
        },
        {
            "Rating": 5,
            "Review": "The process of applying for admission to Harvard University was easy. \r\nWhat made the process easy was my resume/application which I have \r\nbeen \"building\" since my undergraduate work and job experience. \r\nApplying to a school has not been a single action, it has been years of \r\nstudying, receiving awards, job experience and so on.",
            "Author": "Recent Alumnus",
            "Date": "2013-04-15T10:35:51.78Z"
        },
        {
            "Rating": 5,
            "Review": "I have not arrived at Harvard University yet to begin my studies but having a specific program is necessary to my occupation as an educator.",
            "Author": "Recent Alumnus",
            "Date": "2013-04-15T10:33:09.507Z"
        },
        {
            "Rating": 5,
            "Review": "I have already had a student internship at the University of Wisconsin Madison which was successful.  My job experience has included five years of teaching music and I am ready to study educational policy and earn a masters degree.",
            "Author": "Recent Alumnus",
            "Date": "2013-04-15T10:27:48.643Z"
        },
        {
            "Rating": 5,
            "Review": "Unparalleled. Incredibly talented professors and students. Very rigorous, but definitely doable if you manage your time appropriately.",
            "Author": "College Freshman",
            "Date": "2013-01-01T14:30:27.197Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard is at the forefront of the field of economics in every way. 7 of the top 24 most cited economists in the world are on the staff, and if you want to you can attend lectures by and even speak to any one of them. As a freshman I had a small seminar with a former chair of the council of Economic Advisors to President Bush (the 21st ranked economist in the world by citations), and Harvard advanced intermediate courses (1011a and 1011b) are among the most difficult and advanced in the country for Sophomores. Harvard is candyland for aspiring economists.",
            "Author": "College Junior",
            "Date": "2012-08-28T16:36:41.81Z"
        },
        {
            "Rating": 5,
            "Review": "World Class professors, classmates, resources, and facilities. However, it is easy to get through Harvard taking easy classes and not challenging yourself. It is very easy to get a B+ and difficult to get an A or a C. \r\nHarvard College is a liberal arts undergraduate program, meaning there is no business, marketing, communications, accounting, finance major or concentration. There are a diversity of programs and the option for independent or special concentrations if a subject area isn't available. (One noticeably absent undergraduate concentration is Urban Planning or Architecture and this is usually a \"special concentration\" based on Graduate School of Design classes). The graduate schools are a great resource for undergrads, and you can take classes at many of them as an upperclassman.",
            "Author": "College Senior",
            "Date": "2012-05-15T15:23:18.41Z"
        },
        {
            "Rating": 3,
            "Review": "A Pretty Standard System of Major Declaration – Each student declares majors at the end of the fall semester of sophomore year by submitting an application and coming up with a class schedule for the next two and a half years.  I have never heard of one of these applications being turned down, and in the event that your essay or schedule leaves something to be desired, they will work with you to improve it.  I would suggest getting advice from members of the department beforehand to avoid that kind of hassle later on.",
            "Author": "College Freshman",
            "Date": "2012-05-14T16:08:51.37Z"
        },
        {
            "Rating": 5,
            "Review": "A Great Network of Connections Opens up Some Amazing Internship Opportunities – As a rising sophomore, I have not yet experienced an internship through Harvard, however their well-connected alumni network is well know to give some incredible internships to Harvard students.  While rising sophomore internships (the summer before sophomore year) are largely unpaid, most students are usually able to later procure paid internships.",
            "Author": "College Freshman",
            "Date": "2012-05-14T16:03:42.307Z"
        },
        {
            "Rating": 4,
            "Review": "Excellent Experience – Holistic, totally involved experience with the top students and professors in the world.",
            "Author": "College Sophomore",
            "Date": "2012-05-09T09:26:10.75Z"
        },
        {
            "Rating": 4,
            "Review": "African American Studies 40 Years Ago – I entered Harvard University in 1969, after Martin Luther King, Jr. had been assassinated that spring. Our class had the largest number of African American students up to that point.  Our demonstrations led to the establishment of the African American Studies Dept.  I majored in this this department with its emphasis on both African and African American history, politics, sociology and literature.  The Harvard/Radcliffe African American Cultural Center was established at the same time as the Department, and provided a summer job for me the summer after my junior year.  I have only revisited Harvard once since I graduated for the occasion of the 30th anniversary of the Department.  I am sure much has changed in the interim.",
            "Author": "Recent Alumnus",
            "Date": "2012-04-10T19:41:56.003Z"
        },
        {
            "Rating": 3,
            "Review": "Poor felicities in semiconductor labs. Most of the terminals were always occupied. You have to make prior appointment for getting a terminal and that too lasted for just one hour.",
            "Author": "Recent Alumnus",
            "Date": "2011-07-14T08:59:40.97Z"
        },
        {
            "Rating": 4,
            "Review": "Visual Arts Dept. Has a Lot of Perks – Being a Visual Arts major at Harvard has its good and bad parts.  The best part is that all of the art supplies that you use in the class are provided and completely FREE! Also, if you are a senior, the department covers the costs of producing your thesis.  No other art school that I know of provides free supplies or thesis funding. Your classroom is your studio space which can be used any day of the week, which is also a plus.  The classes are small in size (no more than 12 students), but this also means that it's hard to secure a spot in them.  The department is very small, which gives it a personal feel, but is also limiting in the choices of courses offered, and the range of art techniques taught.",
            "Author": "Recent Alumnus",
            "Date": "2011-07-10T16:17:24.263Z"
        },
        {
            "Rating": 5,
            "Review": "Foreign Languages – The foreign languages at Harvard are beyond excellent. The faculty are very well qualified, and the 1:1 attention is truly amazing. Students also really enjoy the courses and gain confidence in speaking the language to native speakers.",
            "Author": "College Sophomore",
            "Date": "2011-07-04T16:51:22.5Z"
        },
        {
            "Rating": 5,
            "Review": "What You Would Expect – Way too many courses to fathom. Students are very competitive. Classes are hard not because the material is hard but because everyone else is studying very hard. If you want to learn, this is the place. Just be ready to study...a lot.",
            "Author": "College Sophomore",
            "Date": "2011-06-24T11:55:06.147Z"
        },
        {
            "Rating": 4,
            "Review": "Very Competitive. Teachers are usually great. Great discussion of course material through mandatory discussion section for each class. Grading can be a bit harsh.",
            "Author": "College Junior",
            "Date": "2011-06-24T00:32:04.893Z"
        },
        {
            "Rating": 4,
            "Review": "It's What You Expect – I'm a science concentrator and pre-med, so my workload is pretty heavy. But I expected that because I go to Harvard. However, it's not difficult to find classes that are easy and interesting. Students have access to their professors (who teach the classes by the way) and TFs. All teaching staff provide students with support and help when asked for.",
            "Author": "College Sophomore",
            "Date": "2011-02-16T17:11:22.47Z"
        },
        {
            "Rating": 5,
            "Review": "Academics at Harvard are of the highest caliber. Because of the General Education program, I take courses from a wide variety of fields, and all of my professors have been awesome. The Q-guide (a compilation of student evaluations of courses) is super helpful in choosing classes. Also, we have a week of shopping period every semester where we get to try out any classes we want before registering for them. I've had the opportunity to be a pre-med English concentrator (majors are called concentrations here) - Harvard affords the opportunity to get a great education in any field and prepares you well for any career.",
            "Author": "College Junior",
            "Date": "2011-01-06T00:04:04.853Z"
        },
        {
            "Rating": 4,
            "Review": "It's Alright. Heavy workload. Decent faculty interaction. Great facilities and work opportunities. The student center does not exist though.",
            "Author": "College Sophomore",
            "Date": "2010-05-29T17:17:00.34Z"
        },
        {
            "Rating": 5,
            "Review": "That's What I Came for – People already know that Harvard stands for academic excellence, but what most generally don't know is that the academic support system here is designed to make sure that you get the most out of your time here. Professors are not only the best in their fields, but most of them are more than willing to talk to you outside of class and work with you on independent projects. Beyond even academic and career advisers, not to mention a support network of deans and peer counsel groups, there's an entire organization called the Bureau of Study Counsel designed to help students with any school-related issue that might have, including battling procrastination, learning to read more efficiently, dealing with learning disabilities, and much more.",
            "Author": "College Junior",
            "Date": "2010-05-07T12:19:17.98Z"
        }
    ],
    "Campus": [
        {
            "Rating": 4,
            "Review": "Cambridge is a wonderful little college town. There are lots of great places to eat and shop. If Cambridge doesn't do it for you, Boston is a couple stops away on the T.",
            "Author": "College Freshman",
            "Date": "2014-10-09T14:36:53Z"
        },
        {
            "Rating": 5,
            "Review": "Cambridge is an awesome place to live as a college student.  While the prices of things really close to campus aren't really designed for a college budget, you can easily jump on the T, take a bus, or walk (if you're really feeling up to it) to nearby supermarkets.",
            "Author": "College Freshman",
            "Date": "2014-09-26T14:57:11Z"
        },
        {
            "Rating": 5,
            "Review": "Cambridge Mass. is loaded with culture, smart people, diversity, and any type of food or drink one can imagine. Everything is within walking distance. People are generally friendly.",
            "Author": "College Senior",
            "Date": "2014-09-16T12:56:48Z"
        },
        {
            "Rating": 4,
            "Review": "Cambridge is an awesome college town. Both MIT and Harvard are located here, and the local economy and culture tend to revolve around these institutional giants. Harvard Square is a major subway and bus stop for the T, providing easy access to public transportation that can take you pretty much anywhere you want to go. This includes the vibrant city of Boston, which is about 15 minutes away. If taking the train or bus with the plebeians isn't really your thing, taxis and Uber cars abound. However, most students don't feel the need to venture too far from campus too often - Harvard Square offers a lot of really delicious restaurants, decent shopping, and frequent events. This is also one of Harvard students' biggest problems: they rarely leave the \"Harvard Bubble\" that is Cambridge and venture out into Boston.",
            "Author": "College Sophomore",
            "Date": "2014-08-18T01:15:58Z"
        },
        {
            "Rating": 5,
            "Review": "You just cannot get better than Boston for student life.",
            "Author": "College Junior",
            "Date": "2014-08-04T19:17:40Z"
        },
        {
            "Rating": 5,
            "Review": "There is so much to do even just in the Harvard bubble. We have some of the top museums that are free to Harvard students right on campus, including the recently remodeled Fogg museum. The libraries are huge and so interesting, with book on anything you can think of. All the classroom buildings are full of nooks and crannies to be found by the adventurous. There are some great free coffee and study spaces in central campus if you know where to look!",
            "Author": "College Junior",
            "Date": "2014-08-04T18:29:19Z"
        },
        {
            "Rating": 4,
            "Review": "4 stars, since there are some major problems with facilities.  However, Harvard seems to be working on fixing them (renewing the Houses, creating a student center.) Otherwise, Harvard has a nice aesthetic, and good classrooms/labs/libraries.",
            "Author": "College Sophomore",
            "Date": "2014-07-15T20:07:49Z"
        },
        {
            "Rating": 5,
            "Review": "Cambridge is a wonderful place to go to school in.  There are tons of options for food and shopping, as well as different events year-round like the Head of the Charles.  Plus, Boston is a short T ride away for when you want to venture out of the \"bubble.\"",
            "Author": "College Sophomore",
            "Date": "2014-07-15T20:02:45Z"
        },
        {
            "Rating": 5,
            "Review": "Cambridge is a great college town, and if you ever aren't satisfied then Boston is about 10 minutes away.",
            "Author": "College Sophomore",
            "Date": "2014-06-09T22:29:20Z"
        },
        {
            "Rating": 5,
            "Review": "There is a subway stop literally on campus which can take you anywhere in Boston cheaply.  Uber is amazing and convenient.  Harvard is also a big tourist spot so there are lots of buses and cabs around.  Cambridge is an awesome town though and tons of stuff are within walking distance.  Zipcar and hubway bikes are also a great option!",
            "Author": "College Sophomore",
            "Date": "2014-06-09T22:21:45Z"
        },
        {
            "Rating": 3,
            "Review": "Fall and spring are amazing.  Winter isn't great, but we get like all of January off for winter break so that helped a lot.",
            "Author": "College Sophomore",
            "Date": "2014-06-09T22:20:18Z"
        },
        {
            "Rating": 4,
            "Review": "Awesome libraries, outdoor spaces, etc.  No student center, however",
            "Author": "College Sophomore",
            "Date": "2014-06-09T22:16:18Z"
        },
        {
            "Rating": 5,
            "Review": "You get the calm nature of the yard if you need it, or just the little bit busier Cambridge, or you can go into Boston. Three different atmospheres five minutes from each other.",
            "Author": "College Freshman",
            "Date": "2014-04-28T11:15:59Z"
        },
        {
            "Rating": 4,
            "Review": "I've never had a problem getting around. Its not a very large campus and there are still shuttles to opposite ends. It's very nice!",
            "Author": "College Freshman",
            "Date": "2014-04-28T11:14:27Z"
        },
        {
            "Rating": 3,
            "Review": "Summers are nice. Winters are brutal and it rains a lot.",
            "Author": "College Freshman",
            "Date": "2014-04-28T11:13:38Z"
        },
        {
            "Rating": 4,
            "Review": "My favorite part about the school is that the dining halls are open late for students to do homework. If you want to get out of your room to do work but don't want to sit in a library it's perfect! Great place to do homework, study, or just socialize.",
            "Author": "College Freshman",
            "Date": "2014-04-28T11:09:14Z"
        },
        {
            "Rating": 5,
            "Review": "Walking or taking the shuttles is the primary way of getting around.  Everything is within a 15 minute walk.  To get to places outside of the Harvard bubble, the T is your best (and cheapest) bet.",
            "Author": "College Freshman",
            "Date": "2014-04-08T21:15:01Z"
        },
        {
            "Rating": 3,
            "Review": "Expect a good portion of the spring semester to be cold, snowy, and grey.",
            "Author": "College Freshman",
            "Date": "2014-04-08T21:08:25Z"
        },
        {
            "Rating": 5,
            "Review": "Anything I could every want or need can be found in Cambridge, and Boston is only a subway stop or a short taxi ride away. There are 80 colleges in Boston, so its definitely a college city. Safe and fun!",
            "Author": "College Sophomore",
            "Date": "2014-03-25T17:00:18Z"
        },
        {
            "Rating": 3,
            "Review": "The weather is very temperamental and full of surprises; you don't always know what to expect.",
            "Author": "College Freshman",
            "Date": "2014-03-14T13:28:38Z"
        },
        {
            "Rating": 4,
            "Review": "The cost of living is high and parking is scarce, but it is a great area to live in.",
            "Author": "College Freshman",
            "Date": "2014-03-14T13:20:10Z"
        },
        {
            "Rating": 5,
            "Review": "The subway and buses are very reliable and convenient. The city is very pedestrian friendly. There is a lot to do on and around campus, but reliable public transportation makes it easy to venture off campus.",
            "Author": "College Freshman",
            "Date": "2014-03-14T13:15:17Z"
        },
        {
            "Rating": 4,
            "Review": "There are so many computers and printers available for student use on campus, some of which are available 24/7.",
            "Author": "College Freshman",
            "Date": "2014-03-14T13:11:02Z"
        },
        {
            "Rating": 4,
            "Review": "I've had no problems with the computer labs or wireless at school.",
            "Author": "Recent Alumnus",
            "Date": "2014-03-10T21:10:01Z"
        },
        {
            "Rating": 2,
            "Review": "It's nice for about 2 months out of the whole school year. The rest of the time is cold.",
            "Author": "Recent Alumnus",
            "Date": "2014-03-10T21:06:01Z"
        },
        {
            "Rating": 5,
            "Review": "Love the city. it is like a smaller new york, filled with educated people",
            "Author": "College Junior",
            "Date": "2014-02-24T00:10:17Z"
        },
        {
            "Rating": 5,
            "Review": "I never really use school computers, but they look nice enough. I'm sure they're wicked solid, it's Harvard. Harvard hooks you up with free/super-discounted software like Microsoft Office and programs you'll need for classes. Wifi literally everywhere. Not sure how they do it. Super fast, all the time, all over.",
            "Author": "College Freshman",
            "Date": "2014-02-16T15:46:36Z"
        },
        {
            "Rating": 5,
            "Review": "Boston is the best city on earth. That's pretty much a fact. Perfect size — big enough to have beyond everything you could ask for and be tons of fun. I've lived near Boston my whole life, and I still haven't come close to sating myself in Boston. Cambridge, being close to Boston, is also bustling (though less so — it's borderline suburban in places), but definitely still manageable. The perfect college town.",
            "Author": "College Freshman",
            "Date": "2014-02-16T15:42:04Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard shuttles go everywhere you want, they're wicked nice, and they're frequent enough to be practical. The T has a stop legit 20 seconds from the Yard, so that's a solid backup; the subway goes literally everywhere for $2 (and can get you from the airport to Harvard for free). Several taxi stands in the Square, but I'm more about Uber. ZipCar has some deal with Harvard where students get a bargain price.",
            "Author": "College Freshman",
            "Date": "2014-02-16T15:37:40Z"
        },
        {
            "Rating": 4,
            "Review": "I mean, it's New England. It snows in the winter (it's not as cold as everyone says), the fall and spring are super nice, and the summer is hot (but you're not there anyway, so whatever). Get some boots and some jackets for the winter and some shorts for the spring, and you're totally good.",
            "Author": "College Freshman",
            "Date": "2014-02-16T15:35:53Z"
        },
        {
            "Rating": 2,
            "Review": "The weather is not that good, and so there is less",
            "Author": "Recent Alumnus",
            "Date": "2014-01-06T04:30:51Z"
        },
        {
            "Rating": 3,
            "Review": "Wish there were more iMacs in computer labs.",
            "Author": "College Sophomore",
            "Date": "2013-12-29T03:24:04Z"
        },
        {
            "Rating": 5,
            "Review": "I love the cold and the snow, so living in Cambridge is great for that. If you want to live by the beach, Harvard might not be the best place for you, but I love it.",
            "Author": "College Freshman",
            "Date": "2013-12-28T16:57:33Z"
        },
        {
            "Rating": 5,
            "Review": "Pretty much everyone has their own laptop, but I don't think it would be too awful if you didn't have your own. There's wifi all over campus and it's really reliable. It's kind of annoying to have to pay for printing, but you'd probably have to do that regardless of which school you went to.",
            "Author": "College Freshman",
            "Date": "2013-12-28T16:52:23Z"
        },
        {
            "Rating": 5,
            "Review": "We are in a town next to Boston called Cambridge so we dont have crazy city life like New York but the city is right next to use. Boston and Cambridge are literally the best places to be as a student because there is always something to do if you drag your butt off the couch and find something to do!",
            "Author": "College Sophomore",
            "Date": "2013-12-01T13:36:26Z"
        },
        {
            "Rating": 3,
            "Review": "Typical east coast weather. So west coast kids be warned...there are actual seasons. But in all honesty, people live here all their lives. If you put on a coat and gloves in the winter, you will be totally fine. No complaining.",
            "Author": "College Sophomore",
            "Date": "2013-12-01T13:34:37Z"
        },
        {
            "Rating": 5,
            "Review": "Wifi everywhere, computer labs in every dorm, printers everywhere, fast network and easy to access. Never a hassle. Ever.",
            "Author": "College Sophomore",
            "Date": "2013-12-01T13:26:45Z"
        },
        {
            "Rating": 5,
            "Review": "The subway runs from Boston Logan airport directly into the center of Harvard for free. And it is $2 to get from the subway at Harvard to the airport. And it takes max 30 minutes. Very simple and easy.",
            "Author": "College Sophomore",
            "Date": "2013-12-01T13:25:36Z"
        },
        {
            "Rating": 4,
            "Review": "There is wifi everywhere on campus -- even in the athletic facilities, there is perfect wifi.  It costs 5 cents/page to print, which starts to add up if you have classes with lots of printing.",
            "Author": "College Freshman",
            "Date": "2013-11-20T21:34:53Z"
        },
        {
            "Rating": 5,
            "Review": "Living in Cambridge makes it feel less like a major city and more like a bustling suburb (and when you need an escape from the commotion, there's always the Quad).",
            "Author": "College Freshman",
            "Date": "2013-11-20T21:30:25Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard has a huge endowment, and with such, the ability to fund anything and everything you can imagine.  A generous donor from the 40s and his wife just donated \"a generous amount\" (read: a huge amount) to build our new student center.  Sadly, it won't open until 2018 (after we've all left), but it'll be an amazing space.",
            "Author": "College Freshman",
            "Date": "2013-11-20T21:26:37Z"
        },
        {
            "Rating": 4,
            "Review": "The athletic centers are new and great.  Harvard has an AMAZING library system -- you can get lost in the stacks.  They also have every book and movie you can imagine.  If they don't have it, they'll get it for you.",
            "Author": "College Freshman",
            "Date": "2013-11-20T21:26:37Z"
        },
        {
            "Rating": 5,
            "Review": "Being right in Harvard Square, you can get anywhere quickly and inexpensively.  There is a T stop less than a two minute walk from my dorm room, and from there I can easily get to South Station (for buses and trains) and Logan Airport for $2/ride with my Charlie Card.",
            "Author": "College Freshman",
            "Date": "2013-11-20T18:45:01Z"
        },
        {
            "Rating": 5,
            "Review": "The shuttles go to different locations on campus, and they are free. The T is pretty chap to get to other locations and is right outside the square. Taxi fares are really cheap if you split it.",
            "Author": "College Freshman",
            "Date": "2013-11-04T19:27:41Z"
        },
        {
            "Rating": 4,
            "Review": "You can get anywhere you need to go pretty easily.",
            "Author": "College Junior",
            "Date": "2013-11-01T17:46:59Z"
        },
        {
            "Rating": 4,
            "Review": "The Harvard community is great, that's why it can be hard to leave the \"Harvard Bubble\" sometimes. But when you do want to it's literally 4 blocks in any direction or a 10 min subway ride away.",
            "Author": "College Junior",
            "Date": "2013-11-01T17:35:56Z"
        },
        {
            "Rating": 4,
            "Review": "Harvard just throws money at things, so all of our facilities are pretty great.",
            "Author": "College Junior",
            "Date": "2013-11-01T17:20:23Z"
        },
        {
            "Rating": 2,
            "Review": "Beginning of the School Year: Too Hot\r\nFall: Long fall season and it's gorgeous\r\nWinter: Annoying because it's slushy, but the wet snow makes for better snowballs.\r\nSpring: Gorgeous\r\n\r\nIn general it rains too much. It should never rain in December!",
            "Author": "College Junior",
            "Date": "2013-11-01T16:58:22Z"
        },
        {
            "Rating": 3,
            "Review": "You need a computer, They are everywhere but it would suck not to have one. That said, the campus store sells them at a good discount and you can buy during the MA \"no tax day\" to make it even more reasonable. And any outside scholarships you have they will let you use to get a computer.",
            "Author": "College Junior",
            "Date": "2013-11-01T16:56:54Z"
        },
        {
            "Rating": 4,
            "Review": "There are labs all over the place and tech support located right by where most classes are. Most people have laptops. The entire campus is wifi and it is pretty reliable. Sometimes it takes a second to connect.",
            "Author": "College Sophomore",
            "Date": "2013-09-26T15:32:56.383Z"
        },
        {
            "Rating": 3,
            "Review": "Cambridge is in a city so parking is difficult. Rates tend to be around $150-$200 a month I think, but not many people have cars. I was talking to someone with a car who said she pays $75 a month but I am not positive this is true. Overnight parking is really easy for people visiting on weekends. Harvard charges around $5-10 for the day and after 11pm its free.",
            "Author": "College Sophomore",
            "Date": "2013-09-26T15:30:58.01Z"
        },
        {
            "Rating": 3,
            "Review": "The transportation is free and runs all through the day, just wish there were more stops!",
            "Author": "College Senior",
            "Date": "2013-08-25T19:48:37.373Z"
        },
        {
            "Rating": 4,
            "Review": "If the shops and restaurants and events in Cambridge aren't enough for you, Boston has everything else.  Local attitude is not a problem; it's college students everywhere.",
            "Author": "College Sophomore",
            "Date": "2013-08-25T17:22:12.917Z"
        },
        {
            "Rating": 5,
            "Review": "There are free Harvard Shuttles that take you all around campus.  There is a neat app that lets you track shuttles times and locations.  Also, the Harvard Square T-Station (subway) is in a very central location and can (for a small a reasonable fee) take you anywhere in/around the Boston area. All forms of transportation are rather safe.",
            "Author": "College Sophomore",
            "Date": "2013-07-29T09:03:48.39Z"
        },
        {
            "Rating": 4,
            "Review": "Academic advising is pretty strong after your first year. The social scene is...interesting: your normal college parties can be found at Final Clubs, at fraternities, or as student organization events. Campus life is really comfortable, and having Cambridge/Boston is a huge plus. School offers the best professors and connections anyone could ask for in America.",
            "Author": "College Sophomore",
            "Date": "2013-07-28T12:30:21.67Z"
        },
        {
            "Rating": 4,
            "Review": "Computer labs are crowded during midterms and finals, but just about everyone has a personal computer. Having your own printer is not necessary, but many students just like the convenience of having one. WiFi is everywhere: the Harvard network is incredibly reliable and fast. Printing on campus relies on your school cash account.",
            "Author": "College Sophomore",
            "Date": "2013-07-28T12:26:45.05Z"
        },
        {
            "Rating": 4,
            "Review": "Athletic facilities are just okay, but libraries are expectedly abundant. Each house has its own library, in addition to all the campus libraries (Widener being the largest university library in the country is nothing to complain about). There are plenty of campus events and traditions, and student organizations put together a variety of activities every week. There aren't a lot of green spaces, but having Cambridge and Boston makes up for it.",
            "Author": "College Sophomore",
            "Date": "2013-07-28T12:24:05.99Z"
        },
        {
            "Rating": 4,
            "Review": "Great spaces all over Harvard. From the yard to the Science Center to the libraries, there are many places to hang out or study!",
            "Author": "College Junior",
            "Date": "2013-07-18T18:28:40.96Z"
        },
        {
            "Rating": 4,
            "Review": "Harvard's academic programs are fabulous and there are many art/music groups to balance it out.",
            "Author": "College Junior",
            "Date": "2013-07-18T18:24:54.87Z"
        },
        {
            "Rating": 3,
            "Review": "Most of the dormitories at Harvard are in a degraded condition although there is 10 year rennovation campaign that is under the works. Theother facilites are quite good albeit old.",
            "Author": "College Senior",
            "Date": "2013-06-28T17:32:34.743Z"
        },
        {
            "Rating": 3,
            "Review": "Extracuricular opportunites, academics, and professors are outstanding.",
            "Author": "College Senior",
            "Date": "2013-06-28T17:23:11.19Z"
        },
        {
            "Rating": 5,
            "Review": "Everything you could ask for. Sports, cultural attractions, and good restaurants.",
            "Author": "College Junior",
            "Date": "2013-06-28T16:23:10.733Z"
        },
        {
            "Rating": 3,
            "Review": "Whether the weather is rain, snow, or shine, the Harvard Campus is beautiful, accessible, and there is so much to enjoy!",
            "Author": "Recent Alumnus",
            "Date": "2013-06-03T10:41:10.71Z"
        },
        {
            "Rating": 5,
            "Review": "Cambridge is a very safe neighborhood, yet it has many restaurants and stores to keep the atmosphere lively and young!",
            "Author": "College Freshman",
            "Date": "2013-05-31T22:34:31.44Z"
        },
        {
            "Rating": 4,
            "Review": "Harvard has an abundance of computer labs and resources. That being said, the availability of professional video and photo software is slightly lacking.",
            "Author": "College Sophomore",
            "Date": "2013-05-22T09:57:17.523Z"
        },
        {
            "Rating": 3,
            "Review": "It's really hot in the summer and really cold in the winter, but every once in a while we'll have some great weather.",
            "Author": "College Sophomore",
            "Date": "2013-05-22T09:55:00.96Z"
        },
        {
            "Rating": 4,
            "Review": "Mix of Macs and PCs. There are labs, stations/kiosks, as well as laptops that can be borrowed.",
            "Author": "Recent Alumnus",
            "Date": "2013-05-06T20:46:16.713Z"
        },
        {
            "Rating": 4,
            "Review": "There is not really need for transportation on campus, everything is within walking distance. For the longer distances, there are free shuttles available. Students do use the buses or the subway (the T) to get around Boston, which is really convenient.",
            "Author": "College Sophomore",
            "Date": "2013-04-15T07:50:57.437Z"
        },
        {
            "Rating": 2,
            "Review": "The weather is pretty awful.  Cold, wet, rainy, cloudy.  It's only warm in the very beginning of the school year and at the very end.  If you're from the Northeast, which a lot of students are, it will be pretty normal for you.  If you're from California, I think you will be ok too, because a lot of students are also from California and seem to adjust pretty well.  Harvard has these lights that you can put in your dorm room that mimic the sunlight, for those days when the sun sets at 4 PM.",
            "Author": "Recent Alumnus",
            "Date": "2013-03-07T15:09:34.46Z"
        },
        {
            "Rating": 3,
            "Review": "I'm from NY so I feel like Cambridge/Boston is a small town with not much to do.  However, there are museums in Boston, plus shopping on Newbury Street and in Cambridgeside Galleria.  It's pretty safe although there have been muggings at night.  Most students stick to campus and Cambridge and don't venture outside of it - everything you need is there.",
            "Author": "Recent Alumnus",
            "Date": "2013-03-07T14:46:02.31Z"
        },
        {
            "Rating": 5,
            "Review": "Many computers are beyond what you would expect because they are equipped with programs such as Photoshop. They are all very swift and efficient, and can be found throughout campus.",
            "Author": "College Sophomore",
            "Date": "2013-02-10T12:26:25.737Z"
        },
        {
            "Rating": 3,
            "Review": "You are not expected to have a car on campus because everything is within walking distance (although it may often take a 20 min walk). There are regular shuttles for those farther away, which can sometimes be a hassle, but it serves its function fine.",
            "Author": "College Sophomore",
            "Date": "2013-02-10T12:25:01.403Z"
        },
        {
            "Rating": 3,
            "Review": "The computer labs at Harvard are usually crowded at crunch times, like midterms and finals, but besides that, you can always find a spot. Most people do have their own computers, and with WiFi, it is definitely nice to have your own. If you don't own one, I don't think it would be a huge problem",
            "Author": "College Sophomore",
            "Date": "2013-01-04T10:49:23.327Z"
        },
        {
            "Rating": 4,
            "Review": "Harvard's campus life is like no other. The student union (the HUB) was newly renovated a few years ago and is very modern. There are fast food joints, places to study, convention rooms, an art gallery, and a record-breaking fish tank-it's a very popular hangout. There are tons of organizations to join, and there are always fun activities and events going on across campus.",
            "Author": "College Sophomore",
            "Date": "2013-01-04T10:46:02.707Z"
        },
        {
            "Rating": 4,
            "Review": "Right off campus are taxis, buses, and the T (subway) that can take you anywhere in the city.",
            "Author": "College Freshman",
            "Date": "2013-01-01T14:25:53.597Z"
        },
        {
            "Rating": 3,
            "Review": "Cambridge is great but small, and Boston is also great but it takes some effort to get into. Going 'out' in Cambridge or Boston is all but impossible if you're not 21.",
            "Author": "College Freshman",
            "Date": "2012-12-17T11:27:08.63Z"
        },
        {
            "Rating": 5,
            "Review": "Easy to get around.  People are friendly and you can ask for directions.",
            "Author": "College Freshman",
            "Date": "2012-10-31T12:08:24.7Z"
        },
        {
            "Rating": 5,
            "Review": "Plenty of Computers, all running the most recent operating system.",
            "Author": "College Sophomore",
            "Date": "2012-07-25T23:09:46.067Z"
        },
        {
            "Rating": 3,
            "Review": "We Dont Own Cars on Campus – We use free shuttle. Boston also have an excellent public transportation system. Rarely students have their own vehicle. Parking is available in many places in Harvard Square but expensive.",
            "Author": "College Sophomore",
            "Date": "2012-07-25T23:08:09.427Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard has some pretty old buildings on campus, but they've all been updated to be as comfortable as one could hope for and outfitted with the latest technology to meet the demands of today's classrooms.  The campus has also been added to continuously over the years with modern additions where necessary without sacrificing it's timeless character.",
            "Author": "College Junior",
            "Date": "2012-07-10T21:17:38.95Z"
        },
        {
            "Rating": 5,
            "Review": "There's a Lot to Do in Cambridge... Oh, and There's Boston. Cambridge is always having some festival or another, and it's easy to live in a bubble and only visit Cambridge stores, they're quite expansive.  Then of course there's Boston, which is fantastic.  I can think of few better places to go to college based solely on the local atmosphere.",
            "Author": "College Sophomore",
            "Date": "2012-06-24T14:51:47.323Z"
        },
        {
            "Rating": 5,
            "Review": "The Gym Is Amazing – Fully loaded gym for all graduate business school students to use. Excellent facilities all around.",
            "Author": "College Sophomore",
            "Date": "2012-05-09T09:30:13.95Z"
        },
        {
            "Rating": 3,
            "Review": "New England – This year was great for weather but expect cold winters, wet springs and blustery falls.",
            "Author": "Recent Alumnus",
            "Date": "2012-04-24T16:11:00.257Z"
        },
        {
            "Rating": 5,
            "Review": "Public transportation is fairly cheap and super easy to navigate. It makes it very easy to go out and enjoy the rest of Cambridge and Boston. There is also a free shuttle that will take you wherever you need to be on campus.",
            "Author": "College Sophomore",
            "Date": "2012-04-10T12:02:44.52Z"
        },
        {
            "Rating": 1,
            "Review": "No Need for a Car – There is no place to park, and there are tourists and thieves everywhere.  No one lives off campus, so it's very nice to walk and not too far, plus there is a shuttle to take you where you need to go",
            "Author": "College Sophomore",
            "Date": "2012-04-10T12:01:07.333Z"
        },
        {
            "Rating": 3,
            "Review": "Shuttle and T – If you live in the Quad or need to get to other remote corners of the campus, the shuttles are the best way to get around. They come pretty frequently and are easy to spot. For venturing out of Cambridge, the T (subway) is pretty convenient, as is the #1 bus, that connects the main street of Cambridge and Back Bay Boston across the Charles River.",
            "Author": "Recent Alumnus",
            "Date": "2012-04-03T09:41:45.623Z"
        },
        {
            "Rating": 5,
            "Review": "Nice and New – Everything is nice looking, functional and up to date.",
            "Author": "College Freshman",
            "Date": "2012-03-27T15:28:02.62Z"
        },
        {
            "Rating": 5,
            "Review": "Awesome athletic centers - multiple gyms and pools for student use, house system provides community more so than a central student center, excellent libraries - good for studying and any book you could want!",
            "Author": "Recent Alumnus",
            "Date": "2012-02-28T14:01:31.633Z"
        },
        {
            "Rating": 4,
            "Review": "Shuttles Are Convenient – Free shuttles are very convenient and take you all around campus",
            "Author": "College Sophomore",
            "Date": "2012-02-28T00:16:04.497Z"
        },
        {
            "Rating": 4,
            "Review": "I believe Harvard provides its students with phenomenal facilities with plenty of access. The only place I feel Harvard lacks is in its student centers and generally student non-study spaces",
            "Author": "College Sophomore",
            "Date": "2012-02-28T00:08:30.423Z"
        },
        {
            "Rating": 5,
            "Review": "The T is great for any transportation needs. There are also Harvard shuttles running to the Quad, the med school, and the business school.",
            "Author": "College Freshman",
            "Date": "2012-02-04T14:12:39.823Z"
        },
        {
            "Rating": 5,
            "Review": "Accessible If Needed – Labs and printers are accessible at all hours and in many locations.",
            "Author": "College Freshman",
            "Date": "2012-02-04T14:09:54.84Z"
        },
        {
            "Rating": 5,
            "Review": "Cambridge is a wonderful little city. The river is great for runs - there are plenty of restaurants and shops - and I always feel safe.",
            "Author": "College Freshman",
            "Date": "2012-02-04T14:09:17.337Z"
        },
        {
            "Rating": 4,
            "Review": "Pretty Good Computer Support – I have yet to find a spot on campus that doesn't have wi-fi. There are plenty of computers students can use, and plenty of software at our disposal.",
            "Author": "College Sophomore",
            "Date": "2012-01-30T21:28:26.67Z"
        },
        {
            "Rating": 4,
            "Review": "*Two great gyms, gyms also in the basement of houses (in Eliot House at least). Not a big gym person (New year's resolution is to become one though--fingers crossed!) but the facilities look pretty great. There's also group classes undergrads can take for free like zumba and indoor cycling, etc. Those, if you can find one to attend regularly, are pretty great.\r\n*Libraries are huge--Widener stacks are legen-wait-for-it-dary. Cabot is great for us sciency ones who want to avoid the Lamont crowd. The studying crowd in Lamont can be pretty intimidating actually. Lamont cafe studying is more laid back--maybe too laid back for my taste. Cabot couches are great for in-between-classes naps! :)\r\n*Plenty of campus activities--Cultural Rhythms is my fave. Ghungroo is awesome too.\r\n*All the Houses have their own cute little special features (like all the pianos in Eliot) and I haven't found a house lawn I didn't like yet. The freshman ivy yard's pretty awesome--miss it and wish I had used it more last year! Anenberg looks like the the Harry Potter d-hall. River Houses have a view of the Charles. The classrooms are nice--only had one classroom I disliked but that was because of the class size and the over-crowdedness in the small room.\r\n*Love the Campus!",
            "Author": "College Sophomore",
            "Date": "2012-01-19T01:23:22.933Z"
        },
        {
            "Rating": 4,
            "Review": "The title says it. There's the T so you can leave campus and explore boston, etc. in an inexpensive way. It might seem like a bubble, but if you think that's not the case to some extent with every university, you're only kidding yourself. But really, cambridge and harvard square are great! The clothing stores are kind of expensive and there are a lot of tourists, but you see all walks of life on the streets of cambridge: rich and poor students, business men and women, barbers and chefs smoking during break, the homeless, etc. It's not a bad bubble to be in. Also, there are some really good food places. Pinocchio's Pizza is my favorite late-night food place to go to. Not much selection on chinese food though in the area :(. Tons of universities close by too (Tufts, BU, MIT, etc.) so if you have friends going to those schools, you can totally hang out every weekend if you want! I haven't seen much negative attitudes towards students--maybe a bit from visiting BU girls though. They're just jealous ;). I once got lost looking for a building and went two miles off track and a really nice realtor in a random building I entered to ask for directions was super duper nice. Most shops do offer discounts to students is you ask, I think. Also, there's always performances on Massachusetts ave. from dancers to singers, etc. I love this campus--one of the reasons I chose Harvard!",
            "Author": "College Sophomore",
            "Date": "2012-01-19T01:12:06.23Z"
        },
        {
            "Rating": 4,
            "Review": "Wide Range – there's a campus shuttle, an inter-campus shuttle, then the local buses and trains, intercity buses primarily to new york, taxis, and logan airport isn't too far either.",
            "Author": "College Junior",
            "Date": "2011-09-28T02:21:35.6Z"
        },
        {
            "Rating": 4,
            "Review": "Boston is a huge city with tons of activities. Three quarters of Boston is filled with college students, as there are plenty of colleges nearby. You will definitely have a blast at Harvard.",
            "Author": "College Student",
            "Date": "2011-08-15T10:11:27.65Z"
        },
        {
            "Rating": 5,
            "Review": "Boston Is an Excellent College Town – Boston is a college town which means that it has a vibrant atmosphere.  There are millions of things to do in the city and a good public transportation system that makes commuting simple and cheap.  From museums, to shops, to beaches, mountains and outdoor activities - Boston is a perfect town.  Additionally one can also visit other colleges for parties, and socializing.",
            "Author": "Recent Alumnus",
            "Date": "2011-07-10T16:22:13.683Z"
        },
        {
            "Rating": 5,
            "Review": "Convenience and Cost – There are shuttles that run around campus very frequently. These shuttles are provided free of cost.\r\n\r\nFrom Harvard, to get to Boston is simply a subway ride away. The subway costs $1.45, I believe, and the subway stop is right beside campus. There's actually a \"Harvard\" stop. \r\n\r\nThere are also buses that cost about $1.35 that will go anywhere the subway doesn't drop off reasonably close.\r\n\r\nThere are also taxis.\r\n\r\nAnd, of course, there's always walking. Boston/Cambridge are wonderful walking/biking cities. There are sidewalks EVERYWHERE.",
            "Author": "College Sophomore",
            "Date": "2011-07-04T16:55:49.987Z"
        },
        {
            "Rating": 4,
            "Review": "Dining Halls Are Great – Harvard dining and hospitality services are truly amazing. They care about providing healthy food options to students and try to improve by listening to the students. The staff is also very friendly.",
            "Author": "College Sophomore",
            "Date": "2011-05-18T17:39:00.78Z"
        },
        {
            "Rating": 4,
            "Review": "Cambridge and Boston Are Great – Cambridge has a great smaller city feel and with great neighborhoods, and Boston is so accessible by subway.",
            "Author": "College Junior",
            "Date": "2011-05-17T20:36:24.7Z"
        },
        {
            "Rating": 4,
            "Review": "The Harvard network is fast and reliable, can't be beat in terms of availability, consistency, and speed anywhere on campus. The computer lap computers are generally kinda slow, but function decently and get their job done. The printers are generally fast and efficient, but when there is a problem, which is often, it takes a while to get fixed. This may be due largely to the fact that most people get pissed off and leave rather than call someone and report that the printer is on the fritz. The Printers are great though when they do work and the price for printing is great which means that having your own printer is really unnecessary. Having your own laptop is almost a must just for being able to do work in your room, in the library and generally wherever you can. Laptops are also generally allowed in class so having one makes taking notes a lot easier. As long as you can be disciplined and stay focused in lecture, then you should have a laptop. Also, if you thing buying a laptop is a bit expensive, then there are plenty of scholarships that are specifically for laptops that you should definitely take advantage of, as they not only pay for a laptop, but with the money they give you to pay, will allow you to buy a rather expensive laptop. I wish I had known about these scholarships back before I bought my laptop. There is wireless access everywhere, literally every square inch, on campus. Overall, great!!!",
            "Author": "College Sophomore",
            "Date": "2011-05-17T16:42:07.56Z"
        },
        {
            "Rating": 1,
            "Review": "It Makes No Sense to Own a Car Here – there is very limited street permit parking. dont even dream of acquiring a spot in the wintertime with all that snow. the garage is 3000/car/semester...nuts!",
            "Author": "College Freshman",
            "Date": "2011-02-09T16:31:54.197Z"
        },
        {
            "Rating": 4,
            "Review": "It's very convenient to get to Boston or almost anywhere else in MA because the Harvard T Station is close by. Classes are within walking distance from dorms and houses. Getting to where you want to be is fairly easy as long as you're willing to walk. Having a car on campus is pointless and inconvenient.",
            "Author": "College Freshman",
            "Date": "2011-01-08T15:08:47.71Z"
        },
        {
            "Rating": 5,
            "Review": "Overall Experience – You can't beat it. Everyone's so motivated, outgoing, and fun. You'll never want to leave.",
            "Author": "College Freshman",
            "Date": "2010-11-12T09:26:46.76Z"
        },
        {
            "Rating": 1,
            "Review": "As far as I know, parking is non-existent here. But why would you want a car? The T is convenient and relatively cheap. For $1.75, I can be in downtown Boston in 10 minutes.",
            "Author": "College Freshman",
            "Date": "2010-10-14T08:01:09.513Z"
        },
        {
            "Rating": 3,
            "Review": "Good Town, Not So College Geared – Cambridge is a very safe town, and there are a lot of eating and shopping options. Unfortunately, it is quite expensive, and there are no typical fast food restaurants, such as McDonalds or anything. However, Boston is right around the corner, so there are lots of other shopping, eating, and partying options there.",
            "Author": "College Sophomore",
            "Date": "2010-06-22T04:27:33.213Z"
        },
        {
            "Rating": 4,
            "Review": "Network Speed Pretty Reliable – The network at Harvard University is pretty reliable, although there are sometime where my computer has a hard time connecting. Otherwise, it is fast enough to stream music and videos well.",
            "Author": "College Sophomore",
            "Date": "2010-06-21T12:15:19.89Z"
        },
        {
            "Rating": 5,
            "Review": "Simply the Greatest Educational Experience You Could Imagine – The university, surronding area and student body are among the most outstanding in educational history.",
            "Author": "College Sophomore",
            "Date": "2010-06-15T14:40:28.093Z"
        },
        {
            "Rating": 4,
            "Review": "Top Notch Except for Student Center – The library system is phenomenal. Architecture on campus is quite nice as well. The gyms are beautiful and spanking new. There is no student center, which is the only bummer.",
            "Author": "College Sophomore",
            "Date": "2010-05-30T16:03:55.79Z"
        },
        {
            "Rating": 2,
            "Review": "Lots of snow and very cold for 5 months out of the 9-month school year. If you are for a warm climate, the first winter will be miserable.",
            "Author": "College Sophomore",
            "Date": "2010-05-29T17:19:48.83Z"
        },
        {
            "Rating": 4,
            "Review": "The T system is highly reliable, cheap, and easy to use.  Although I use the subway system the most, buses are also a really convenient option.  Buses arrive frequently, and the schedules are posted everywhere.  There are also cheap buses outside of the T system that go to places like New York and Philadelphia fairly quickly.",
            "Author": "College Freshman",
            "Date": "2010-05-27T15:32:42.327Z"
        },
        {
            "Rating": 3,
            "Review": "The weather is nuts.  It will rain non stop for a week and then out of no where be 90 degrees.  You are never able to get a handle on what the weather will be.",
            "Author": "College Freshman",
            "Date": "2010-05-18T05:14:53.72Z"
        },
        {
            "Rating": 4,
            "Review": "If you can't afford your own laptop, the University will provide one for you. Otherwise, there are plenty of computers and printers accessible on campus and WiFi absolutely everywhere. For example, each House (upperclass dorm) has its own computer lab with macs, PCs, scanners and printers. Still, due to the importance placed on email, and also for convenience, it's best to have a personal laptop.",
            "Author": "College Junior",
            "Date": "2010-05-07T11:44:50.377Z"
        },
        {
            "Rating": 4,
            "Review": "Harvard has largest library system in the world. The athletic facility is great. It has an Olympic-sized swimming pool and multi-purpose basketball arena.",
            "Author": "College Student",
            "Date": "2010-04-06T21:25:25.083Z"
        },
        {
            "Rating": 4,
            "Review": "Generally About Cambridge – Cambridge, Massachusetts is one of the most populous cities in the state. It is the location of two famous universities:Harvard and Massachusetts Institute of Technology. Living here gives you access to a great education, but you have to stand a high cost of living. The architecture and culture is quite similar to England. Museums are the most interesting things in this city. One of the best museums is the Harvard Art Museum, which is one of the world's leading institutions.",
            "Author": "College Student",
            "Date": "2010-04-06T21:25:21.027Z"
        },
        {
            "Rating": 5,
            "Review": "Class of 2014 – Everyone is actively involved in extra curricular activities.",
            "Author": "College Senior",
            "Date": "2010-04-05T08:03:35.13Z"
        }
    ],
    "Value": [
        {
            "Rating": 4,
            "Review": "The opportunities and internships are top shelf. There are so many amazing people you have access to and experiences you can find.",
            "Author": "College Senior",
            "Date": "2016-09-07T21:36:11Z"
        },
        {
            "Rating": 5,
            "Review": "It's Harvard, with the biggest, richest alumni in the world.",
            "Author": "College Freshman",
            "Date": "2016-08-31T18:42:17Z"
        },
        {
            "Rating": 4,
            "Review": "The alumni from this school gives us a framework of people we can reach out to and internships and programs we can apply to.",
            "Author": "College Sophomore",
            "Date": "2016-07-19T20:51:33Z"
        },
        {
            "Rating": 5,
            "Review": "The connections I have made are astounding.",
            "Author": "College Freshman",
            "Date": "2016-07-03T13:39:52Z"
        },
        {
            "Rating": 5,
            "Review": "You can't beat a Harvard degree. You really just can't.",
            "Author": "College Sophomore",
            "Date": "2016-06-29T20:04:04Z"
        },
        {
            "Rating": 5,
            "Review": "It's Harvard. I'm sure you can guess.",
            "Author": "College Sophomore",
            "Date": "2016-06-22T13:01:16Z"
        },
        {
            "Rating": 4,
            "Review": "it will be very interesting experience for me to try it out",
            "Author": "College Sophomore",
            "Date": "2016-05-22T04:03:27Z"
        },
        {
            "Rating": 5,
            "Review": "There are always recruitment events and the office of career services is a really useful resource.",
            "Author": "College Freshman",
            "Date": "2016-05-05T13:45:40Z"
        },
        {
            "Rating": 4,
            "Review": "There are a lot of great career services but I have not used them.",
            "Author": "College Freshman",
            "Date": "2016-04-22T09:34:11Z"
        },
        {
            "Rating": 5,
            "Review": "The alumni network is very strong and there are many opportunities to gain internships off campus. The career center is very helpful and knowledgable.",
            "Author": "College Junior",
            "Date": "2016-01-13T14:36:08Z"
        },
        {
            "Rating": 5,
            "Review": "Great alumni network and its easy to find someone from Harvard to connect with in any job field",
            "Author": "College Senior",
            "Date": "2016-01-10T16:29:31Z"
        },
        {
            "Rating": 4,
            "Review": "Everyone has heard of this school. Everyone knows it's an Ivy League. I'm set.",
            "Author": "College Sophomore",
            "Date": "2015-12-29T17:29:59Z"
        },
        {
            "Rating": 3,
            "Review": "A lot of opportunities are available to connect with big corporations.",
            "Author": "College Freshman",
            "Date": "2015-12-29T12:16:05Z"
        },
        {
            "Rating": 5,
            "Review": "I go here for free so thats great",
            "Author": "College Freshman",
            "Date": "2015-04-08T16:22:00Z"
        },
        {
            "Rating": 2,
            "Review": "Financial aid at Harvard is need-based and a complete blessing to those who get it. However, Harvard's definition of \"need\" leaves a lot to be desired because there is a lot of us who fall into the middle of the lot and are not qualified for aid but could really use it. Harvard should definitely review and revamp its financial aid program.",
            "Author": "College Freshman",
            "Date": "2015-03-21T21:43:35Z"
        },
        {
            "Rating": 4,
            "Review": "Many career prospects and the networking opportunities are good",
            "Author": "College Sophomore",
            "Date": "2015-01-29T15:35:32Z"
        },
        {
            "Rating": 3,
            "Review": "I received a partial loan.",
            "Author": "College Senior",
            "Date": "2014-09-16T13:32:29Z"
        },
        {
            "Rating": 5,
            "Review": "With its $32 billion endowment, Harvard can afford to enroll any student they want. About 60% of Harvard undergrads receive financial aid, and students of families making less than $60,000 per year can expect to pay next to nothing for their education.",
            "Author": "College Sophomore",
            "Date": "2014-08-18T01:51:13Z"
        },
        {
            "Rating": 5,
            "Review": "I did not apply, but I know over half of the student body is on some form of financial aid and that it is all grants, no loans!",
            "Author": "College Junior",
            "Date": "2014-08-04T18:31:19Z"
        },
        {
            "Rating": 5,
            "Review": "They give people what they need.",
            "Author": "College Sophomore",
            "Date": "2014-06-30T06:14:53Z"
        },
        {
            "Rating": 5,
            "Review": "As long as you do everything that you have to do its not hard. It might take a little bit of time but it's worth it!",
            "Author": "College Freshman",
            "Date": "2014-04-28T11:04:31Z"
        },
        {
            "Rating": 5,
            "Review": "Financial aid is wonderful here.  If your household income is under 60k, expect to be taken care of.",
            "Author": "College Freshman",
            "Date": "2014-04-08T21:01:43Z"
        },
        {
            "Rating": 5,
            "Review": "World's largest endowment. You'll get the money you need. Simple.",
            "Author": "College Freshman",
            "Date": "2014-02-16T15:33:40Z"
        },
        {
            "Rating": 5,
            "Review": "With a $30 billion endowment, financial aid is literally THE LEAST of your worries. Everyone gets everything they need.This school does not have financial instability prevent you from attending. If there is one thing that I could tell prospects is that to JUST APPLY. Do NOT worry about the money. That will work itself out.",
            "Author": "College Sophomore",
            "Date": "2013-12-01T13:24:14Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard makes sure that any student who wants to attend will not have financial aid as an excuse. Everything was covered for me, and they even supported me through a winter coat fund and SEF events.",
            "Author": "College Freshman",
            "Date": "2013-11-04T19:25:58Z"
        },
        {
            "Rating": 4,
            "Review": "They selected the best in the country, and they want them to attend. Harvard makes sure that you can afford to go if they accept you. If you choose not to attend, it's not because of financial reasons.",
            "Author": "College Junior",
            "Date": "2013-11-01T17:48:24Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard probably has the best financial aid process of any school in the world.",
            "Author": "Recent Alumnus",
            "Date": "2013-03-05T16:52:18.813Z"
        },
        {
            "Rating": 5,
            "Review": "It was a smooth, easy process with incredible results.",
            "Author": "College Sophomore",
            "Date": "2012-08-13T12:41:08.393Z"
        },
        {
            "Rating": 5,
            "Review": "Best Offer You Can Find – Best need-based, number one choice for low income students",
            "Author": "College Sophomore",
            "Date": "2012-07-25T23:12:21.623Z"
        },
        {
            "Rating": 4,
            "Review": "Many scholarships available but mostly the competition is very tough.",
            "Author": "Recent Alumnus",
            "Date": "2011-07-14T09:01:16.487Z"
        },
        {
            "Rating": 5,
            "Review": "Getting financial aid at Harvard is very easy. I am very grateful for their abundant resources and financial help.",
            "Author": "College Sophomore",
            "Date": "2011-05-18T17:43:37.193Z"
        },
        {
            "Rating": 5,
            "Review": "They Have So Much Money to Give Out. They will make it affordable for you, guaranteed. I got way more financial aid from Harvard than from any other institution.",
            "Author": "College Freshman",
            "Date": "2011-02-01T16:47:52.477Z"
        },
        {
            "Rating": 5,
            "Review": "I would not have been able to enter college had it not been for their financial aid. Harvard is very, very generous especially to those who need it.",
            "Author": "College Freshman",
            "Date": "2011-01-08T15:09:41.217Z"
        },
        {
            "Rating": 4,
            "Review": "No Too Bad – The application process is not really a hassle - you have to submit all the regular forms plus write a number of essays about yourself. I didn't get any aid the first two years, but this year Harvard covered a good chunk of my tuition because of a grant given to each student so that their family has to pay no more than 10% of their annual income toward tuition. If you come from a lower income family, it is likely that you will receive full financial aid.",
            "Author": "College Junior",
            "Date": "2011-01-06T00:14:51.093Z"
        }
    ],
    "Food": [
        {
            "Rating": 3,
            "Review": "I wish there was more diversity in the food",
            "Author": "College Freshman",
            "Date": "2015-04-29T07:59:53Z"
        },
        {
            "Rating": 4,
            "Review": "felipes and the taco truck are the best",
            "Author": "College Freshman",
            "Date": "2015-04-08T16:26:08Z"
        },
        {
            "Rating": 3,
            "Review": "They could do a much better job of mixing things up",
            "Author": "College Freshman",
            "Date": "2015-04-08T16:21:27Z"
        },
        {
            "Rating": 4,
            "Review": "Off-campus dining will become your best friend, especially during your dreaded days at Annenberg. However, you probably should have a steady line of income because eating isn't necessarily the cheapest in Harvard Square. Those late night trips to CVS can start to add up quickly.",
            "Author": "College Freshman",
            "Date": "2015-03-21T21:46:27Z"
        },
        {
            "Rating": 3,
            "Review": "Most of the time, the dining halls can leave a lot to be desired. Sometimes, they surprise us and the food is pretty good. The food options around Harvard can tend to be a little pricey for a college student's budget...we're not all heirs to an enormous fortune.",
            "Author": "College Freshman",
            "Date": "2015-03-21T21:38:19Z"
        },
        {
            "Rating": 4,
            "Review": "Lots of local restaurants with delicious food and cheap prices.",
            "Author": "College Freshman",
            "Date": "2015-03-15T17:43:08Z"
        },
        {
            "Rating": 4,
            "Review": "The food in Annenberg is alright, but it's great to be able to eat with friends. Upperclassmen dining halls have somewhat better food.",
            "Author": "College Freshman",
            "Date": "2015-03-15T17:40:01Z"
        },
        {
            "Rating": 4,
            "Review": "Lots of ethnic restaurants and options for dining.",
            "Author": "College Sophomore",
            "Date": "2015-01-29T15:39:22Z"
        },
        {
            "Rating": 4,
            "Review": "There's great places to go and eat that are open at virtually all hours of the day.",
            "Author": "College Freshman",
            "Date": "2014-09-26T14:58:52Z"
        },
        {
            "Rating": 5,
            "Review": "This is not a place for dieting. The food is excellent!",
            "Author": "College Senior",
            "Date": "2014-09-16T13:28:34Z"
        },
        {
            "Rating": 4,
            "Review": "Harvard Square has some really excellent restaurants, but they're often too expensive for students to regularly patronize. However, there are also your typical college student haunts: Chipotle, Tasty Burger, Pinocchio's Pizza. The biggest problem is that very few restaurants are open past 10 pm, and even IHOP closes at 4 am (Tasty Burger, Charlie's Kitchen, Pinocchio's, and Felipe's close at 2 or 3 am).",
            "Author": "College Sophomore",
            "Date": "2014-08-18T01:39:23Z"
        },
        {
            "Rating": 5,
            "Review": "There are so many little squares and areas in and around Harvard that offer some incredible cuisine. Aside from your late night burger joints, a short walk or bike ride away are places with great ethnic variety such as Brazilian, Italian, and Chinese. Tasty Burger is a drunk favorite, Felipes has greasy Mexican, and you can't beat the shakes at Shake Shack.",
            "Author": "College Junior",
            "Date": "2014-08-04T18:25:13Z"
        },
        {
            "Rating": 3,
            "Review": "HUDS is far from quality dining.  Food from the freshmen dining hall, Annenburg, is especially lacking, most likely due to its mass-production in relation to the smaller house dining halls. They do try and vary the options, as well as change them up from season to season, but the food is generally bland and either under or overcooked.  There also isn't a great variety of vegetarian/vegan options, especially if one can't eat soy.",
            "Author": "College Sophomore",
            "Date": "2014-07-15T20:12:06Z"
        },
        {
            "Rating": 4,
            "Review": "Lots of variety. Wish the entrees were better and the vegetables fresher",
            "Author": "College Sophomore",
            "Date": "2014-06-30T06:09:59Z"
        },
        {
            "Rating": 4,
            "Review": "Good campus food as far as most schools go, but the meal plan is limited (basically included with pricey tuition).  Few options for gluten-free or vegetarians or anyone with diet restrictions",
            "Author": "College Sophomore",
            "Date": "2014-06-09T22:32:21Z"
        },
        {
            "Rating": 4,
            "Review": "There are plenty of places and they are not expensive but it adds up!",
            "Author": "College Freshman",
            "Date": "2014-04-28T11:06:47Z"
        },
        {
            "Rating": 5,
            "Review": "We have a lot of great dining options, from your usual student fare to nice sit-down restaurants.  More late-night options would be nice.",
            "Author": "College Freshman",
            "Date": "2014-04-08T21:15:57Z"
        },
        {
            "Rating": 4,
            "Review": "Each house has its own dining hall where we can really get to know the staff and each other. We often have cultural foods and community nights that bring in fresh produce from the local area. If you aren't interested in the items on the menu one night, you can always make a custom order from the grill. We get 3 meals a day in the dining hall and snacks are left out until midnight during the week. All of this is incorporated into tuition.",
            "Author": "College Sophomore",
            "Date": "2014-03-25T16:58:36Z"
        },
        {
            "Rating": 4,
            "Review": "There are a lot of options within walking distance.",
            "Author": "College Freshman",
            "Date": "2014-03-14T13:18:55Z"
        },
        {
            "Rating": 5,
            "Review": "The only thing not in Cambridge/Harvard Square is your typical fast food place (e.g. McD's, Wendy's, BK), but that's not even an issue. Literally any restaurant, especially Dunks, is well within walking distance. The late-night weekend options are pretty solid.",
            "Author": "College Freshman",
            "Date": "2014-02-16T15:39:46Z"
        },
        {
            "Rating": 3,
            "Review": "HUDS (Harvard University Dining Services) isn't stellar, but it's better than is expected from dining halls.  Also, the location in Harvard Square gives options for nights off from dining hall.",
            "Author": "College Freshman",
            "Date": "2013-11-20T21:31:55Z"
        },
        {
            "Rating": 5,
            "Review": "Harvard Square is amazing for places to eat.  There are restaurants for every taste and budget, and there is always a late-night favorite open (Tasty Burger is open til 4 am every night!).",
            "Author": "College Freshman",
            "Date": "2013-11-20T21:24:11Z"
        },
        {
            "Rating": 4,
            "Review": "There are a few restaurants in the square, but it's easy to go into Boston where there are many more.",
            "Author": "College Freshman",
            "Date": "2013-11-04T19:16:20Z"
        },
        {
            "Rating": 4,
            "Review": "The food in the freshman dining hall is average. Some upperclassman dining halls are a bit better. There aren't too many options, but it's enough.",
            "Author": "College Freshman",
            "Date": "2013-11-04T19:12:36Z"
        },
        {
            "Rating": 3,
            "Review": "Restaurants have options for every wallet, and late night options keep expanding.",
            "Author": "College Junior",
            "Date": "2013-11-01T17:40:11Z"
        },
        {
            "Rating": 3,
            "Review": "There are plenty of places to eat, but the menu is almost the same at every hall.  There is little variety, though the quality is usually good.",
            "Author": "College Senior",
            "Date": "2013-08-25T19:47:32.977Z"
        },
        {
            "Rating": 4,
            "Review": "There are really good restaurants, and they are nice too.",
            "Author": "College Student",
            "Date": "2013-05-31T23:10:59.787Z"
        },
        {
            "Rating": 4,
            "Review": "It's pretty good. But the line can get long since most people congregate at one or two places.",
            "Author": "College Senior",
            "Date": "2013-03-30T20:23:19.857Z"
        },
        {
            "Rating": 3,
            "Review": "It's pretty standard, there are places like Qdoba and Chipotle, although you have to take the subway to find a fast food option like Wendy's or McDonalds.  I wish there was fast food because there aren't really any cheap options, although you can order wings from Wings over Summerville or get cheap Chinese food from the Kong, but that's about it.  It's suburban so there are a lot of restaurants.",
            "Author": "Recent Alumnus",
            "Date": "2013-03-07T14:43:29.32Z"
        },
        {
            "Rating": 3,
            "Review": "Food is unlimited at Harvard because if you eat in a dorm, you automatically get 3 square meals a day (buffet style), plus snacks at night.  Plus you can buy food at night at campus grilles run by students (although that can be expensive).  The food isn't always great.  Sometimes they do really well but mostly it's just average food.  They have to make a lot of it so it's not going to be like home cooking, but it's fine, especially if you're not picky.",
            "Author": "Recent Alumnus",
            "Date": "2013-03-07T14:41:32.1Z"
        },
        {
            "Rating": 4,
            "Review": "They are very expensive, usually it's not safe to there because the security is poor. Convenience can be rated as average. The schools do not provide for student discounts.",
            "Author": "College Junior",
            "Date": "2013-02-19T08:57:36.067Z"
        },
        {
            "Rating": 2,
            "Review": "One of the worst things about the school. Especially as a freshman, options are very limited and seldom of even decent quality. You can go to the upperclassman houses but that takes time and isn't always a viable option. Otherwise you're stuck eating in the square which is expensive and eventually boring.",
            "Author": "College Freshman",
            "Date": "2012-12-17T11:29:46.783Z"
        },
        {
            "Rating": 5,
            "Review": "Anything You Want – It's really tough to beat the dining possibilities in Harvard Square. My favorite Indian Restaurant, late-night pizza place and Thai restaurant are all within 150 yards or so of my dorm, and there must be 100-150 restaurants within easy walking distance, many open late into the night. Unless your favorite food is McDonald's or Burger King (neither is easily available for whatever reason) you'll never go hungry at Harvard.",
            "Author": "College Junior",
            "Date": "2012-08-28T16:46:00.157Z"
        },
        {
            "Rating": 3,
            "Review": "As Expected – Harvard Dining Services automatically allocates every student in Harvard housing an unlimited meal plan, meaning you can swipe into the dining hall as many times as you want every day. However the hours are difficult (ie, lunch ends at 2:15, dinner ends at 7:15) so if you're busy like every Harvard student, you end up missing a lot of meals you are paying for. There are lots of vegan, vegetarian, and locally grown options but food is pretty boring and they serve the same things every week.",
            "Author": "College Senior",
            "Date": "2012-05-15T15:04:53.187Z"
        },
        {
            "Rating": 4,
            "Review": "Great Restaurants but Some Are Pricey – Cambridge and Boston have some amazing restaurants that cover every type of cuisine imaginable.  The only obstacle tends to be price, however, if you do your research and talk to other students, there is always an affordable, delicious option!",
            "Author": "College Freshman",
            "Date": "2012-05-14T16:12:55.693Z"
        },
        {
            "Rating": 3,
            "Review": "Food Is Good, but Miss Hot Breakfast! The food is generally nice with a lot of variety (plus the ability to use any dining hall, which is really convenient!)\r\n\r\nHowever, hot breakfasts were recently limited to ONLY Sunday brunch! A big bummer during the frigid Boston winters!",
            "Author": "Recent Alumnus",
            "Date": "2012-04-03T09:44:17.987Z"
        },
        {
            "Rating": 4,
            "Review": "Tons of Off-Campus Options – Right in Harvard Square - tons of cafes, restaurants, with options at all price ranges and all types of cuisine. Only problem is that you're required to be on the school meal plan, so a major financial incentive not to explore other options :(",
            "Author": "Recent Alumnus",
            "Date": "2012-02-28T14:03:22.75Z"
        },
        {
            "Rating": 4,
            "Review": "Good Food – Although the rotation might get repetitive, Harvard offers well cooked food, including healthy options and plenty of variety",
            "Author": "College Sophomore",
            "Date": "2012-02-28T00:09:35.833Z"
        },
        {
            "Rating": 3,
            "Review": "Although there are many restaurants in Boston, students rarely venture outside of Harvard Square.  The square offers a range of dining options but they are not very affordable on a student budget.  With no real supermarket located within walking distance (there are a few tiny and highly overpriced ones in the square), and a mandatory meal plan, most students rely on the dining hall for their meals.",
            "Author": "Recent Alumnus",
            "Date": "2011-07-10T16:25:39.787Z"
        },
        {
            "Rating": 4,
            "Review": "Good but Can Be Pricey – there are so many options here, and ethnic ones at that.",
            "Author": "College Freshman",
            "Date": "2011-02-09T16:27:49.79Z"
        },
        {
            "Rating": 4,
            "Review": "Every Eats Buffet Style – Food is okay but gets old. Lots of options. They try too hard to make the entrees fancy.",
            "Author": "College Freshman",
            "Date": "2011-02-01T16:45:56.117Z"
        },
        {
            "Rating": 4,
            "Review": "Expensive but Good – Cambridge is an expensive area, so it should come as no surprise that many of the restaurants and cafes are pricey.  For the most part though, the food is well worth it.  Harvard meal options are typically pretty good, but if you feel the need to go out to eat, there are definitely some great options.  Check out Bartley's Burgers, Daedalus, and Veggie Planet.",
            "Author": "College Freshman",
            "Date": "2011-01-25T16:37:42.59Z"
        },
        {
            "Rating": 5,
            "Review": "Cambridge Has It All – Cambridge really does have something for every palate and budget.  From burritos at one of the 3 local places (Felipe's is my favorite) to upscale dining at one of the local eateries (try the restaurants at the Charles Hotel), you will never go home hungry.  There are pizza deliveries until 4am and Chinese food until 3am every night.",
            "Author": "Recent Alumnus",
            "Date": "2010-08-23T12:58:55.073Z"
        },
        {
            "Rating": 4,
            "Review": "food comes from either the home or from a vending machine.\r\nOther than that every day a couple students come by in the evening and sell some food that they make.",
            "Author": "College Junior",
            "Date": "2010-08-03T01:37:38.523Z"
        },
        {
            "Rating": 3,
            "Review": "Unlimited, but Streaky – Everyone at Harvard gets an unlimited meal plan, which is pretty convenient. The freshman dining hall serves a lot of people, so the food isn't great, and is on a 2 week cycle for the most part. The upperclassmen dining halls cater to less people, and as a result, the quality of the food is better.",
            "Author": "College Sophomore",
            "Date": "2010-06-22T04:35:53.433Z"
        },
        {
            "Rating": 5,
            "Review": "Dining Halls Great – Great place to socialize and catch up with friends.  I think the food is great (definitely better than anything I could cook!) and the dining hall staff is very friendly",
            "Author": "College Junior",
            "Date": "2010-05-25T05:39:49.007Z"
        },
        {
            "Rating": 3,
            "Review": "There are many restaurants right in Harvard square to choose from that are not too expensive and very easily accessible, but because the meal plan is basically included in our tuition most students eat in the dining halls",
            "Author": "College Junior",
            "Date": "2010-05-25T05:25:30.977Z"
        }
    ],
    "Housing": [
        {
            "Rating": 4,
            "Review": "I don't live on campus but from friends I here it is very overpriced for what you get. Overall it is livable and no big gripes other than price, great locations.",
            "Author": "College Senior",
            "Date": "2016-09-07T21:34:18Z"
        },
        {
            "Rating": 5,
            "Review": "I absolutely love the housing system here, my roommates, my entryway and my yard. Our quad is spacious with a fireplace and our common room and kitchen are great.",
            "Author": "College Freshman",
            "Date": "2016-08-31T18:34:03Z"
        },
        {
            "Rating": 4,
            "Review": "I felt as if the process by which freshman roommates are chosen was not effective in my case because my roommate and I had nothing in common and had many problems halfway through the year (leading us to separate rooms). The upperclassmen lottery to Leverett was stressful because there weren't enough options for blocking/rooming groups to stay together. Other than that, I liked Thayer and am excited to live in Leverett.",
            "Author": "College Sophomore",
            "Date": "2016-07-19T20:42:32Z"
        },
        {
            "Rating": 5,
            "Review": "The housing here is amazing. Plus, the school is very accommodating.",
            "Author": "College Freshman",
            "Date": "2016-07-03T13:35:27Z"
        },
        {
            "Rating": 4,
            "Review": "Dorms are all different across campus, but made easy by the fact that almost everyone lives on campus and there is a very strong housing community.",
            "Author": "College Sophomore",
            "Date": "2016-06-29T20:00:43Z"
        },
        {
            "Rating": 5,
            "Review": "Pretty random what type of housing you get, but overall it is pretty damn good.",
            "Author": "College Sophomore",
            "Date": "2016-06-22T12:56:52Z"
        },
        {
            "Rating": 3,
            "Review": "I think it is very expensive for the take off and you really have no choice but to take the offer",
            "Author": "College Sophomore",
            "Date": "2016-05-22T04:00:45Z"
        },
        {
            "Rating": 4,
            "Review": "I live in the Yard right now, and I really like it. It's convenient, beautiful, and pretty spacious.",
            "Author": "College Freshman",
            "Date": "2016-05-05T13:41:22Z"
        },
        {
            "Rating": 4,
            "Review": "My dorm is okay, but we have a great community.",
            "Author": "College Freshman",
            "Date": "2016-04-22T09:27:31Z"
        },
        {
            "Rating": 3,
            "Review": "Sophomore housing is pretty bad and being 'quadded' sucks",
            "Author": "College Junior",
            "Date": "2016-02-18T10:53:23Z"
        },
        {
            "Rating": 5,
            "Review": "The housing system establishes a real tight knit community by first housing all freshmen together on Harvard Yard, and then moving them to upperclassman houses where you'll meet other upperclassmen and gain an extra identity.",
            "Author": "College Freshman",
            "Date": "2016-01-19T04:48:21Z"
        },
        {
            "Rating": 4,
            "Review": "Housing is neat and effective. Students generally take care of their living spaces and the university keeps up with them as well.",
            "Author": "College Junior",
            "Date": "2016-01-13T14:31:04Z"
        },
        {
            "Rating": 5,
            "Review": "The housing is absolutely magnificent. Most housing is in beautiful nineteenth or early twentieth century buildings. While some exist, there are very few \"cinder block wall\" style rooms. The majority of the housing is fantastic -- and the newly renovated houses might be the best undergraduate housing in the world -- but there are some stinkers. Most people who have the less desirable housing come to love it though.",
            "Author": "College Sophomore",
            "Date": "2016-01-03T16:22:25Z"
        },
        {
            "Rating": 3,
            "Review": "No air conditioning (which is only a problem in August). Freshman and upperclassman housing experiences can vary greatly. Nearly everyone lives in the dorms/upperclass houses, so it's a good atmosphere.",
            "Author": "College Freshman",
            "Date": "2015-12-29T16:24:42Z"
        },
        {
            "Rating": 3,
            "Review": "My dorm is extremely close to all of my classes and the dining hall.",
            "Author": "College Freshman",
            "Date": "2015-12-29T12:12:56Z"
        },
        {
            "Rating": 3,
            "Review": "Living on campus is the only way to get to know your fellow world-changers (and those who may not change the world)! Just hope you don't live outside of the Yard freshman year or in the Quad as an upperclassman.",
            "Author": "College Freshman",
            "Date": "2015-12-27T00:49:17Z"
        },
        {
            "Rating": 4,
            "Review": "It is well-maintained and has a great atmosphere.",
            "Author": "College Freshman",
            "Date": "2015-04-29T07:58:31Z"
        },
        {
            "Rating": 2,
            "Review": "no one lives off campus",
            "Author": "College Freshman",
            "Date": "2015-04-08T16:27:05Z"
        },
        {
            "Rating": 4,
            "Review": "We have residential houses and those are the best",
            "Author": "College Freshman",
            "Date": "2015-04-08T16:19:47Z"
        },
        {
            "Rating": 5,
            "Review": "Living on campus has been one of the best experiences of my freshmen year. The housing is really nice and the housing lottery for upperclassmen houses is random and worked out well for me. The freshman dining hall could be better, but otherwise, it's a dream come true.",
            "Author": "College Freshman",
            "Date": "2015-03-21T21:34:48Z"
        },
        {
            "Rating": 4,
            "Review": "Solid housing, ideally located in Harvard Yard right near academic buildings.",
            "Author": "College Freshman",
            "Date": "2015-03-15T17:39:02Z"
        },
        {
            "Rating": 4,
            "Review": "Living in the yard is truly a unique experience. The housing is pretty great no matter where you are as a freshman, and only gets better as you become an upperclassman due to the recent renovations.",
            "Author": "College Freshman",
            "Date": "2014-09-26T14:45:43Z"
        },
        {
            "Rating": 2,
            "Review": "A single, tiny room with shared bath could cost $800-$900+. One woman was offering a tiny section of attic which could only be accessed through a bathroom- no fan or air conditioner, for $750!!! Many of the landlords my friends and I have dealt with are charlatans. They see students as cash cows and take advantage of them. I've heard many horror stories. There should be a law against what those so-called landlords do, especially considering they don't report the additional income to the IRS.",
            "Author": "College Senior",
            "Date": "2014-09-16T13:26:26Z"
        },
        {
            "Rating": 2,
            "Review": "Depending on which building one lives in, it can be extremely loud from dorm neighbors and traffic and other noise from the streets. My dorm, Adams House, was not conducive to studying or sleeping most of the time. During the summer, the fans were inadequate, but we weren't allowed to have air conditioners. People would have barbeques in the courtyard and smoke blew in through our windows, which we had to close. It was stifling. I was very disappointed.",
            "Author": "College Senior",
            "Date": "2014-09-16T13:16:08Z"
        },
        {
            "Rating": 5,
            "Review": "The Harvard housing system is one of the best and really fosters a great social atmosphere and community! Freshman live together in the central part of campus and really get a feel for the college. As an upperclassman, you live with your friends in an upperclassman residence and get to get to know people from every year and a great group of advisors!",
            "Author": "College Junior",
            "Date": "2014-08-04T18:03:38Z"
        },
        {
            "Rating": 3,
            "Review": "It is pretty expensive, as it is mostly graduate students and teachers. Most undergrads live on campus.",
            "Author": "College Junior",
            "Date": "2014-08-04T17:59:15Z"
        },
        {
            "Rating": 4,
            "Review": "Housing at Harvard is unique and one of the things that sets it apart from other schools. All freshmen live in the Yard, until they are randomly sorted into upperclassmen houses, which become important communities for the next three years. In general, there are all the amenities one could ask for, but that does not mean that the actual rooms themselves are great. It's a mixed bag in terms of space and accommodations very by house.",
            "Author": "College Sophomore",
            "Date": "2014-06-29T21:38:30Z"
        },
        {
            "Rating": 5,
            "Review": "Beautiful dorms, most are quite large and luxurious.  The freshman dorms are kind of dusty, though.  And a few upperclassman dorms are kind of far from the center of campus, although probably much closer than dorms at most schools.  A lot are right on the Charles River, as well!  The housing process is a lot of fun - you choose a blocking group to be housed with and upperclassmen storm the yard at like 7 am one morning to deliver housing letters!",
            "Author": "College Sophomore",
            "Date": "2014-06-09T22:28:34Z"
        },
        {
            "Rating": 3,
            "Review": "It's college housing, what can you expect. As a freshmen its not the best but gets better as you get older!",
            "Author": "College Freshman",
            "Date": "2014-04-28T11:17:35Z"
        },
        {
            "Rating": 5,
            "Review": "Adams House is the best house.",
            "Author": "College Freshman",
            "Date": "2014-04-08T21:12:34Z"
        },
        {
            "Rating": 3,
            "Review": "Living on campus all four years is great until you get out into the real world and realize you have no idea about how to find a good deal on an apartment.",
            "Author": "College Junior",
            "Date": "2014-04-08T01:42:29Z"
        },
        {
            "Rating": 4,
            "Review": "While the rooms aren't necessarily new, there is a lot of history in the buildings and they are all so unique. Everyone loves their houses and thinks theirs is the best.",
            "Author": "College Sophomore",
            "Date": "2014-03-25T17:13:18Z"
        },
        {
            "Rating": 5,
            "Review": "The house system at Harvard is amazing. It's like Hogwarts and almost everyone lives on campus.",
            "Author": "Recent Alumnus",
            "Date": "2014-03-10T21:09:13Z"
        },
        {
            "Rating": 4,
            "Review": "Beautiful buildings. Older, but well maintained",
            "Author": "College Junior",
            "Date": "2014-02-24T00:09:30Z"
        },
        {
            "Rating": 5,
            "Review": "Wicked spacious, super fancy — easily the best dorms I've seen at any college. My freshman dorm has hardwood flooring, a marble-floored foyer, exposed brick and wood-panelled walls, and legit so much room. Kinda ridiculous how much space even the frosh dorms have, and then it only gets better as you become an upperclassman.",
            "Author": "College Freshman",
            "Date": "2014-02-16T15:28:52Z"
        },
        {
            "Rating": 5,
            "Review": "The campus housing is unique and amazing with an experience like no other.",
            "Author": "College Sophomore",
            "Date": "2013-12-01T13:37:36Z"
        },
        {
            "Rating": 4,
            "Review": "Anyone that legitimately complains about housing has a problem. The worst of our housing is still in the top 0.5% of all college housing.",
            "Author": "College Junior",
            "Date": "2013-11-01T17:38:35Z"
        },
        {
            "Rating": 3,
            "Review": "Almost no students choose to live in off-campus housing, and if you do, it's not really off-campus housing. They're special co-ops meant for students who would prefer to cook their own food (the property is still owned by Harvard). Almost everyone is a part of house life--the houses are the backbone to student life and it's much easier to live in those communities where dining and advising is automatically provided. Living off-campus is pretty inconvenient in Cambridge.",
            "Author": "College Sophomore",
            "Date": "2013-07-28T12:36:16.757Z"
        },
        {
            "Rating": 4,
            "Review": "Housing at Harvard has been amazing in my experience. Great rooms with much more space than your average college dorm.",
            "Author": "College Junior",
            "Date": "2013-07-18T18:27:14.443Z"
        },
        {
            "Rating": 5,
            "Review": "the campus is really nice, it all depends on the amount you pay",
            "Author": "College Senior",
            "Date": "2013-04-30T13:06:41.593Z"
        },
        {
            "Rating": 5,
            "Review": "The dorms at Cronkhite are great. They have a really nice dining hall where everyone loves hanging out in, with a great variety of buffet, too. It's close to the School of Education Gutman Library and surrounded by shops, restaurants, book stores.",
            "Author": "Recent Alumnus",
            "Date": "2012-12-12T21:49:56.307Z"
        },
        {
            "Rating": 3,
            "Review": "I feel the housing needs to have lower costs for what they are. Proximity is great, but the quality of the housing does not justify the costs. Lots of options so it's hard to not find one.",
            "Author": "College Sophomore",
            "Date": "2012-11-05T23:51:36.273Z"
        },
        {
            "Rating": 5,
            "Review": "There are amazing options for on-campus housing at Harvard. Your freshman year you are assigned to one of the 17 dormitories that lie right in the middle of campus, which are super close to most of the classes you will be attending. The freshman dorms all vary in age, style, spaciousness, but the freshman dorms are one of the most spacious and convenient housing buildings on campus. Then after freshman year, you get randomly (which some people dislike) placed into one of the 12 upperclassmen houses (similar to how the sorting hat in Harry Potter works) with your chosen group of friends, and you stay within your house for the next 3 years unless you petition to change houses. Then after your sophomore you partake in the house lottery which allows you to choose what room you want in the house, so this means if you are lucky you can snag an amazing room or suite of rooms or if you are unlucky you might have a smaller space. Everyone is charged on their term bill the same set amount for room and board but financial aid is amazing if you are worrying about that. Houses vary in style, age, spaciousness, and distance from the main campus, but even the furthest house is only a 15 minute walk to the center of campus and there are shuttles. The basic rule is that the closer houses are much older in style (wood everything) but smaller in space (there is a possibility of living in a double even through your senior), while the further houses are a bit more modern but have the most space (most of the houses that guarantee singles all 3 years are the furthest houses). Honestly, the pros and cons cancel each other out so it barely matters what house you get into. What determines how much you love your house life all matters on what you make of it and if you are living with people you enjoy living with.",
            "Author": "College Sophomore",
            "Date": "2012-10-08T04:25:24.593Z"
        },
        {
            "Rating": 3,
            "Review": "Close and Accommodating but Small and Expensive – The apartments are all around the campus so commuting to campus isn't a problem. The real expenses come in the cost of rent, which I am guessing because of Boston's high cost of living, not to mention how much everything is compacted there. Despite these setbacks, the apartments are usually furnished and accommodate every need.",
            "Author": "College Sophomore",
            "Date": "2012-08-16T19:07:28.68Z"
        },
        {
            "Rating": 5,
            "Review": "Amazing Housing – beautiful places, a family environment, very spacious. very accommodating.",
            "Author": "College Sophomore",
            "Date": "2012-08-13T12:52:22.233Z"
        },
        {
            "Rating": 2,
            "Review": "Off-Campus Is a Hassle in Which Few Students Participate – Because of the strength of on-campus housing and because of the huge expense of apartments in Cambridge, few Harvard students live off campus.  It is far more cost effective to live in the dorms, however, if a student were really intent on living in an apartment, there would likely be a large availability.  With the large amount of graduate schools in the area, a lot of people look to rent out their apartments or even just rooms to students.",
            "Author": "College Freshman",
            "Date": "2012-05-14T16:05:49.913Z"
        },
        {
            "Rating": 1,
            "Review": "While almost 95% of undergraduate students chose to live in on-campus housing, the few who do venture outside the Yard are often those who wouldn't ever need to consider the cost of living in an apartment. Apartments around campus are expensive, usually pretty old, and worn out from its previous college residents. For those who find cheaper or at least reasonable housing, it's usually pretty far away from the center of campus, inconvenient, and still more costly than other colleges in the area.",
            "Author": "Recent Alumnus",
            "Date": "2012-04-03T09:36:15.723Z"
        },
        {
            "Rating": 4,
            "Review": "Nice Dorms – No real need for off campus housing, everyone lives in dorms.",
            "Author": "College Sophomore",
            "Date": "2012-01-30T21:31:30.717Z"
        },
        {
            "Rating": 3,
            "Review": "On-Campus Is the Way to Go! On-campus housing is cheaper and you feel more so a part of the community. I honestly don't know of anyone living off campus, but it can be pretty expensive and difficult to find a place near by. Honestly, i don't think it's worth it, even if you can afford it. On-campus living also makes me feel personally safer.",
            "Author": "College Sophomore",
            "Date": "2012-01-19T01:29:47.517Z"
        },
        {
            "Rating": 4,
            "Review": "Your Social Sphere for 3 Years – House life is wicked fun.  There's not a lot of inter house mixing so when dining in a different house farthest away from your own house the faces will more unfamiliar.  Freshman dorms range, but for the most part are pretty nice and the proximity to classes is unparalleled.",
            "Author": "College Junior",
            "Date": "2011-09-28T02:14:30.13Z"
        },
        {
            "Rating": 3,
            "Review": "Do not know much about off campus housing, but from what I've heard from the couple friends who use it, Harvard helps with expenses somewhat but not greatly and the cost of living in Cambridge and surrounding areas is really high. Paring is ridiculously expensive but even worse than normal for on campus parking.",
            "Author": "College Sophomore",
            "Date": "2011-05-17T16:47:10.82Z"
        },
        {
            "Rating": 4,
            "Review": "The Dorms – The freshman dorms at Harvard College aren't perfect, but the options are wonderful for upper class students. Esspecially new dorms have great facilities.",
            "Author": "College Student",
            "Date": "2011-02-11T04:47:19.6Z"
        },
        {
            "Rating": 2,
            "Review": "Just Not Worth It – On campus, the dorms are organized into 12 self-sufficient communities called \"Houses\" that each house a few hundred sophomores through seniors (freshmen get their own dorms).  Each house has a dining hall, resident tutors, a variety of academic and personal support, libraries, and exercise facilities.  Thus, most students do not find it worth it to fork out the gouging apartment rents of the Harvard Square area.  While housing off campus may allow for more \"freedom\", the Houses on campus are very lenient and thus the cost/benefit analysis comes out against off campus housing.",
            "Author": "Recent Alumnus",
            "Date": "2010-08-23T12:50:09.8Z"
        },
        {
            "Rating": 5,
            "Review": "Upperclassman Houses – Living in one of Harvard's 12 upperclassman houses is one of the best things about attending Harvard.  House life and house community really make being a school a home away from home",
            "Author": "College Junior",
            "Date": "2010-05-25T05:26:31.597Z"
        },
        {
            "Rating": 3,
            "Review": "Rarely Necessary – There are definitely apartments close to campus and, considering how much room and board costs, you can pay relatively low rent (as low as you're going to get in Boston/Cambridge, anyway). Still, off-campus housing isn't something I would recommend because the House system is a pretty big part of the Harvard experience. Very few people live off campus and it can be pretty alienating even if you find a good spot.",
            "Author": "College Junior",
            "Date": "2010-05-07T11:57:21.59Z"
        }
    ]
}