{
    "Overall%20Experience": [
        {
            "Rating": 5,
            "Review": "The Massachusetts Institute of Technology (MIT) is widely regarded as one of the premier institutions for science, technology, engineering, and mathematics (STEM) in the world. Located in Cambridge, Massachusetts, MIT has built a reputation for its rigorous academic programs, cutting-edge research, and innovative culture.",
            "Author": "Graduate Student",
            "Date": "2025-02-09T02:00:21.340931Z"
        },
        {
            "Rating": 5,
            "Review": "MIT offers an unparalleled academic experience with world-class faculty, cutting-edge research, and a collaborative culture. The opportunities for innovation, networking, and career advancement are exceptional. I particularly appreciated the supportive community and access to state-of-the-art facilities. However, the rigorous workload can be overwhelming, and balancing academics with personal life is challenging. Financial aid is generous but could be more inclusive for middle-income families. Overall, MIT fosters an environment for driven individuals to excel and make an impact. It’s ideal for those passionate about solving real-world problems, but prospective students should be prepared for its intensity and high expectations.",
            "Author": "Freshman",
            "Date": "2024-12-30T19:06:58.777769Z"
        },
        {
            "Rating": 5,
            "Review": "It is one the top ten colleges in the world and I am happy to be here. I grateful for this college and there are million kind words to describe this college.",
            "Author": "Freshman",
            "Date": "2024-11-23T00:22:43.150925Z"
        },
        {
            "Rating": 5,
            "Review": "Rigorous yet rewarding educational experience, especially in the fields of robotics and mechanical engineering.",
            "Author": "Graduate Student",
            "Date": "2024-09-29T01:27:24.807947Z"
        },
        {
            "Rating": 5,
            "Review": "Excellent academics, but as the students say, it really is \"drinking from a firehose.\" There are some truly amazing people at MIT, and Cambridge has gotten better over the years.",
            "Author": "Alum",
            "Date": "2024-09-25T21:22:15.730379Z"
        },
        {
            "Rating": 5,
            "Review": "As a student at MIT, I can confidently say that the experience is both challenging and rewarding. The academic rigor here is unmatched; classes are fast-paced and intellectually stimulating, pushing you to think critically and creatively. The professors are not only experts in their fields but also genuinely invested in their students’ success. \n\nCollaboration is a core aspect of MIT culture, and I love working alongside brilliant peers who inspire me to think outside the box. The resources available—from cutting-edge labs to research opportunities—are incredible. \n\nOutside the classroom, the vibrant campus life offers a variety of clubs, events, and hackathons, ensuring there’s never a dull moment. While the workload can be intense, the support system among students and faculty is phenomenal. Overall, MIT is a place where passion meets innovation, making it an unforgettable journey.",
            "Author": "Other",
            "Date": "2024-09-21T18:11:47.706828Z"
        },
        {
            "Rating": 5,
            "Review": "I really like the academic rigor and prestige that comes with attending MIT. There are so many amazing people that I have met, although the food scene could use some improvement.",
            "Author": "Sophomore",
            "Date": "2024-07-17T18:40:34.775691Z"
        },
        {
            "Rating": 5,
            "Review": "My experience has greatly exceeded my already-high expectations.  My professors have always been available and the opportunity to apply my studies and skills to research projects was great.   My fellow student are good people and everyone in have met has some kind of truly unique capability.  I have learned that being in the top 99% of GPA and test scores is great, but I routinely meet people in the top 99.5% and they seem many times smarter than me.  Being around people like this keep me humble and motived.  I like party scene, as I can alway find something fun to do whenever time allows.  I also like that most of my colleagues are not trying to 'look' smart...and anyone who would try this would soon find that someone right next to them is many time more capable.  I really like this place.",
            "Author": "Other",
            "Date": "2024-07-10T20:10:47.455031Z"
        },
        {
            "Rating": 5,
            "Review": "I really love the campus, it is a vibrant environment and very diverse. I feel welcome there and feel as if it is a home away from home.",
            "Author": "Graduate Student",
            "Date": "2024-07-09T15:22:42.753434Z"
        },
        {
            "Rating": 3,
            "Review": "MIT has great academics. It’s located near Boston so it is around a lot of places and other colleges. However the weather is scuffed. Also MIT’s campus is um…. Not pretty (to say the least). You definitely have to go out of your way to find fun things on campus— fun does not come to you. Some students have a hard time at MIT, especially mentally. Personally I’m not in tune with my emotions enough to let MIT get me down, but it’s very common at such a school.",
            "Author": "Sophomore",
            "Date": "2024-06-23T23:26:29.858456Z"
        },
        {
            "Rating": 5,
            "Review": "I really appreciated the many opportunities to get involved in challenging stem coursework and research, as well as the amazing community of fellow students and professors to learn from.",
            "Author": "Senior",
            "Date": "2024-06-15T15:04:44.569774Z"
        },
        {
            "Rating": 5,
            "Review": "This is a great university for expanding your horizons, especially if you are from a small area. The initial year gives a lot of freedom for exploring options for your major, and there are great support systems from both students and administration that help adjust to being an MIT student. There are plenty of readily available resources in various departments that allow for personal or academic exploration without having to worry about cost.",
            "Author": "Junior",
            "Date": "2024-06-05T19:13:53.895604Z"
        },
        {
            "Rating": 5,
            "Review": "Just about as academically difficult as you might expect. There's no lack of exciting extracurricular activities though.",
            "Author": "Freshman",
            "Date": "2024-03-27T00:01:07.658651Z"
        },
        {
            "Rating": 5,
            "Review": "Great place to be challenged, learn, and grow. A safe environment to fall and fail. Lots of support and resources available but you need to take the initiative to reach out about them",
            "Author": "Sophomore",
            "Date": "2024-03-08T19:06:01.944747Z"
        },
        {
            "Rating": 5,
            "Review": "I am pleased with my experience at MIT. I got a full ride scholarship and also there is an excellent environment here .",
            "Author": "Junior",
            "Date": "2023-12-04T13:33:52.386093Z"
        },
        {
            "Rating": 5,
            "Review": "Like many  students at MIT, I stepped foot on campus with imposter's syndrome--terrified that I had just set myself up for failure. I met a few friends here and there, and slowly realized that I am not alone. We all just opened a new chapter of our lives, eager to see where it would lead. And the only way to truly cherish this chapter was to do it together. So we did. We went to lectures together, marvelling at our professor's world renowned research. We attempted problem sets together, struggling with questions of difficulty we hadn't seen before. We walked across the bridge to Boston together, exploring the new city we began to call home. We laughed in our dorm rooms, joking with new friends and roommates. We partied on the weekends, celebrating the end of a stressful week. We studied hard in the library late at night until we fell asleep. MIT taught me that I don't have to do this alone--I'm not supposed to. My friends, my family, my community... WE do this together.",
            "Author": "Sophomore",
            "Date": "2023-07-06T12:45:29.517887Z"
        },
        {
            "Rating": 5,
            "Review": "I've really liked the clubs I've joined and the people that I have met here. One recurring issue is the reliability of the wifi on campus.",
            "Author": "Freshman",
            "Date": "2023-06-28T23:16:45.753054Z"
        },
        {
            "Rating": 5,
            "Review": "Studying at the MIT has been an enlightening and enriching journey. The opportunity to learn from some of the most distinguished professors and work with bright, ambitious peers is unparalleled.\n\nThe curriculum is rigorous and challenging, which I appreciate as it pushes students to their intellectual limits. MIT's focus on combining theory with practical application is particularly engaging. For example, not only did I learn the theory behind machine learning algorithms, but I also got to implement these algorithms to solve real-world problems. This hands-on approach is what sets MIT apart from many other institutions.\n\nFurthermore, MIT's culture of innovation and entrepreneurship is highly motivating. The environment encourages students to think outside the box, fostering an innovative mindset. It's also commonplace for undergraduates to work in research labs, contributing to groundbreaking advancements in various fields.",
            "Author": "Freshman",
            "Date": "2023-06-15T19:22:40.138903Z"
        },
        {
            "Rating": 5,
            "Review": "At MIT, it truly is \"drinking from the firehose\" as they like to describe. While classes are intense, I found my peers to be extremely willing to help and work through our homework together. I never felt like I couldn't ask for help from my friends. Between professors and classmates, you'll find a very supportive environment and collaborative culture. In terms of social life, I was surprised by how much MITers like to party and socialize. Unlike other universities, most of the party scene is in the fraternities (>50% of MIT men are affiliated in Greek life). Majority of students live on-campus, or in independent living groups close to campus, which creates a really tight-knit community feel with campus. A few things I would like to see change are MIT Admin's focus on student life and amenities. Over my years at MIT, there were many issues regarding dorms shutting down, facilities being outdated (e.g., student center). Would love to see more investment in student life in the future",
            "Author": "Alum",
            "Date": "2023-05-30T15:00:01.328972Z"
        },
        {
            "Rating": 5,
            "Review": "I am an incoming freshman, so my experience is very limited. I have had two visits for volleyball and a campus preview weekend. During those times I felt extremely welcomed and the school felt as collaborative as it is known for. Overall, I have had only great experiences at MIT so far and I am confident that will continue.",
            "Author": "Other",
            "Date": "2023-05-18T05:35:25.047317Z"
        },
        {
            "Rating": 5,
            "Review": "My experience at MIT has been fruitful. I have learned a lot more than I could have ever imagined, and I am grateful for all the professors and fellow students who were able to help me grow as a scholar. Although the work was tough at times, I was able to push through by assistance from amazing peers and mentors who understood the value of education and learning. Personally, I would like to see more transparency in terms of grading, as there is some grade deflation that occurs in the school and is not laid out very clearly.",
            "Author": "Senior",
            "Date": "2023-05-16T18:25:39.81309Z"
        },
        {
            "Rating": 3,
            "Review": "Academically, the school is absolutely wonderful. The professors were amazing and very helpful and understanding. I took physics, Calculus, philosophy, and an extra smaller physics class with a professor who is a Nobel laureate which was an incredible experience. Socially, the campus is very diverse and people are welcoming and collaborative albeit a bit reserved most of the time. I received a lot of support from the deans and MIT therapy department which were both wonderful and I would highly recommend taking advantage of.",
            "Author": "Freshman",
            "Date": "2023-05-11T21:17:45.213247Z"
        },
        {
            "Rating": 5,
            "Review": "I got my PhD from MIT in Civil and Environmental Engineering. It was the most challenging and transformative experience of my life.  I was lucky to work a super smart academic advisor for 6 years. I am eternally grateful for the experience.",
            "Author": "Alum",
            "Date": "2023-04-15T20:35:11.283737Z"
        },
        {
            "Rating": 5,
            "Review": "Its MIT. Everything is awesome. You can study anything your heart desires. Its extremely rigorous so be prepared to put in the work. If you are not prepared to cope do not come.",
            "Author": "Graduate Student",
            "Date": "2023-04-01T02:57:11.736194Z"
        },
        {
            "Rating": 5,
            "Review": "I earned a Masters of Linguists, then a Ph.D. in neuroscience. I enjoyed the extremely high-level of education and the professors. I had taken a lot of overloads, as the environment is so focused, with so much mental stimulation for a curious person like me.\n\nNowhere else could I enjoy the number of weird students with high-performing Asperger's spectrum (not a disorder, but geniously-abled), that a meal with them and other activities were always an adventure in ethnography (I kept a notebook of observations).\n\nIf you want a \"normal\" higher-education experience, with lots of parties, go down the street and enroll at Harvard, where admissions is far, far easier, and the academic pressure is infinitely easier.",
            "Author": "Alum",
            "Date": "2023-03-22T22:28:44.071289Z"
        },
        {
            "Rating": 5,
            "Review": "Excellent professors and student body. Boston is best environment for college students. Housing and food average athletics only intramural",
            "Author": "Graduate Student",
            "Date": "2023-01-31T04:48:23.145373Z"
        },
        {
            "Rating": 5,
            "Review": "This is a great school! I loved attending it! Lot of good resources, good teachers, and opportunities.",
            "Author": "Sophomore",
            "Date": "2023-01-17T02:24:49.949351Z"
        },
        {
            "Rating": 5,
            "Review": "Haven't attended yet but the campus and faculty are all super friendly and passionate about their relative topics of study. I am really excited to attend based on my past visits there.",
            "Author": "Niche User",
            "Date": "2023-01-02T17:10:46.987192Z"
        },
        {
            "Rating": 5,
            "Review": "MIT is the best school if you like math, science, computer science or many other subjects. MIT's culture is to help each other and succeed together.",
            "Author": "Freshman",
            "Date": "2022-12-30T18:11:37.67728Z"
        },
        {
            "Rating": 5,
            "Review": "MIT is a life-changing place with great professors and intelligent students. The students are absolute geniuses, as am I. - Leo",
            "Author": "Junior",
            "Date": "2022-11-04T04:08:09.945996Z"
        },
        {
            "Rating": 5,
            "Review": "I greatly enjoyed my time at MIT! I was given the chance to learn with experts in their fields who were flying back and forth to DC to inform the most important decisions. I loved the collaborative mentality on campus and the ability to work together with classmates to all learn the most and succeed.",
            "Author": "Senior",
            "Date": "2022-11-03T15:37:42.34433Z"
        },
        {
            "Rating": 4,
            "Review": "Very good research opportunities, very bad campus dining but diverse surrounding area with good food, sights, and housing albeit expensive.",
            "Author": "Senior",
            "Date": "2022-10-22T08:36:46.324934Z"
        },
        {
            "Rating": 5,
            "Review": "Just got admitted this past year. The orientation programs and Campus Preview Weekend were both amazing experiences.",
            "Author": "Freshman",
            "Date": "2022-08-11T21:12:14.734142Z"
        },
        {
            "Rating": 5,
            "Review": "Great peers, caring professors, challenging content, but an incredible experience. You get into it what you put out of it.",
            "Author": "Sophomore",
            "Date": "2022-07-18T12:13:00.355784Z"
        },
        {
            "Rating": 5,
            "Review": "Though the academics can be undoubtedly stressful and challenging, the people and opportunities at MIT truly make the experience worthwhile. I am supported by a fantastic dorm community, really supportive professors, and am always excited by the ways I can get involved in my own research and education.",
            "Author": "Sophomore",
            "Date": "2022-07-17T18:27:59.99212Z"
        },
        {
            "Rating": 5,
            "Review": "The community is very focused on collaboration over competition and this is evident in every aspect of the school from the administration to the students. Financial aid at MIT is also exceptional. My academic experience so far has been challenging but manageable thanks to the array of student help services found around the school. In addition, the health services provided by MIT Medical are extremely helpful. The only complaint I have is that I felt unprepared going into my first semester because I did not know what classes to take or what to expect, but this seems fairly standard for college experiences.",
            "Author": "Freshman",
            "Date": "2022-06-27T04:07:33.66846Z"
        },
        {
            "Rating": 5,
            "Review": "Sheldon Cooper, Leonard Hoffstadter, Rajesh Koothrappali, Amy Farrah-Fowler, Bernadette Rostenkowski, Howard Wolowitz, Barry Kripke, Bert Kibbler, Leslie Winkle. Must I say any more?",
            "Author": "Niche User",
            "Date": "2022-04-29T17:17:15.070844Z"
        },
        {
            "Rating": 5,
            "Review": "MIT is every bit as amazing as you've heard. Opportunities afforded MIT students would be unimaginable for students at most schools. So too workload, course rigor, social scene, creativity & level of student & faculty accomplishments. Yeah there are unfortunate MIT stereotypes, they're far from reality; Maybe generated by people at other schools to help them feel better about not being at MIT. \n\nOne aspect of MIT worth mention-money doesn't rule. Getting a deposit in quickly won't get you a better dorm. No deposit is required. You won't be closed out of MIT related trips cause you can't afford them.MIT doesn't charge for them. Admit chances aren't higher if you're wealthy, donate money, mom went to MIT.  You won’t be surrounded by people who flaunt money or use it to beat out others. It’s not lack of students from wealthy families but money isn't coin of realm-that's achievement. Looking for a place where money speaks more? Go up Mass Ave.",
            "Author": "Alum",
            "Date": "2022-02-25T20:33:03.052726Z"
        },
        {
            "Rating": 5,
            "Review": "A great school with incredible culture and an amazing student body. It's often absolutely overwhelming and there are certainly a lot of issues to be found, but there isn't anywhere I'd rather spend my college years.",
            "Author": "Junior",
            "Date": "2022-02-04T06:37:30.564791Z"
        },
        {
            "Rating": 5,
            "Review": "Currently reaching near the middle of my time here, and this school truly works you to the bone. The baseline of this place is that everyone is very smart. Some are decently smart and work hard enough to get in, others come in doing Olympiads from when they were 5 years old.\n\nThe students are very diverse. Some come in \"normal\", others finally get to truly express the weird and unique that they've been suppressing their whole lives. The campus is extremely welcoming and you really get to be who you want to be; it's very beautiful. Each dorm has an extant history and culture; you can automatically learn about someone by what dorm they live in.\n\nThe academics are exceedingly difficult by content and pace. The problem set difficulty are elevated beyond a typical school's, and they force you to collaborate with others. Everyone must collaborate. You're forced to learn time management skills.\n\nI was finally able to satisfy my love for learning here. Truly an amazing and unique school!",
            "Author": "Sophomore",
            "Date": "2022-01-10T03:28:43.72964Z"
        },
        {
            "Rating": 5,
            "Review": "Best place to challenge yourself academically. However, time management is a must if you want to get enough sleep to even function.",
            "Author": "Sophomore",
            "Date": "2021-12-31T02:48:27.582613Z"
        },
        {
            "Rating": 5,
            "Review": "Amazing classes offered and very flexible with exploring classes and choosing classes to take for your major. Also provides a diverse class selection, including STEM, humanities, research, ethics, arts, social sciences, and physical education. \nAlso great, collaborative student body that's very hard-working and amiable. The professors are also very interested and engaged in what they do. \nMIT also offers a very strong mental support system with many resources for dealing with counseling, unique circumstances, and other struggles.",
            "Author": "Sophomore",
            "Date": "2021-12-31T00:13:05.66704Z"
        },
        {
            "Rating": 5,
            "Review": "It was great It was great It was great It was great It was great It was great  It was great It was great",
            "Author": "Freshman",
            "Date": "2021-11-19T13:42:15.994184Z"
        },
        {
            "Rating": 4,
            "Review": "SO supportive of students\n\nWhen speaking to friends who attend other colleges, I am repeatedly shocked by the lack of resources they have compared to MIT. Our S^3, DAS, and TSR^2 departments have saved my life so many times.\n It's so easy to make an appointment with mental health services, although they are overloaded.\n\nAre most people here somewhat depressed? Yes, at least in my experience. \n\nThere seems to be a great divide between the neurodivergent-LBGT-weird East side of campus and the more normal west side of campus, and I can only offer the East campus perspective (Random Hall). MIT does seem to be doing actions that suppress the east campus side, which is bad. \n\nBut I don't think I would go anywhere else. The people here are very genuine, if stressed; the financial aid is great; Admissions and S^3 and some other departments really care about the kids; there is so much opportunity; and we're WAY better than harvard.",
            "Author": "Freshman",
            "Date": "2021-10-27T18:21:17.146506Z"
        },
        {
            "Rating": 5,
            "Review": "The great college in all aspects of teaching, student life, campus and so no. Next year i will go to grade school.",
            "Author": "Graduate Student",
            "Date": "2021-09-01T07:20:50.859039Z"
        },
        {
            "Rating": 5,
            "Review": "It is amazing and it is the best college in the world. It is really fun and has great food. It also has a lot of diversity.",
            "Author": "Niche User",
            "Date": "2021-05-13T13:25:29.763983Z"
        },
        {
            "Rating": 5,
            "Review": "it was an experience of a lifetime. it was always my dream to go to mit just to see what it was like and it was something I will always cherish",
            "Author": "Niche User",
            "Date": "2021-03-12T14:12:33.797656Z"
        },
        {
            "Rating": 4,
            "Review": "it’s alright; the professors are very smart and the people are super interesting. there are a lot of research opportunities.",
            "Author": "Freshman",
            "Date": "2021-03-07T10:50:22.319194Z"
        },
        {
            "Rating": 5,
            "Review": "Best experience of my life; like a kid in a candy store.  You are exposed to so many different \"flavors\" of things to learn.",
            "Author": "Alum",
            "Date": "2021-02-27T21:48:38.863882Z"
        },
        {
            "Rating": 5,
            "Review": "I really like the collaboration that I have with other students, my professors, and my TAs/mentors. MIT has so many academic tutoring programs that I enjoy attending. Also, I love the different independent research opportunities and clubs that I'm in. These really help me progress in my career development and give me some social time with others outside of class.",
            "Author": "Freshman",
            "Date": "2020-11-06T07:22:33.225383Z"
        },
        {
            "Rating": 5,
            "Review": "Going into MIT I though I was smart - really smart, but I later found out that, yes, while I am smart, everyone else here is SUPER smart. This can go two ways - you can fall victim to imposter syndrome (believing you don't belong, you're not good enough) or you can rise to the occasion and leverage your peers and upperclassmen friends. That is what makes MIT - the people here are unlike people you've ever met. They're supportive, helpful, passionate, and they CARE about you more than you think. MIT is a tough place and it will put you in your place, but it does that to everyone. The playing field is even, there's no grading on a \"curve\" and we're not too competitive with each other (when it comes to classes). Your friends will help you with psets, career advise, clubs, and everything else - just as you would help them too. MIT is its own beautiful community with a home for everyone.",
            "Author": "Junior",
            "Date": "2020-08-28T12:05:42.988981Z"
        },
        {
            "Rating": 4,
            "Review": "I've had a somewhat unique experience at MIT because unlike the majority of students, I'm not an engineering major. (GASP!) I majored in Brain & Cognitive Sciences (essentially neuroscience) and minored in Anthropology. I adored both of those departments - the classes, the teachers, the admins, the research opportunities. I know some other majors like chemical engineering are more difficult and aren't quite as adored by their students. \n\nIf you ask a student what there favorite part about MIT is, 90% of the time they will say the people. Being a specialized and somewhat quirky school, students at MIT have so much in common. Usually, that commonality is a passion to make a difference, openmindedness/acceptance, and a desire to play hard when not studying. Our student groups are varied and vibrant and our party scene is known as the best in Boston, but ultimately, we thrive on our close-knit community and appreciation for one another.",
            "Author": "Senior",
            "Date": "2020-04-30T23:07:12.941051Z"
        },
        {
            "Rating": 5,
            "Review": "Very good college for the learning point of view. Diversified culture, campus is cool and professors here are highly talented.",
            "Author": "Junior",
            "Date": "2020-04-29T05:22:08.415774Z"
        },
        {
            "Rating": 5,
            "Review": "The student body is so passionate and self driven. They push me to be a better student. The opportunities gained from attending MIT are immense. I have also found a great community of people here, and feel that the classes, though rigorous, are truly preparing me to do great things in the world.",
            "Author": "Freshman",
            "Date": "2020-04-04T18:28:59.991604Z"
        },
        {
            "Rating": 5,
            "Review": "How close you are with the cutting edge of technology on a constant basis is an exhilarating feeling that you get when you arrive there.",
            "Author": "Niche User",
            "Date": "2020-01-31T18:05:46.055968Z"
        },
        {
            "Rating": 4,
            "Review": "There are many great opportunities to pursue your interests and achieve personal growth. Between the clubs, classes, research opportunities, and other resources, everyone is sure to find an area that fits their interest. \n\nSome potential areas for improvement might be financial aid packages and fostering social connections. The first point is fairly straightforward, but the latter is a bit more nuanced. Though their are many clubs and groups,  I wish there were even more opportunities for students to connect with one another and meet new people to find their community.",
            "Author": "Sophomore",
            "Date": "2020-01-18T20:55:01.31403Z"
        },
        {
            "Rating": 5,
            "Review": "MIT provides a wonderful place to call home. There is nothing I would even dream of changing. Attending was the best choice I have ever made.",
            "Author": "Freshman",
            "Date": "2020-01-03T13:40:46.840229Z"
        },
        {
            "Rating": 5,
            "Review": "Because the noble prize winners becomes professors and influence or instructors within it's own university. Also, the academic equipment was so very fascinating and amazing on being advanced and technical to using in the modern ages.",
            "Author": "Niche User",
            "Date": "2019-12-10T12:09:24.588748Z"
        },
        {
            "Rating": 5,
            "Review": "MIT is full of great opportunities. They really let their students experience education hands-on. Within months of studying here, I was able to pick up new skills and have access to various tools in the many makerspaces. The first-year experience has also been designed to ease the transition from high school to university.\n\nThe campus and food might not be the best, but that's not what university is for anyway. I think MIT remains the top science/engineering school in the world.",
            "Author": "Freshman",
            "Date": "2019-12-10T04:45:45.667079Z"
        },
        {
            "Rating": 5,
            "Review": "MIT was the most difficult four years of my life. At times, I was not sure that I would survive the academic rigor, but I did, and I even excelled. MIT pushes you hard so that you learn to harness your intellect and push back. It is also humbling to know your limits and work to push your own boundaries. It is not for the fain of heart. My experience was mildly traumatizing, but I would repeat those four years in a heartbeat.",
            "Author": "Alum",
            "Date": "2019-11-30T23:30:13.102232Z"
        },
        {
            "Rating": 5,
            "Review": "I think MIT is the best school in terms of academic. Just wow! The teacher are knowledgeable, the subject are so damn hard but worth it, I like everything about MIT.",
            "Author": "Alum",
            "Date": "2019-08-23T11:10:47.691234Z"
        },
        {
            "Rating": 5,
            "Review": "From my first year here, I can safely say it is an amazing school overall. MIT has a variety of STEM based degrees to offer, though MIT is well known for its Engineering/Sciences it also provides and excellent courses in Humanities and Business. In my first year here my only viable complaint is the food, everything else is fantastic. If given the opportunity MIT will be a fantastic school to spend you next four years.",
            "Author": "Sophomore",
            "Date": "2019-08-06T22:28:48.647104Z"
        },
        {
            "Rating": 5,
            "Review": "MIT is an outstanding university with numerous and diverse opportunities in research and academics. Classes at MIT are indeed difficult, with homework and associated studying consuming a large chunk of time. The beauty of this is that it pushes students to go above and beyond their previous understanding of what they believed themselves to be capable of. Additionally, the explorative and creative atmosphere which springs from the vibrancy of the student body and the faculty is second to none. There are so many chances to do great things at MIT, even as an undergrad!",
            "Author": "Junior",
            "Date": "2019-07-18T19:07:15.571Z"
        },
        {
            "Rating": 5,
            "Review": "MIT is a challenging but supportive environment. Everyone here agrees that the best thing about it is the people - you're all struggling together, but at least you're together. The professors, especially those for freshmen, are really concerned for students and care that they are learning the material. There are a lot of opportunities for social activities such as dance, acapella, and sports.",
            "Author": "Junior",
            "Date": "2019-07-10T20:31:31.541945Z"
        },
        {
            "Rating": 5,
            "Review": "I have found my home at this school. While it is challenging, it has pushed me to understand the hard work that is required for success. There are plenty of extracurricular activities I can participate in to supplement my learning, and the location of the campus relative to Boston is perfect for exploration of the city. I know that my experience here will only have a positive impact on what I am capable of doing in the future.",
            "Author": "Junior",
            "Date": "2019-06-21T19:02:05.349815Z"
        },
        {
            "Rating": 5,
            "Review": "You should learn about it for yourself; everyone's experience is different thus it's impossible to quantify it on this website.",
            "Author": "Niche User",
            "Date": "2019-06-20T00:52:45.04831Z"
        },
        {
            "Rating": 5,
            "Review": "I really enjoy it here. There is always something fun to do, be it a club or one-time activity, and the people are great.",
            "Author": "Freshman",
            "Date": "2019-06-06T22:02:57.438592Z"
        },
        {
            "Rating": 5,
            "Review": "Massachusetts Institute of Technology is a fantastic school that offers students an opportunity to explore anything. The staff is second to none and always encourage students to challenge themselves in whatever it is they are passionate about. Walking down the halls, you feel the energy and passion from students. The students at Massachusetts Institute of Technology live and breathe Science, Technology, Engineering and Mathematics. Everyone on campus is there to make the world a better place and that is what makes MIT so special. Everyone is highly intelligent and capable, but it’s the common desire to give back that makes the campus.",
            "Author": "Graduate Student",
            "Date": "2019-05-24T18:03:13.257498Z"
        },
        {
            "Rating": 5,
            "Review": "This college is the best in the world. It sets you up for any job of your choosing. It not only provides opportunities for growth academically but socially as well.",
            "Author": "Niche User",
            "Date": "2019-05-06T02:42:43.792808Z"
        },
        {
            "Rating": 5,
            "Review": "simply the best school in the world.\nbest academics, best faculty , best division 3 athletic department, best labs, best student culture, best party scenes, best school for entrepreneurs.\nMassachusetts institute of technology is like Hogwarts for technical wizards.",
            "Author": "Niche User",
            "Date": "2019-02-10T10:04:27.348704Z"
        },
        {
            "Rating": 5,
            "Review": "MIT has been a great experience for me!  Yes, it's difficult and stressful at times, but it's also the first place I've really been challenged, and I've met so many amazing people who have added more to my life than any amount of stress has taken away.",
            "Author": "Junior",
            "Date": "2019-02-01T16:27:15.99093Z"
        },
        {
            "Rating": 5,
            "Review": "Massachusetts Institute of Technology is a fantastic institution in all applicable fields. The prestige of the school itself will take you very far after you have graduated, and the professors you will be working with are Nobel prize recipients and masters of their disciplines. Besides academics, the campus life and college experience is unlike any other. By combining some of the brightest young minds in the country, MIT crafts a unique atmosphere that is both constructive and judgement free. A variety of different student-led activities keeps daily life dynamic, and you really cannot go wrong with the Cambridge and Boston area.",
            "Author": "Niche User",
            "Date": "2019-01-21T15:12:36.864586Z"
        },
        {
            "Rating": 5,
            "Review": "I loved the people that I met at MIT and the vibrant student life. I believe that campus spaces could be adapted to allow for more collaboration, productivity, and relaxation.",
            "Author": "Senior",
            "Date": "2018-12-28T02:06:10.488042Z"
        },
        {
            "Rating": 5,
            "Review": "M.I.T is a great school overall their computer systems division is spectacular I recommend it to everybody",
            "Author": "Freshman",
            "Date": "2018-10-10T23:28:06.612364Z"
        },
        {
            "Rating": 5,
            "Review": "MIT has a wonderful, academic atmosphere which supports diverse teams in finding creative new approaches to existing problems in the world. From coursework, to classmates, to the resources, to the facilities, it is unparalleled!",
            "Author": "Graduate Student",
            "Date": "2018-08-16T04:29:17.249659Z"
        },
        {
            "Rating": 4,
            "Review": "Had a great freshman year. Great dorms, decent food, amazing professors. First semester was on a Pass/No Record grading system which was a huge help to me as I had come from a small public school with very few AP classes. Very good student community at this college as well. Everyone is willing to help one another.",
            "Author": "Sophomore",
            "Date": "2018-08-13T12:30:22.406165Z"
        },
        {
            "Rating": 5,
            "Review": "Best part is the abundant research opportunities available through UROPing. Highly accomplished professors and wide variety of advanced and interesting classes. Has distinct dorm cultures and tight knit communities. Prepares you well for any future career. Everything is great but not a fan of the food.",
            "Author": "Sophomore",
            "Date": "2018-07-15T03:27:19.364787Z"
        },
        {
            "Rating": 4,
            "Review": "The opportunities and resources provided by MIT are amazing. What I love the most is the range of choice students have when it comes to classes, student organizations, study abroad opportunities, research, etc. The dorms are also unique and have their own diverse cultures, so students can find a living community where they feel like they belong.",
            "Author": "Freshman",
            "Date": "2018-06-12T18:05:00.252242Z"
        },
        {
            "Rating": 5,
            "Review": "The academic rigor is challenging and the opportunities for clubs and research internships are unparalleled.",
            "Author": "Freshman",
            "Date": "2018-05-14T19:14:54.355673Z"
        },
        {
            "Rating": 5,
            "Review": "This is literally the perfect college, and there is nothing I would do to change it. There are unlimited connections and opportunities in this community.",
            "Author": "Niche User",
            "Date": "2018-05-07T00:44:41.820302Z"
        },
        {
            "Rating": 5,
            "Review": "It's been the best thing for me in the past four years. I have learned more than I could have imagined in the classroom and, even moreso, outside of it.",
            "Author": "Senior",
            "Date": "2018-04-18T13:43:08.633037Z"
        },
        {
            "Rating": 5,
            "Review": "It is a environment that creates a feeling of accomplishment and encouragement to bring out your full potential.",
            "Author": "Niche User",
            "Date": "2018-03-31T00:57:02.508493Z"
        },
        {
            "Rating": 5,
            "Review": "Stellar faculty, resources, housing, activities, location, etc.\nI suppose our campus isn't as breathtaking as the others, but we do have a nice river.",
            "Author": "Freshman",
            "Date": "2018-02-18T00:22:28.220812Z"
        },
        {
            "Rating": 5,
            "Review": "MIT is amazing. The best part is the incredibly intelligent, hard working and diverse students you meet, and the extraordinary professors you learn from.",
            "Author": "Graduate Student",
            "Date": "2018-01-30T20:19:45.30412Z"
        },
        {
            "Rating": 5,
            "Review": "Food is very good and cheap at around 12 dollars a meal for amazing quality food. Parking is a breeze and cheap. You will always be welcomed and professors are very lenient about homework and assignments. Punishments are minimal. GREAT SCHOOL",
            "Author": "Junior",
            "Date": "2018-01-18T17:01:44.609329Z"
        },
        {
            "Rating": 5,
            "Review": "I think MIT is a great school!  The professors really care, and the environment is full of learning.  Many describe MIT as \"drinking from a firehose,\" but I think that in my case the firehose was shooting out awesomeness and knowledge.",
            "Author": "Niche User",
            "Date": "2018-01-07T01:28:53.874548Z"
        },
        {
            "Rating": 5,
            "Review": "This is a brilliant school. It is rigorous, and it might push some students too hard, but for those who can take it is absolutely worth it.",
            "Author": "Niche User",
            "Date": "2018-01-02T20:36:37.587685Z"
        },
        {
            "Rating": 5,
            "Review": "I’ve only been at MIT for one semester but I really have been enjoying my time here. The courses are top notch, the resources are endless, there are lots of opportunities to do anything you want really (great research, student organizations, we even have a nice gym).",
            "Author": "Freshman",
            "Date": "2017-12-29T01:46:16.723678Z"
        },
        {
            "Rating": 5,
            "Review": "More than you can expect! Never hesitate to apply to the school because the chances are for all people.",
            "Author": "Graduate Student",
            "Date": "2017-12-28T23:56:47.962346Z"
        },
        {
            "Rating": 5,
            "Review": "My experiment at MIT was one that Will never forget. I learned things that I carry with me to this day.",
            "Author": "Alum",
            "Date": "2017-12-07T17:12:41.808864Z"
        },
        {
            "Rating": 5,
            "Review": "I have seen and took a tour in MIT. The dorms there seem to be nice and very comfy. I even got to talk to some of the people there and it was great . The teachers were great and their classes were so fun. Even the people on the road were entertaining to me and made me laugh. The school also seemed very diverse, there was a bunch of black, white, and Asians in a group together. The Asian club also had some black people i know so surprising",
            "Author": "Niche User",
            "Date": "2017-11-29T01:05:57.455537Z"
        },
        {
            "Rating": 4,
            "Review": "The campus is great, the staff/professors are excellent. Amazing place to gain STEM skills and research. Only con is the area is quite crowded.",
            "Author": "Niche User",
            "Date": "2017-10-16T12:51:23.073385Z"
        },
        {
            "Rating": 5,
            "Review": "What I love about MIT is how it is a microcosm of the world where everyone is judged primarily by merit. For students who come from a relatively poor background like me, it's great to see a school where you can't easily pay your way in.",
            "Author": "Alum",
            "Date": "2017-08-09T23:25:29.163935Z"
        },
        {
            "Rating": 5,
            "Review": "MIT is a great place to be. Its environment fosters innovation, creativity, and curiosity. Not only is the faculty and education world-class, but being with the best peers pushes one to be better. The quirky culture is also nice; one will certainly find his place in this great community.",
            "Author": "Niche User",
            "Date": "2017-05-22T03:33:11.725766Z"
        },
        {
            "Rating": 5,
            "Review": "It has alot of facilities and there's all the required tools to make an idea come true And it's simply the best college in it's field that any hard working student want to Study in it .",
            "Author": "Niche User",
            "Date": "2017-03-16T17:44:17.441856Z"
        },
        {
            "Rating": 5,
            "Review": "MIT will challenge you in ways that you have never been challenged before, in its effort to mold you into the future leaders of tomorrow and helping you discover your true potentials. It may be a difficult journey, but it'll be worth it at the end.",
            "Author": "Freshman",
            "Date": "2017-03-11T16:10:48.040663Z"
        },
        {
            "Rating": 5,
            "Review": "Great school. Great people. Great city. \nI wouldn't want to be anywhere else. Boston is one of the greatest cities to live in and MIT is the school to go to for top education where you will be challenged.",
            "Author": "Sophomore",
            "Date": "2016-12-30T04:52:42.630228Z"
        },
        {
            "Rating": 5,
            "Review": "I have never been to a place that I have simultaneously loved and hated as much as MIT. I have been challenged in every way, and it has made a stronger person coming out of the other side. I have made some of the best friends here and met some of the smartest and most interesting people as well. Coming out of sophomore year I had never felt more inadequate, I was a B-C student for the first time in my life, failed a class, and got rejected from a dozen companies. When I finally landed an internship I went in expecting to be woefully unprepared based on my class performance. That's when I realized that struggling at MIT was flying anywhere else. The real workforce felt so easy and I barely felt challenged even as I got assigned to more and more projects. MIT's the first place that made me feel stupid, but it also made me realize that comparing myself to others is a terrible way to measure success and that I needed to be the best I could be (which compared to the rest of the world was pretty good.) In short. IHTFP (both meanings).",
            "Author": "College Junior",
            "Date": "2016-09-25T23:57:10Z"
        },
        {
            "Rating": 5,
            "Review": "By far, the best school in the nation, and the world, not just for engineering, but for business, architecture, economics. MIT graduates go onto shape the world in ways never thought possible.",
            "Author": "Recent Alumnus",
            "Date": "2016-08-29T13:31:47Z"
        },
        {
            "Rating": 5,
            "Review": "Ranked the best University in the World for the last six years running",
            "Author": "Recent Alumnus",
            "Date": "2016-08-10T18:04:38Z"
        },
        {
            "Rating": 4,
            "Review": "Classes are difficult but you get a lot out of them. Class sizes are good. Variety very good.",
            "Author": "College Sophomore",
            "Date": "2016-08-03T17:15:51Z"
        },
        {
            "Rating": 4,
            "Review": "My school is extremely challenging, and really pushes you to your limits. However, the people there make it worth the hard work and help you along the way, allowing for a really rewarding experience. If I had to choose all over again, I would still stand by my choice and pick my school.",
            "Author": "College Sophomore",
            "Date": "2016-08-03T16:51:34Z"
        },
        {
            "Rating": 4,
            "Review": "I am very happy so far.",
            "Author": "College Freshman",
            "Date": "2016-07-19T20:18:42Z"
        },
        {
            "Rating": 5,
            "Review": "I love the atmosphere of creative and super-smart students.",
            "Author": "College Freshman",
            "Date": "2016-07-19T20:08:43Z"
        },
        {
            "Rating": 4,
            "Review": "Professors are very willing to listen and help students learn - individual quirks/administrative proficiency are the only problems.",
            "Author": "College Sophomore",
            "Date": "2016-07-10T19:52:43Z"
        },
        {
            "Rating": 4,
            "Review": "As a humanities and science major, my academic experience at MIT isn't the most usual. The academic environment tends to undervalue these fields, but the people in them, especially in SHASS (School of Humanities, Arts, and Social Sciences) really care about their fields. The main thing I'd change about MIT, and have been trying to change for the past 3 years, is out culture around suffering. Many students wear their suffering as a badge of pride and vie to work the most, sleep the least, and be most 'hosed,' from firehose. We devalue mental health and self-care, and students often think others will look down on them for asking for help. Those facets of MIT need to change, but I've seen people at the Institute who care and are working on this, so I have very much hope for the future of my school.",
            "Author": "College Senior",
            "Date": "2016-06-24T00:37:08Z"
        },
        {
            "Rating": 5,
            "Review": "The opportunities to get involved in innovative projects and work with outstanding professionals.",
            "Author": "College Junior",
            "Date": "2016-06-23T22:10:20Z"
        },
        {
            "Rating": 3,
            "Review": "I've had some pretty bad lecturers in classes that would have been manageable if taught correctly. The fact that someone is knowledgeable does not make them a decent teacher. I have also had amazing teachers who made my learning experience exciting and positive, despite difficult coursework.",
            "Author": "College Junior",
            "Date": "2016-06-17T05:04:55Z"
        },
        {
            "Rating": 5,
            "Review": "I think what makes the experience so amazing is having the opportunity to meet people with brilliant minds and passionate, caring hearts.",
            "Author": "College Junior",
            "Date": "2016-06-17T04:47:07Z"
        },
        {
            "Rating": 4,
            "Review": "MIT has top-notch academics. Some professors aren't great lecturers though.",
            "Author": "College Junior",
            "Date": "2016-06-06T02:56:41Z"
        },
        {
            "Rating": 4,
            "Review": "Professors are in general helpful and approachable. Courses are insightful.",
            "Author": "College Sophomore",
            "Date": "2016-06-03T21:58:39Z"
        },
        {
            "Rating": 4,
            "Review": "MIT is a really cool place where you have the opportunity to explore whatever interests you and your explorations are supported.",
            "Author": "College Sophomore",
            "Date": "2016-06-03T21:49:17Z"
        },
        {
            "Rating": 5,
            "Review": "MIT is awesome and fun",
            "Author": "College Sophomore",
            "Date": "2016-03-30T00:18:59Z"
        },
        {
            "Rating": 5,
            "Review": "It's a lot of fun and the classes are super interesting. The work is hard, but there are tons of people willing to help, and if you are comfortable with not having a perfect A+ average than going out every weekend and some week nights is definitely do-able.",
            "Author": "College Sophomore",
            "Date": "2016-03-30T00:05:28Z"
        },
        {
            "Rating": 5,
            "Review": "I've had a good time so far.",
            "Author": "College Freshman",
            "Date": "2016-02-02T00:24:39Z"
        },
        {
            "Rating": 5,
            "Review": "I absolutely love my school and I wouldn't change it at all! It's probably the most stressful, hard, and demanding thing I've done up to now but that's what I love about it! It's a challenge and it really is intense but the people I've met, my friends, help me through it all and I love that! The community at MIT is amazing too, there are so many different people on campus both mainstream and off-stream(I guess that's how you say it?) but that makes everyday much better in an open and accepting campus.",
            "Author": "College Freshman",
            "Date": "2016-01-20T09:14:15Z"
        },
        {
            "Rating": 5,
            "Review": "I absolutely love attending MIT.  I know that my experience will be tougher as the years go by, but I have made amazing friends that I know will stick around for it all.  The courses are hard, and psets are crazy challenging, but it all promotes teamwork and creative thinking.  I look forward to learning more and meeting more people.",
            "Author": "College Freshman",
            "Date": "2016-01-16T13:09:39Z"
        },
        {
            "Rating": 5,
            "Review": "Although I am only a freshman, I truly love it here.  The course load is heavy, but there are amazing people here that are always willing to help, which lightens some of the load.  I love the classes I have taken so far, and they are all very engaging.  The people here are what makes me love MIT the best.  They make the campus feel like home.",
            "Author": "College Freshman",
            "Date": "2016-01-16T12:54:47Z"
        },
        {
            "Rating": 5,
            "Review": "I love MIT's culture as well as the academics. It's right next to Boston and is easily accessible. The culture is full of different types of people and there is a right fit for everyone.",
            "Author": "College Freshman",
            "Date": "2016-01-01T16:23:07Z"
        },
        {
            "Rating": 5,
            "Review": "This place offers a great community of profs, grad students, and undergrads who all want to learn new things and change the world.",
            "Author": "College Senior",
            "Date": "2015-12-31T03:11:33Z"
        },
        {
            "Rating": 5,
            "Review": "Although it is a challenging place to be, I have found a home at MIT with crazy-smart, caring people who all want to change the world. I think the thing that best characterizes MIT students is the desire to do something great, something beyond the ordinary. It is an extraordinary place to be.",
            "Author": "College Senior",
            "Date": "2015-12-31T03:02:34Z"
        },
        {
            "Rating": 5,
            "Review": "A lot of the overall experience at MIT depends on how much you make of it. If you are willing to put yourself forward, push yourself, join new activities, talk to the cute guy you're shy around, etc. as in any other college/work environment, then you will be successful.",
            "Author": "College Freshman",
            "Date": "2015-12-29T19:42:43Z"
        },
        {
            "Rating": 5,
            "Review": "What makes MIT unique is that every single person is interesting to get to know.",
            "Author": "College Freshman",
            "Date": "2015-12-29T19:32:49Z"
        },
        {
            "Rating": 5,
            "Review": "The professors are challenging and passionate. It is the ideal place to come to be challenged and grow as a learner.",
            "Author": "College Freshman",
            "Date": "2015-12-29T16:56:20Z"
        },
        {
            "Rating": 4,
            "Review": "It has been great so far, the academics are near perfect. The only downside is the workload, the cost of attending, and living on your own in an expensive city.",
            "Author": "College Freshman",
            "Date": "2015-12-29T16:39:53Z"
        },
        {
            "Rating": 4,
            "Review": "I hate the weather. Snow sucks.",
            "Author": "College Sophomore",
            "Date": "2015-12-29T16:34:34Z"
        },
        {
            "Rating": 4,
            "Review": "There's a lot of variety, but it's up to you to take advantage of it.",
            "Author": "College Freshman",
            "Date": "2015-12-24T01:56:11Z"
        },
        {
            "Rating": 4,
            "Review": "MIT is a great place when it comes to interdisciplinary studies. I didn't really know what I wanted to do, since I just wanted to do a lot of things, but the collaborative spirit all around campus and especially in the Media Lab eventually led me to realize I could do a lot of it.\r\n\r\nThe people are wonderful and probably what makes MIT so unique. Everyone wants to learn or advance their fields, both professors and students. There are few who are complacent, which is mostly a great thing.",
            "Author": "College Freshman",
            "Date": "2015-12-24T01:35:22Z"
        },
        {
            "Rating": 5,
            "Review": "I love all the talented and smart people there.",
            "Author": "College Sophomore",
            "Date": "2015-08-25T00:05:20Z"
        },
        {
            "Rating": 4,
            "Review": "It is totally challenging but the opportunities are great!!!",
            "Author": "College Sophomore",
            "Date": "2015-08-23T06:04:48Z"
        },
        {
            "Rating": 5,
            "Review": "I couldn't be happier anywhere else.",
            "Author": "College Sophomore",
            "Date": "2015-08-20T20:04:24Z"
        },
        {
            "Rating": 5,
            "Review": "Everyone around me is passionate about some topic. It's inspiring to see what my classmates are up to, whether it's research or startups or personal projects. The atmosphere can be stressful, but the community is incredibly supportive if you reach out for help.",
            "Author": "College Junior",
            "Date": "2015-08-19T22:41:16Z"
        },
        {
            "Rating": 4,
            "Review": "The classes are pretty difficult the students at MIT are generally nice people and like to help others out if they're struggling.",
            "Author": "College Sophomore",
            "Date": "2015-07-26T21:38:35Z"
        },
        {
            "Rating": 3,
            "Review": "Sometimes the environment makes it difficult to work at my own place. I put unnecessary pressure on myself when I first arrived, which made my first year difficult. After I discarded that, however, I began succeeding in the way i wanted to. I've met some really incredible people so there's never a dull moment, unless it's by choice. Very challenging, but very worth all of the struggle.",
            "Author": "College Junior",
            "Date": "2015-07-24T01:54:19Z"
        },
        {
            "Rating": 4,
            "Review": "The classes may be difficult and the atmosphere may be intense, but the people at my school are great. They make up for any downside caused by the intense academic environment and more.",
            "Author": "College Freshman",
            "Date": "2015-07-07T19:57:12Z"
        },
        {
            "Rating": 5,
            "Review": "I love the people at MIT and the classes are very difficult but interesting",
            "Author": "College Sophomore",
            "Date": "2015-07-04T15:57:46Z"
        },
        {
            "Rating": 4,
            "Review": "Students are nice. General community is fun. The place is quite stressful, though.",
            "Author": "College Sophomore",
            "Date": "2015-07-01T16:19:30Z"
        },
        {
            "Rating": 5,
            "Review": "I've enjoyed all the classes I've taken (even though they can be tiring), and I think the students here are some of the friendliest I've ever met.",
            "Author": "College Sophomore",
            "Date": "2015-06-23T18:53:48Z"
        },
        {
            "Rating": 4,
            "Review": "This place is amazing. You can see and do fantastic things here. This place is not for everyone. There is a lot of work and many things you will never understand. I have learned and grown more than I thought possible and I still have more time here. But, you also loose part of yourself here. Once you become ok with that, you realize you can make though this place and have great memories on the other side. IHTFP",
            "Author": "College Sophomore",
            "Date": "2015-06-18T15:13:02Z"
        },
        {
            "Rating": 4,
            "Review": "MIT is an amazing school with lots of incredible opportunities that are within grasp of a motivated student. The people are all very friendly and open but also super hardworking. It is a place that fosters innovation and development but can be a little too much to handle at times. Often compared to drinking from a firehose, an MIT education is definitely an experience in itself.",
            "Author": "College Junior",
            "Date": "2014-08-03T13:04:29Z"
        },
        {
            "Rating": 5,
            "Review": "IHTFP.  MIT has been a great ride.  Might not be for everyone, but, I love it.",
            "Author": "College Senior",
            "Date": "2014-06-23T21:18:05Z"
        },
        {
            "Rating": 4,
            "Review": "At MIT, we refer to our majors by their course numbers (and subnumbers/letters, when applicable). I was a linguistics major in the Linguistics and Philosophy department, so I was Course 24-2. Our program rocks 'cause MIT, unbeknownst to many, is one of the best institutions for theoretical linguistics. (We have the grandfather of modern linguistics, Noam Chomsky, and many other fine linguists such as David Pesetsky, Irene Heim, Martin Hackl, Norvin Richards, and Kenneth Wexler, just to name a few). Unfortunately, the program is very small (as is the graduate program) and does not get as much attention as it should, both from the students and the faculty. The graduate program is extremely renowned and highly competitive. But, back to the undergraduate program, yes, it is small. In fact, my graduating class probably only had around 5-7 (out of a class of around 1000) doing linguistics (or philosophy, both are in the same department) as their primary major. As such, I went through classes without meeting some of these kids. And contrary to the norm at MIT, which is built on collaboration, I'd often have to do my psets (problem sets = homework) alone since very few people were taking my classes.",
            "Author": "Recent Alumnus",
            "Date": "2014-05-27T14:26:53Z"
        },
        {
            "Rating": 5,
            "Review": "MIT has been the perfect fit for me. It's the perfect combination of an academic and social environment.",
            "Author": "College Freshman",
            "Date": "2014-01-08T13:38:48Z"
        },
        {
            "Rating": 5,
            "Review": "I really love the atmosphere and all the people here.",
            "Author": "College Freshman",
            "Date": "2013-12-27T12:24:52Z"
        },
        {
            "Rating": 5,
            "Review": "Love MIT!!! Amazing opportunities, really smart and kind classmates",
            "Author": "Recent Alumnus",
            "Date": "2013-11-27T22:57:25Z"
        },
        {
            "Rating": 4,
            "Review": "Being a freshman I have no idea what the program looks like as I havent taken any classes for it yet.",
            "Author": "College Freshman",
            "Date": "2013-11-24T19:21:45Z"
        },
        {
            "Rating": 5,
            "Review": "It definitely is one of the most challenging schools out there, but with amazing people around you, it gets better. The social scene is not very vibrant however, and it is not uncommon to ditch plans to study.",
            "Author": "College Freshman",
            "Date": "2013-11-24T19:17:49Z"
        },
        {
            "Rating": 5,
            "Review": "The workload is unreal. Hell weeks with three or four tests come every month and if you're up at 4am it's usually because you're finishing a problem set instead of drinking and partying or hanging out with friends. But the people are incredible at MIT. They are fun and interesting and diverse, and they have these amazing ideas that they are really excited to implement during, or after, their time at MIT. You never know what to do with free time because you never have any, but you leave MIT prepared for absolutely anything, and with friends you would never have met anywhere else.",
            "Author": "College Sophomore",
            "Date": "2013-11-12T15:45:09Z"
        },
        {
            "Rating": 4,
            "Review": "My existence at MIT has been almost constant stress.  A relentless workload,  grades that don't reflect the amount of effort I put into studying, and brutal weather for about 3/4 of the year.  However, this environment also fosters the development of amazing friendships.  MIT is like no other place in the world and you need to find a close group of friends, with diverse backgrounds, in order to make it through.  We struggle together and help one another through the hard times, but also celebrate and have fun together.  \r\n\r\nAdditionally, the professors at MIT, for the most part, truly care about their students and go out of the way to get to know them and assist them.  Once you get into your major classes, the class sizes are small and become close-knit, not only with the other students, but also with the professors.\r\n\r\nMIT Greek life is extremely different than any other Greek life I've experienced.  Almost half the campus is Greek.  But it is not full of drama but developing a support network to get through MIT.\r\n\r\nThe students at MIT feel free to let themselves shine.  Although they are swamped with work, they still find time to devote hours to dancing, to varsity sports, to building roller coasters in front of their dorms, to helping their community, and to hacking.  The students are incredibly well-rounded and, surprisingly, not very competitive.  They tend to strive to be their personal bests instead of competing with others.",
            "Author": "College Junior",
            "Date": "2012-08-01T06:32:11.547Z"
        },
        {
            "Rating": 4,
            "Review": "MIT is my favorite place in the whole wide world. Even though the work load can be very intense at times, if you balance it with fun times with friends on the weekends or even taking a day off during the school week, it makes the work manageable. MIT has good parties yet no one here forces anyone to partake in drinking or drugs. The people here are some of the most down-to-earth individuals in the world yet they are some of the most brilliant. I cannot believe how lucky I am to be surrounded by such high-acheiving yet humble people. MIT is definitely a place to be proud of.",
            "Author": "College Sophomore",
            "Date": "2012-07-10T12:53:14.08Z"
        },
        {
            "Rating": 4,
            "Review": "A Challenge and Opportunity for Growth – The greatest thing about MIT is the people. The students here are amazing - everyone has a unique talent/passion, everyone is hardworking, and people are (mostly) down-to-earth.\r\n\r\nYes, the academics are extremely hard. Even those who were straight-A students back in HS come here and will suffer their first C. My first year here, my self-esteem was crushed. But I also made my most amazing friends here, who helped me get through those rough times. Challenges are opportunities for growth. Adversity strengthens bonds. Coming to MIT made me realize that.\r\n\r\nIf you want a challenge, and are prepared to stretch yourself to your limits, you'll thrive here. Just remember the importance of friends and knowing when to seek support. It's always there for you.",
            "Author": "College Freshman",
            "Date": "2012-05-30T22:38:55.28Z"
        },
        {
            "Rating": 4,
            "Review": "Community Is the Best Part – The best thing about MIT is the people. The classes are hard, there are lots of annoying requirements to fulfill, but the community makes up for it. There are so many different types of people and everyone is so accepting and interesting.",
            "Author": "College Junior",
            "Date": "2012-01-19T16:05:58.6Z"
        },
        {
            "Rating": 5,
            "Review": "Wouldn't Have It Any Other Way – I've had a total blast my first year at MIT! It felt overwhelming at first, but it's a great place to be. There are a lot of friendly people willing to help you out with anything, it's easy to get around, there's always something going on that you can get involved in, and not to mention there's all the other colleges in the area with people to interact with and things you can be involved in there too if you want. The workload is hard, some days it feels like the workload is just crushing. But, if you can keep your head up and work through it and get help when you need, it is quite an awesome experience. If I had to pick colleges again, I would still choose to come to MIT.",
            "Author": "College Sophomore",
            "Date": "2011-07-25T01:29:49.703Z"
        },
        {
            "Rating": 4,
            "Review": "It's unlike most top tier schools. Less stuck-up people and more fun and chill ones to hang out with. We work hard, but party just as hard. At first, it may be hard to find that balance, but you will quickly enough.",
            "Author": "College Freshman",
            "Date": "2010-12-28T20:35:07.493Z"
        },
        {
            "Rating": 4,
            "Review": "Challenging Yet Rewarding – If you are ready for a challenge academically, but still want to have a good college experience, this is the perfect place.  You will meet some the most amazing people and learn so much over your years here.  You can play sports, be in a sorority or fraternity, and do well in school and have a life if you budget your time well enough.  It was the perfect place for me.",
            "Author": "College Sophomore",
            "Date": "2010-07-21T15:57:15.16Z"
        }
    ],
    "Student%20Life": [
        {
            "Rating": 4,
            "Review": "26 fraternities, so there's one for everyone. Being in a fraternity isn't hard, but the top fraternities are as good as they come. Very nice houses in great locations in Boston and Cambridge. Chi Phi, Sigma Chi, and Delta Kappa Epsilon throw some of the best parties in Boston, each with their own unique vibe.",
            "Author": "College Junior",
            "Date": "2016-09-26T00:01:24Z"
        },
        {
            "Rating": 4,
            "Review": "I am a member of a varsity athletic team here, and while attendance isn't great for our events that doesn't mean we don't win games and have an awesome team. My best friends are on my team.",
            "Author": "College Junior",
            "Date": "2016-09-25T23:59:41Z"
        },
        {
            "Rating": 3,
            "Review": "To an outsider or non-Greek person, fraternities and sororities are just kind of there, they throw parties, some philanthropy events, and occasionally do stupid things. What's not easily seen is how much infighting there is in every fraternity. Pointless conflicts and cliques arise, and it definitely gets exhausting to put up with all the drama of being part of Greek life.",
            "Author": "Recent Alumnus",
            "Date": "2016-08-29T13:38:06Z"
        },
        {
            "Rating": 3,
            "Review": "Most people don't come to MIT for sports, at least not the typical \"American\" sports like football, baseball, etc. But the athletes here work just as hard and competition is tough.  We recently claimed the Division III championship in football, and the students were pretty proud of our team for that.",
            "Author": "Recent Alumnus",
            "Date": "2016-08-29T13:34:46Z"
        },
        {
            "Rating": 4,
            "Review": "People like the Greek life here, it's pretty chill and no one judges you if you are or aren't part of it yourself.",
            "Author": "College Sophomore",
            "Date": "2016-08-03T17:00:10Z"
        },
        {
            "Rating": 2,
            "Review": "Though many do participate in sports, it isn't very important in our school's culture as academics always comes first.",
            "Author": "College Sophomore",
            "Date": "2016-08-03T16:57:45Z"
        },
        {
            "Rating": 3,
            "Review": "This is a tolerant community so Greek or non-Greek doesn't matter.",
            "Author": "College Freshman",
            "Date": "2016-07-19T20:11:35Z"
        },
        {
            "Rating": 4,
            "Review": "I love the swimming requirement, and the physical education facilities are great.",
            "Author": "College Freshman",
            "Date": "2016-07-19T20:10:48Z"
        },
        {
            "Rating": 5,
            "Review": "Greek life at MIT gives you amazing opportunity to grow, learn, and have fun. It's pretty much a perfect balance of helping the community and the occasional scandal.",
            "Author": "College Junior",
            "Date": "2016-06-17T04:52:46Z"
        },
        {
            "Rating": 4,
            "Review": "For being a D3 school, we have fairly nice facilities. Our gym for the general student body is nicer than the one designated for varsity athletes. Our fields, particularly baseball, softball, and football, could really use an upgrade and it would be cool if more people attended our games, but you can't really expect more from students who are so busy with school and their own extracurriculars. Outside of attendance, people show amazing amounts of support over social media.",
            "Author": "College Junior",
            "Date": "2016-06-17T04:51:12Z"
        },
        {
            "Rating": 3,
            "Review": "I'm not into Greek life, because the fees are so big",
            "Author": "College Junior",
            "Date": "2016-06-06T02:49:32Z"
        },
        {
            "Rating": 4,
            "Review": "I'm a Varsity Athlete and I love my coaches and team!",
            "Author": "College Junior",
            "Date": "2016-06-06T02:48:33Z"
        },
        {
            "Rating": 4,
            "Review": "FSILGs are a huge part of MIT, each with their own unique atmosphere and culture.",
            "Author": "College Sophomore",
            "Date": "2016-06-03T21:52:15Z"
        },
        {
            "Rating": 3,
            "Review": "Athletics can be pretty big when teams are doing well, almost everyone knows an athlete and many go to games and events to support friends.",
            "Author": "College Sophomore",
            "Date": "2016-06-03T21:51:33Z"
        },
        {
            "Rating": 5,
            "Review": "It's not super fratty, but it's a lot of fun. Being in Boston is great and my fraternity mixes with sororities in schools all over Boston. Even many of the people not technically in Greek life end up in dorms or dorms floors that are ultimately very similar to joining a fraternity.",
            "Author": "College Sophomore",
            "Date": "2016-03-30T00:10:39Z"
        },
        {
            "Rating": 3,
            "Review": "A ton of people participate, but no one really watches.",
            "Author": "College Sophomore",
            "Date": "2016-03-30T00:07:54Z"
        },
        {
            "Rating": 5,
            "Review": "I never meant to join greek life, but have found it refreshing after growing up in the south. It's very widely varied and provides great support networks for a lot of undergraduates.",
            "Author": "College Sophomore",
            "Date": "2016-02-22T21:51:03Z"
        },
        {
            "Rating": 4,
            "Review": "Sports and Athletics are not a focus here but students are extremely passionate about them as well.",
            "Author": "College Freshman",
            "Date": "2016-02-01T22:44:11Z"
        },
        {
            "Rating": 4,
            "Review": "They have tons of athletic facilities that students, clubs, and athletes can all use for recreation and training! I think it's more than enough for the demand.",
            "Author": "College Freshman",
            "Date": "2016-01-20T09:17:40Z"
        },
        {
            "Rating": 4,
            "Review": "Greek life is surprisingly big on MIT campus for the guys.  The frats really put in a lot of time for their brothers and people they know, helping with homework and providing study breaks for fun.  Sorority life, on the other hand, seems pretty big due to the amount of girls in the sororities, but they do not play as much of a big impact as the fraternities.  There is not a big difference in Greeks and non-Greeks.",
            "Author": "College Freshman",
            "Date": "2016-01-16T12:58:24Z"
        },
        {
            "Rating": 4,
            "Review": "Athletics is not a priority at MIT, so most of the students don't pay attention to them.  However, there is a lot of school spirit for big events.  Many students are involved in sports whether they are in club sports or varsity sports.",
            "Author": "College Freshman",
            "Date": "2016-01-16T12:56:17Z"
        },
        {
            "Rating": 5,
            "Review": "I love the greek life. Almost all of the parties at MIT are held by the fraternities in their houses. Students from other schools also enjoy attending them. Sororities also host a lot of fun fundraisers and charity events attended by students as well. There isn't a divide between Greeks and non-Greeks, they coexist very peacefully. All of the Greek organizations have houses, many of which are off campus in Boston.",
            "Author": "College Freshman",
            "Date": "2016-01-01T16:28:45Z"
        },
        {
            "Rating": 3,
            "Review": "Most sports are division 3, and MIT doesn't have the best teams sometimes so it's not too interesting to watch. Some games are good though and very fun to attend. The school spirit is not there. The school athletic center is very nice and open students but the football field leaves much to be desired.",
            "Author": "College Freshman",
            "Date": "2016-01-01T16:25:49Z"
        },
        {
            "Rating": 4,
            "Review": "If you want Greek life, it's there. If you don't, it's not a big deal. About 1/2 of guys on campus are in fraternities and 1/3 of girls.",
            "Author": "College Senior",
            "Date": "2015-12-31T03:04:46Z"
        },
        {
            "Rating": 3,
            "Review": "We have decent varsity teams for our D3 league. And out club sports are really fun.",
            "Author": "College Senior",
            "Date": "2015-12-31T03:03:30Z"
        },
        {
            "Rating": 4,
            "Review": "The Greek life you choose at MIT is largely dependent on the community you join. Most fraternities however are not the stereotypical kind of hardcore party-goers.",
            "Author": "College Freshman",
            "Date": "2015-12-29T19:34:49Z"
        },
        {
            "Rating": 3,
            "Review": "Athletics are not the main focus of MIT. However, the PE requirement allows all students to become familiar with the equipment offered.",
            "Author": "College Freshman",
            "Date": "2015-12-29T19:33:50Z"
        },
        {
            "Rating": 4,
            "Review": "I'm a non-Greek but most Greeks I know enjoy it and they do a lot of cool things",
            "Author": "College Sophomore",
            "Date": "2015-12-29T18:36:30Z"
        },
        {
            "Rating": 2,
            "Review": "People don't care enough to go to the sports games",
            "Author": "College Sophomore",
            "Date": "2015-12-29T18:33:15Z"
        },
        {
            "Rating": 5,
            "Review": "I am in a fraternity and the brothers have been great for academic and social support.",
            "Author": "College Freshman",
            "Date": "2015-12-29T16:43:12Z"
        },
        {
            "Rating": 4,
            "Review": "They have the facilities for students to do nearly any exercise they want",
            "Author": "College Freshman",
            "Date": "2015-12-29T16:41:06Z"
        },
        {
            "Rating": 4,
            "Review": "We're only D3, but our teams are pretty darn good!",
            "Author": "College Sophomore",
            "Date": "2015-12-29T16:37:09Z"
        },
        {
            "Rating": 4,
            "Review": "The school forces you to take athletic courses, and there's a wide variety to choose from. Outside of class, each dorm has a gym (the quality varies) and the main gym, the Z-Center, is open most of the day. The Z-Center has a lot of equipment available to all students except when class or sports are in session in during the workday and from five to seven (even then, it's possible/likely that only a part of that area is in use, depending on what you want).",
            "Author": "College Freshman",
            "Date": "2015-12-24T01:38:54Z"
        },
        {
            "Rating": 4,
            "Review": "They are great. I feel that they are very fair, understand that we are college kids, and create an awesome on campus atmosphere.",
            "Author": "College Sophomore",
            "Date": "2015-06-09T18:24:22Z"
        },
        {
            "Rating": 3,
            "Review": "Strictness depends on the thing that you're doing, but MIT generally would rather help you than hurt you, especially if the problem has to do with excessive drug or alcohol use. Dorm security has tightened lately so that's become a bit more strict and a bit of a nuisance as well.",
            "Author": "College Junior",
            "Date": "2015-05-25T06:55:04Z"
        },
        {
            "Rating": 5,
            "Review": "I mean, everyone is their own person and you're almost guaranteed to find someone interesting on campus, whether for friendship or relationship. We all have our own quirks and eccentricities but I think that's what makes us interesting.",
            "Author": "College Junior",
            "Date": "2015-05-25T06:51:23Z"
        },
        {
            "Rating": 5,
            "Review": "They give the students a lot of freedom",
            "Author": "College Freshman",
            "Date": "2015-03-16T15:25:53Z"
        },
        {
            "Rating": 4,
            "Review": "Girls here (like all students) are smart, involved, and interesting.",
            "Author": "College Freshman",
            "Date": "2015-03-01T02:41:33Z"
        },
        {
            "Rating": 5,
            "Review": "MIT has an awesome athletics program.  Varsity sports are not a huge deal: I and most people I know have never been to a football game, but the diversity in sports and options available are awesome.  Almost all dorms have some form of gym, and the main gym is huge and very accessible.  The PE requirement encourages students to take fun courses that are never available at high school: such as pistols, archery, fencing, and sailing (the combination of which will earn you your 'pirates licence'.  I personally thought I would have no part in sports, but discovered the pistol team through a friend and fell in love with the program.  Top notch team (women's team won first place team in national collegiate competition in 2014), but relaxing, safe, and very focused on mental and wellness aspects of the sport.",
            "Author": "College Freshman",
            "Date": "2015-03-01T01:45:14Z"
        },
        {
            "Rating": 4,
            "Review": "Thankfully I  haven't had to have any run in with them",
            "Author": "College Freshman",
            "Date": "2015-01-12T15:39:53Z"
        },
        {
            "Rating": 4,
            "Review": "I enjoy being able to go out and let loose and have fun at parties thrown by frats",
            "Author": "College Freshman",
            "Date": "2015-01-12T15:32:22Z"
        },
        {
            "Rating": 3,
            "Review": "A lot of the frat guys think they are all that and so if you aren't, in their eyes, drop dead gorgeous they wont give you any type of attention, even if you are a cool person and the \"gorgeous\" girl is awful. I think it gets better as you get older though.",
            "Author": "College Freshman",
            "Date": "2015-01-12T15:29:25Z"
        },
        {
            "Rating": 2,
            "Review": "I wish athletics were a big part of MIT. We don't even have a real football stadium which is sad since I am from texas and football and marching bands are huge there.",
            "Author": "College Freshman",
            "Date": "2015-01-12T15:26:04Z"
        },
        {
            "Rating": 3,
            "Review": "It's there, but I'm not a part of it so it doesn't affect my life that much.",
            "Author": "College Junior",
            "Date": "2014-12-16T13:53:49Z"
        },
        {
            "Rating": 5,
            "Review": "Greek life is the best because it is an incredibly laid back culture where anyone can find the right fraternity or sorority, or none at all, if that suits them. Greek non-Greek relations are excellent because of this laid back culture. Everyone is generally very accepting and the Fraternities tend to throw some of the best parties in the greater Boston area.",
            "Author": "College Freshman",
            "Date": "2014-11-19T13:59:46Z"
        },
        {
            "Rating": 5,
            "Review": "As soon as you are a student here you are treated as an adult. This allows a ton of freedom, and the GRT's (MIT's version of RA's) are generally very laid back and are not looking to get you in trouble in any way. There is also a good neighbor policy transport system where you can call an alcohol transport if you fear for you or your friends safety and you will not get in any trouble (though you will most likely have to attend and alcohol edu class or something of the sort. On the other hand because you are treated like an adult you are expected to act like one for the most part, and multiple offenses can result in serious trouble.",
            "Author": "College Freshman",
            "Date": "2014-11-19T13:51:21Z"
        },
        {
            "Rating": 3,
            "Review": "Last I heard, more than have of the guys at MIT are in a frat. Most frat houses are in Boston. Sororities are not nearly as big. Non-Greeks and Greeks don't treat each other differently, but I can't help silently judging some of the party-hard Greeks.",
            "Author": "College Sophomore",
            "Date": "2014-11-13T14:11:53Z"
        },
        {
            "Rating": 4,
            "Review": "I wish MIT had more school spirit when it came to varsity sports! A lot of people participate in sports, but not many students attend the games. I think the fitness center on campus is great though. It's awesome that we have an ice rink in the winter.",
            "Author": "College Sophomore",
            "Date": "2014-11-13T13:57:02Z"
        },
        {
            "Rating": 4,
            "Review": "Though student policies are in place (eg. no drinking in dorm common areas), nobody intrudes to ensure the policies are being followed. There is a general belief that students can make responsible decisions.",
            "Author": "College Sophomore",
            "Date": "2014-11-13T13:45:31Z"
        },
        {
            "Rating": 4,
            "Review": "There are a lot of extremely good-looking people here, which actually surprised me.",
            "Author": "College Freshman",
            "Date": "2014-10-19T16:21:15Z"
        },
        {
            "Rating": 2,
            "Review": "Very few people go to varsity games. Many of friends did not even know MIT had a football team.",
            "Author": "College Sophomore",
            "Date": "2014-09-25T15:31:57Z"
        },
        {
            "Rating": 3,
            "Review": "They seem to crack down at random tim",
            "Author": "College Sophomore",
            "Date": "2014-09-25T15:30:56Z"
        },
        {
            "Rating": 4,
            "Review": "The athletic facilities are quite wonderful and there's clubs for basically every kind of athletic activity.",
            "Author": "College Junior",
            "Date": "2014-09-24T03:21:36Z"
        },
        {
            "Rating": 5,
            "Review": "Basically all the Greek groups have their own houses, and there's a ton of different ones so you get your pick in style and culture. Some lean more toward the hardcore parties and some are a lot tamer.",
            "Author": "College Junior",
            "Date": "2014-09-24T03:12:34Z"
        },
        {
            "Rating": 3,
            "Review": "I am not involved in athletics.",
            "Author": "College Junior",
            "Date": "2014-08-25T12:57:12Z"
        },
        {
            "Rating": 3,
            "Review": "Security has recently been increased as a result of several dorm robberies.",
            "Author": "College Junior",
            "Date": "2014-08-25T12:55:36Z"
        },
        {
            "Rating": 3,
            "Review": "Lots of people are in fraternities and sororities.",
            "Author": "College Junior",
            "Date": "2014-08-25T12:53:39Z"
        },
        {
            "Rating": 4,
            "Review": "Very lenient policies on visitation and alcohol use. The police are trusting of students.",
            "Author": "College Sophomore",
            "Date": "2014-08-21T20:50:05Z"
        },
        {
            "Rating": 3,
            "Review": "People who attend sporting events are usually just friends of varsity athletes.",
            "Author": "College Sophomore",
            "Date": "2014-08-21T20:48:47Z"
        },
        {
            "Rating": 4,
            "Review": "Our campus is not very strict. They generally treat us like adults and allow us to decide what's best for us.",
            "Author": "College Senior",
            "Date": "2014-08-14T21:59:36Z"
        },
        {
            "Rating": 5,
            "Review": "MIT is very diverse. I know people of all ethnic, economic, religious, sexual, and political backgrounds, though we are probably more liberal than your average college.",
            "Author": "College Senior",
            "Date": "2014-08-14T21:42:27Z"
        },
        {
            "Rating": 5,
            "Review": "Greek life at MIT is fantastic. It's a positive aspect of the community in many ways, and many students choose to participate in Greek life (supporting Greek events) even if they are not actually Greek.",
            "Author": "College Senior",
            "Date": "2014-08-14T21:41:30Z"
        },
        {
            "Rating": 5,
            "Review": "MIT is filled with students from all over the world and from all walks of life. I have always found it to be an extremely open community in terms of receptiveness to opposing views and types of people. I feel like everyone can find their place at MIT.",
            "Author": "College Junior",
            "Date": "2014-08-03T12:56:57Z"
        },
        {
            "Rating": 2,
            "Review": "I feel like the sports teams actually do well, but the problem is that there isn't much school spirit. The fact that I don't even really know how the teams are doing is a testament to this statement.",
            "Author": "College Junior",
            "Date": "2014-08-03T12:49:57Z"
        },
        {
            "Rating": 3,
            "Review": "As with any school, there are attractive people and not so attractive people, people who like to party and people who have never gone out a day in their lives. However, what I will say is that due to the amount of work that MIT brings, it is often hard to find stable relationships. There's just not enough time.",
            "Author": "College Junior",
            "Date": "2014-08-03T12:47:26Z"
        },
        {
            "Rating": 5,
            "Review": "50% of the men are involved in Greek life - it's so huge, it's almost not a big deal anymore.",
            "Author": "College Senior",
            "Date": "2014-06-23T21:20:16Z"
        },
        {
            "Rating": 5,
            "Review": "MIT trusts the students to know what's best.  Changing slightly in recent years.",
            "Author": "College Senior",
            "Date": "2014-06-23T21:18:51Z"
        },
        {
            "Rating": 4,
            "Review": "MIT has fantastic student participation in athletics.",
            "Author": "College Senior",
            "Date": "2014-06-23T21:14:01Z"
        },
        {
            "Rating": 5,
            "Review": "The Greeks here are great.",
            "Author": "College Freshman",
            "Date": "2014-06-07T15:39:24Z"
        },
        {
            "Rating": 4,
            "Review": "I was in a fraternity and I personally thought our chapter house was dirty (compared to my dorm), but apparently this is not the case. Girls would come by and say that ours (meaning ours and MIT frats in general) were much cleaner than fraternities elsewhere, e.g. BU. Anyway, there are MANY fraternities, numbering around 25-30, I think. As such, fraternities consist of anywhere between 20 to 50 brothers, it depends. Sororities are few, I think just 6 or so, and their membership is much higher, numbering around a hundred each. I recall people saying that half the people at MIT are Greek, but that's probably not true. Perhaps the figure is more around 30%, but there are a lot of affiliated people. Greek life at MIT is not 100% like what you see in the media. Yes, brotherhood, sisterhood, pledging, parties, etc. It's all there, but I'd say it's very toned down compared to what you'd see in say the movie, Neighbors (2014). Greeks are like any other students, honestly. I don't think we saw non-Greeks as that much different from Greeks, nor vice-versa. It's all about support networks anyway. Some people have fraternities, some have dorms, some have their extracurriculars or sports. Most, if not all Greek societies have their own chapter house where many of their members live (except the sororities, whose houses could not possibly accommodate all of their members). Greek life is a big part of the MIT atmosphere. Frats hold parties, and everyone holds some sort of philanthropy event. You will notice the Greek presence, it's impossible not to.",
            "Author": "Recent Alumnus",
            "Date": "2014-05-27T14:50:18Z"
        },
        {
            "Rating": 5,
            "Review": "Rich kids, poor kids, you name it. They're all here. In terms of ethnicity, there are mostly white kids and Asian kids, but there's  a good number of other ethnicities as well. Overall, it's very diverse here. There are international students, many from Asian countries, some from African countries, some from Canada (haha). I never ran into many Europeans, though, but I know they exist. There are also people from South America, presumably. Politics, most I think are liberal, though you will find conservatives. Religion varies and as well as sexual orientation. Overall, the MIT community is just one big rainbow. I probably never once thought about diversity as something to be talked about 'cause it seemed to be the norm here.",
            "Author": "Recent Alumnus",
            "Date": "2014-05-27T14:13:41Z"
        },
        {
            "Rating": 3,
            "Review": "Aside from one page in the Tech (our newspaper), most people don't talk about our varsity sports unless they know someone who is a varsity athlete. Intramural sports exist, but those are not talked about much. Of course, we're proud of our Engineers when we actually do well. I wasn't a big exercise or sports person, but I had the impression that our facilities were top-notch, including a swimming pool, archery equipment, dance studios, as well as the massive Z-center.",
            "Author": "Recent Alumnus",
            "Date": "2014-05-27T13:58:55Z"
        },
        {
            "Rating": 3,
            "Review": "Campus is not strict at all.  If they catch you hacking it'll be bad but not that bad.",
            "Author": "College Freshman",
            "Date": "2014-05-02T19:42:21Z"
        },
        {
            "Rating": 4,
            "Review": "Fraternities on campus define the social scene on weekends.",
            "Author": "College Freshman",
            "Date": "2014-05-02T19:35:53Z"
        },
        {
            "Rating": 5,
            "Review": "Great facilities for both athletes and non athletes.",
            "Author": "College Freshman",
            "Date": "2014-03-26T01:22:06Z"
        },
        {
            "Rating": 4,
            "Review": "The school respects the students privacy but also tries to ensure their safety.",
            "Author": "College Freshman",
            "Date": "2014-03-26T01:14:15Z"
        },
        {
            "Rating": 4,
            "Review": "Greek life doesn't really affect the social atmosphere on campus.",
            "Author": "College Freshman",
            "Date": "2014-03-26T00:48:30Z"
        },
        {
            "Rating": 4,
            "Review": "Very lenient. The administration lets us do what we want, as long as we are safe about it.",
            "Author": "College Freshman",
            "Date": "2014-01-21T18:30:22Z"
        },
        {
            "Rating": 5,
            "Review": "I'm involved with Greek life on campus as I'm part of a sorority. Many men are also part of fraternities. Greek life plays a huge role in the party scene as well as the social scene. However, there are many people not involved in Greek life that still are a large part of the social scene. Other living groups and dorms also throw parties. Also, Greek parties are usually not limited to Greek people.",
            "Author": "College Freshman",
            "Date": "2014-01-08T15:51:13Z"
        },
        {
            "Rating": 5,
            "Review": "I've enjoyed the diversity on campus as I come from a very homogeneous background. Everyone comes from very different places with very different beliefs. MIT is also accepting to how anyone identifies in terms of race, ethnicity, religion, and sexual orientation.",
            "Author": "College Freshman",
            "Date": "2014-01-08T15:41:28Z"
        },
        {
            "Rating": 4,
            "Review": "Most dorms at MIT assume you're adults and that you can conduct yourself. However, visitors must sign in and, if not on guest list, get picked up by their host.",
            "Author": "College Freshman",
            "Date": "2014-01-08T13:38:13Z"
        },
        {
            "Rating": 4,
            "Review": "I have not run into any issues regarding diversity personally, but there are people on campus who constantly push for more recognition of diversity, so I have to assume that there are still problems.",
            "Author": "College Freshman",
            "Date": "2014-01-06T22:53:27Z"
        },
        {
            "Rating": 4,
            "Review": "People have a mild interest in athletics, but mostly it's overshadowed by classes.",
            "Author": "College Freshman",
            "Date": "2013-12-27T12:25:42Z"
        },
        {
            "Rating": 4,
            "Review": "The campus is quite diverse, you can meet all sorts of people.",
            "Author": "College Freshman",
            "Date": "2013-12-27T12:22:38Z"
        },
        {
            "Rating": 4,
            "Review": "Fraternities are generally more prevalent than sororities.  The fraternities often hold mixers or parties with sororities from Boston University, because there are more sororities there.",
            "Author": "College Sophomore",
            "Date": "2013-12-10T22:09:15Z"
        },
        {
            "Rating": 5,
            "Review": "Administrators and campus police are very nice.  As long as everything is done in moderation and doesn't pose any health or safety threat, they're cool.",
            "Author": "College Sophomore",
            "Date": "2013-12-10T22:06:47Z"
        },
        {
            "Rating": 5,
            "Review": "The officers are very understanding, very nice, and will not bust parties unless they have already given out multiple warnings",
            "Author": "College Freshman",
            "Date": "2013-11-24T19:22:23Z"
        },
        {
            "Rating": 4,
            "Review": "MIT admissions spends a lot of effort on getting a very diverse student body, and they do a good job overall. There is a wide range of students from different backgrounds, some from well off prep schools and others who had to raise their other siblings.",
            "Author": "College Freshman",
            "Date": "2013-11-24T19:19:02Z"
        },
        {
            "Rating": 4,
            "Review": "MIT students are decently good looking, and smart and interesting as hell. They don't dress particularly well - half the year is brutally cold winter weather, so jeans and Northface coats are in heavy circulation most of the year. The 'work hard play hard' culture makes it difficult to have any type of casual relationships. Hookups and serious relationships are generally the only two options.",
            "Author": "College Sophomore",
            "Date": "2013-11-12T15:49:04Z"
        },
        {
            "Rating": 3,
            "Review": "If you know someone on a varsity team, you will probably go support them at a couple of games/meets during the year. Otherwise sports are beneath the typical student's radar.",
            "Author": "College Sophomore",
            "Date": "2013-11-12T15:33:59Z"
        },
        {
            "Rating": 4,
            "Review": "In terms of partying, campus is pretty lenient. Most everyone can drink in their dorms - in some you can drink out in lounges if your living group is cool with it, but everywhere you can have a small party in your room and it's fine. \r\n\r\nAcademically, attendance is rarely mandatory (except in humanities classes), it just helps boost your grade if you are on the border at the end of the semester. You're pretty much free to do what you like academically as long as you turn in your work and do well on tests.",
            "Author": "College Sophomore",
            "Date": "2013-11-12T15:33:08Z"
        },
        {
            "Rating": 3,
            "Review": "The best part about MIT is the people. I have never met more interesting, intelligent individuals in my life. They come from all walks of life, and a look around campus will disprove the nerd stereotype (though we are all nerds at heart). You have guys and girls with rainbow colored hair who walk around barefoot. You have your not-so-typical jocks, and preps, and hipsters. But even when you think you have someone figured out, they always surprise you. Individuals, therefore, get an A+\r\n\r\nAs far as social life and relationships goes, you run into some road bumps and blocks. People are tend to hang out with a particular friend group after freshman year, making it difficult to branch out and socialize. Additionally, there is no dating culture. You are either in a serious relationship or just hooking-up (which kind of sucks). Plus it can get kind of awkward your senior year when you know everyone and have weeded out all the eligible options",
            "Author": "College Senior",
            "Date": "2013-08-21T12:18:52.097Z"
        },
        {
            "Rating": 5,
            "Review": "MIT is very diverse in religion, political beliefs, sexual orientation, and ethnicity/race. People come from all over the world and bring their culture with them. As whole, MIT is accepting and there isn't really any \"normal\" so to speak.",
            "Author": "College Sophomore",
            "Date": "2013-06-10T14:11:08.86Z"
        },
        {
            "Rating": 5,
            "Review": "Theres so much diversity that that there is no normal.  Everyone is unique.",
            "Author": "College Sophomore",
            "Date": "2013-06-09T09:48:42.113Z"
        },
        {
            "Rating": 3,
            "Review": "We have good athletics programs but certainly aren't world-renowned for most teams. At MIT, students are very much student-athletes, so academics almost always take precedence over athletics. That being said, the administration/faculty try to accommodate athletes as much as possible.",
            "Author": "College Freshman",
            "Date": "2013-05-15T13:39:14.28Z"
        },
        {
            "Rating": 4,
            "Review": "In fact, many of my friends are from different countries. Being at MIT instilled a new respect for international students, because they are very intelligent and very fun to be around.",
            "Author": "College Freshman",
            "Date": "2013-03-10T16:24:18.84Z"
        },
        {
            "Rating": 4,
            "Review": "There are a lot of extracurricular activities- there is a Greek mythology club. At our graduate housing, there is even a Grekk cuisine club- overall diversity is a BIG reason why I chose this school.",
            "Author": "Recent Alumnus",
            "Date": "2013-02-24T15:59:52.513Z"
        },
        {
            "Rating": 3,
            "Review": "Frat life at MIT is amazing. almost 60% of guys join one, and they have a really good sense of community. They are pretty much the entire social scene at MIT for freshmen/sophomore years, then people start going to bars.",
            "Author": "College Sophomore",
            "Date": "2013-01-27T14:21:54.437Z"
        },
        {
            "Rating": 4,
            "Review": "MIT is pretty relaxed about its students drinking. They have a good samaritan policy which means that if you call for an alcohol transport for one of your friends, you can't get in trouble for it, even if you were drinking too. They just want people to be safe and willing to call.",
            "Author": "College Sophomore",
            "Date": "2013-01-27T14:20:03.783Z"
        },
        {
            "Rating": 5,
            "Review": "Greek life is a very strong part of MIT culture, with 50% of undergraduate males across 27 fraternities. There are only 6 Sororities, but any girl who wants to be recruited can be. Rush is one of the most exciting parts of the year, and any given weekend has at least two or three parties going on. Many people have friends across multiple houses, and non-Greek and Greek relations are incredibly good; an example all other schools should live up to.",
            "Author": "College Freshman",
            "Date": "2013-01-19T21:56:36.707Z"
        },
        {
            "Rating": 5,
            "Review": "Greek Life at MIT is incredible. The fraternities and sororities are extremely involved on campus and in philanthropic activities. Greek Life is a way to get to know a bunch of cool people like you (whoever you are). MIT Greek Life is based on acceptance, love, and personal development.",
            "Author": "College Freshman",
            "Date": "2013-01-06T08:38:02.303Z"
        },
        {
            "Rating": 5,
            "Review": "There are people from every walk of life here at MIT. I have met a students from at least fifteen different countries just in my graduating class. It is inspiring and amazing to know that these people come from different backgrounds and yet we will all go on to do something great (hopefully, if you can get the grades).",
            "Author": "College Freshman",
            "Date": "2012-11-29T14:37:48.74Z"
        },
        {
            "Rating": 5,
            "Review": "Whether you're Greek at MIT or not, most likely you're affected by Greek life in someway or another. The Greeks at MIT are generally nice people, sociable yet smart. They aren't the Animal House Greeks, they're not backstabbers or jerks--they're people who enjoy helping the community and throwing great parties. MIT Greek parties are great. They compete with big state schools; the houses are multilevel party pads and the brothers are generally very hospitable and nice. Students flock from everywhere, including BU, Wellesley, BC, and Harvard--the last school which suffers from the \"douchey\" Greek scene. And MIT Greeks are pretty good looking too--I was surprised.",
            "Author": "College Sophomore",
            "Date": "2012-08-25T18:37:57.19Z"
        },
        {
            "Rating": 5,
            "Review": "Around the World – i haven't yet been in an atmosphere more diverse than MIT campus. skin color matters the least of any issue i know of - more important are your creativity, hacking abilities, willingness to try new things, cooking, and psetting skills.  because we have an online, anonymous connection site, people can jump to conclusions (online anonymity will do that) and judge based on 2 sentences that might come across different across the internet than in real life, but it's never about skin color. Sexual identity is the closest we get to a fundamental eye-to-eye disagreement, but that's rarely an issue.",
            "Author": "College Sophomore",
            "Date": "2012-08-14T00:06:07.06Z"
        },
        {
            "Rating": 5,
            "Review": "Extremely Diverse – MIT is one of the most diverse environments in which I have lived.  Students from not only all over the US, but all over the world make up MIT's student body.  MIT attracts the student who loves to learn and will truly strive to make a difference, and this type of student is not characterized by a typical race, religion, political view, etc.",
            "Author": "College Junior",
            "Date": "2012-08-01T06:19:56.64Z"
        },
        {
            "Rating": 4,
            "Review": "Contrary to Popular Belief, We Love Sports! MIT is one of the top-ranked schools for Division III sports! And we also have crew as a Division I sport and sailing as an internationally recognized sports program. Our sports teams are great and they provide a good balance with the academics here. We have team sports that range from Skiing to underwater hockey. And the facilities for sports are some of the newest at any campus. Most people partake in IM sports of some form and athletes have access to some of the best trainers and sports medicine staff around.",
            "Author": "College Sophomore",
            "Date": "2012-07-10T13:27:17.633Z"
        },
        {
            "Rating": 3,
            "Review": "Cute Guy Every Once in a While – There are plenty of cute guys/frat boys, but the overall population is a little too nerdy for my liking.",
            "Author": "College Sophomore",
            "Date": "2012-07-07T10:36:04.68Z"
        },
        {
            "Rating": 5,
            "Review": "Big Greek Culture – Over half of the guys pledge a fraternity, and many girls belong to a Sorority, somewhere around 30%. It's a substantial number, and it affects social life in a significant way. That being said, not being Greek does not alienate you from the school in any way. You can still appreciate the events and parties, and you can still have Greek friends, so it's really up to you what you want to do. There are 26 fraternities and 6 sororities, and each one is different, so look around and there's sure to be a match.",
            "Author": "College Student",
            "Date": "2012-05-08T19:52:45.453Z"
        },
        {
            "Rating": 3,
            "Review": "Only One D1, but Plenty of Intramurals – Crew is the only Division 1 sport at MIT, but there are over 1,000 intramural teams, and most individual dorm floors have their own team for some sport or other. The facilities are good, and the student body is active. Not a big sports school -- much more into technology.",
            "Author": "College Student",
            "Date": "2012-05-08T19:49:15.06Z"
        },
        {
            "Rating": 4,
            "Review": "Punishments Are Severe – The police force can be pretty strict about underage drinking and drug use. First-time offenders get a letter sent home, and second- and third-time offenders are in danger of losing their housing. It's pretty serious if you get caught, so my best advice is to do everything discreetly and not to be obnoxious about it. If you're going to drink then drink, but don't start advertising keg parties in your room. You will get busted!",
            "Author": "College Freshman",
            "Date": "2012-03-02T01:27:51.553Z"
        },
        {
            "Rating": 5,
            "Review": "An Attractive Nerdly Bunch – Everyone here is a nerd in one way or another. Despite that, just about everyone is well-put-together and reasonably attractive. People here are a lot of fun, too: whether you enjoy mad parties (college kids from all over Boston come to MIT parties because they're organized better) or making plasma arcs with friends in the lounge down the hall, there are people willing to do it with you.",
            "Author": "College Freshman",
            "Date": "2012-02-11T14:48:40.11Z"
        },
        {
            "Rating": 5,
            "Review": "As a white student! MIT is fantastic at making everyone feel equal (and equally unintelligent :-D) so that race, sexual orientation and everything else don't really matter. We have a fantastic LGBT support group and a thousand different ethnic organizations.",
            "Author": "College Senior",
            "Date": "2012-01-29T16:48:01.29Z"
        },
        {
            "Rating": 5,
            "Review": "Priority of Student's Well-Being and Success – The police and EMS service cares most about the well-being of students. and not under-age drinking. Academic policies are extremely fair. The school provides endless resources to help students succeed.",
            "Author": "College Sophomore",
            "Date": "2012-01-20T13:14:32.683Z"
        },
        {
            "Rating": 4,
            "Review": "Diverse Interests – Every weekday there is some student group fundraising for their cause or promoting some sort of message. The range of extracurricular interests is visible, and people respect each other's interests. For the LGBT community, MIT has student groups who do a few campaigns a year, such as a Day of Silence. Outside of those big events, MIT students are very open to all sexual orientations.",
            "Author": "College Junior",
            "Date": "2012-01-19T23:47:58.11Z"
        },
        {
            "Rating": 4,
            "Review": "There is great diversity at MIT in terms of race, sexuality, and origin. Groups of minorities do tend to hang out together in groups, but it's not really a big deal. I love the different perspectives and interests that everyone brings to campus. We all have one thing in common, we're really really smart, no matter what other differences there are.",
            "Author": "College Sophomore",
            "Date": "2012-01-19T12:28:50.15Z"
        },
        {
            "Rating": 3,
            "Review": "PE Requirement Expands Horizons – MIT has a 8 unit PE requirement- meaning 2 seasons of a varsity sport, or 4 PE classes.  This requirement is a great way of keeping kids in a semblance of \"fitness\", and is a fun way to be exposed to different athletic areas. PE classes include archery, pistol, sailing (get your pirates licence with those three!), Pilates, yoga, Zumba, lifting, swimming, SCUBA certification, health, soccer...  There are also varsity sports and three different league levels of intramural sports.",
            "Author": "College Junior",
            "Date": "2012-01-19T10:36:22.373Z"
        },
        {
            "Rating": 5,
            "Review": "Freedom Is Great – Our administration is not very strict. They encourage safe hacking, and generally are not concerned too much about alcohol and drugs. If they are, it isn't prominent. Most of the issues come from within the IFC and JuddComm.",
            "Author": "College Sophomore",
            "Date": "2012-01-19T10:04:25.577Z"
        },
        {
            "Rating": 4,
            "Review": "Recreational Sports Are Great – Our recreational sports facilities are absolutely amazing. Our Z-center (gym) is state-of-the-art and there are always ways to play a sport in an intramural league or in our wide open field spaces. I can't say much for the varsity sports since I'm not on one, but I can say that the games aren't as widely attended as at Division I sports schools",
            "Author": "College Junior",
            "Date": "2012-01-19T08:49:07.647Z"
        },
        {
            "Rating": 3,
            "Review": "Sure, there are plenty of guys and girls that fit the nerdy-looking, socially awkward stereotypes. But I've found that a comment that lots of us hear from people we meet at other schools is \"I wouldn't have expected you to be from MIT.\" there's a whole range of types here: hot and not, trendy and goes-outside-in-pajamas, partiers and those who do homework on Friday nights.",
            "Author": "College Sophomore",
            "Date": "2012-01-19T00:46:34.05Z"
        },
        {
            "Rating": 4,
            "Review": "MIT students are perfectionists. They give their best for their sports and most of us enjoy exercising. I would like more support on athletics events from students out of the sport.",
            "Author": "College Freshman",
            "Date": "2012-01-19T00:11:06.62Z"
        },
        {
            "Rating": 3,
            "Review": "Fairly Diverse – You definitely meet people from all over the world that it's amazing. I would say the grad international student population is even bigger than the undergrad though. And in undergrad, you still get your fair amount of Asians",
            "Author": "College Freshman",
            "Date": "2012-01-18T23:01:40.03Z"
        },
        {
            "Rating": 4,
            "Review": "MIT boasts an accepting and diverse student body comprised of driven individuals of all walks of life. There is a strong spirit of cooperation and support in school life which carries on into the openness and fellowship that all students can expect from their peers in their social lives. The faculty takes additional efforts to illuminate and build upon the school's varied background with events and meetings with incoming students, as well as continued programs that help to bridge any gaps one might come across during their time at school. The strongest part of the mixed cultural backgrounds of MIT students is the overall acceptance of other peoples, cultures, and beliefs, and the willingness to learn about and understand them. MIT students for a strong community that is both close-knit and open in its interactions. This is one of the many things that helps make MIT a wonderful place to be.",
            "Author": "College Freshman",
            "Date": "2011-12-30T00:34:10.323Z"
        },
        {
            "Rating": 3,
            "Review": "Not That Nerdy, Really! We're really not all that nerdy.  We definitely do have our share of people who live for school and are socially challenged, but we also have people who are extremely social.  The people are my favorite part of MIT.  They're so quirky and you can find some nice, genuine people here.  And, I'll admit that they throw some decent parties.",
            "Author": "College Sophomore",
            "Date": "2011-11-07T22:12:49.867Z"
        },
        {
            "Rating": 3,
            "Review": "Mostly Helpful, but You Have Your Moments of Course – In regards to drug and alcohol abuse, MIT offers a safety net for students in that they will have them taken, free of charge, to a hospital if needed and the student will not suffer any consequences from the local police authority or from MIT (if an isolated incident).  The bill is often also covered on MIT insurance, so parents may or may not see it.  This policy is to encourage students to make the right decision and call for help when they need it.\r\nThe police are pretty visible and they give students rides when they need it.  They are accessible and generally friendly.\r\nThere are many hacks at MIT, but there is a code that nothing should be permanently damaged.  Because this is followed strictly, there are usually no problems with authority.\r\nSome things are awful, like shortening REX, imposing a highly strict dining plan, and extending the length of the semesters, but you have to suck it up when you go to a school like MIT.",
            "Author": "College Sophomore",
            "Date": "2011-11-07T22:04:16.213Z"
        },
        {
            "Rating": 4,
            "Review": "Pretty Diverse – MIT is actually fairly international place and we have many people from different backgrounds.  There's always someone in the halls speaking another language and you really get a good feel for others' cultures while you're here.  There are also tons of student cultural groups where you can explore different things.",
            "Author": "College Sophomore",
            "Date": "2011-11-07T21:57:51.09Z"
        },
        {
            "Rating": 4,
            "Review": "Don't Be Stupid – As long as you don't do anything to put anyone (including your self) in danger, strictness is not really an issue. Academic policies tend to be flexible, if you petition the right group you can usually get what you want.",
            "Author": "College Freshman",
            "Date": "2011-09-25T14:52:15.46Z"
        },
        {
            "Rating": 5,
            "Review": "Greeks Are Great – The Greek community facilitates both great friendships and close bonds as well as helps organize social events for the rest of campus.",
            "Author": "College Freshman",
            "Date": "2011-09-25T14:50:33.033Z"
        },
        {
            "Rating": 4,
            "Review": "We have an amazing athletics program. Athletics are really important to students even as a DIII school. We have great sports trainers and an awesome athletics center.",
            "Author": "College Senior",
            "Date": "2011-08-05T00:05:13.783Z"
        },
        {
            "Rating": 3,
            "Review": "Not What You Might Think – Contrary to popular belief, MIT does not wholly consist of nerds who sit inside and do homework all day. The good thing about a Division III school is that it's really easy to get involved in a new sport. Even if you don't have the time to go all in and try to play varsity, there's plenty of club sports and intramurals that anyone can get involved in as often as they like. Although our sporting events don't get a lot of spectators, it's hard to not know anyone that's participating in a competition sport; most people have been to a game or another here or there. The teams show a lot of spirit and are very close knit groups of people that are always welcome to new friends and members. A lot of freshmen men get involved in varsity crew for this reason (we actually do row in division I).",
            "Author": "College Sophomore",
            "Date": "2011-07-25T01:23:26.81Z"
        },
        {
            "Rating": 5,
            "Review": "A Great Experience – 50% guys, 25% girls are greek. The greek scene doesn't dominate campus, but it's a fantastic support group and source of fun for those who choose to be members. The greek atmosphere relates somewhat to the campus atmosphere, which is part of what makes the greek community so great, because you know that you have something in common with everyone, no matter what their affiliation, because we're all nerds in one way or another.",
            "Author": "College Junior",
            "Date": "2011-03-25T15:47:20.247Z"
        },
        {
            "Rating": 3,
            "Review": "More Diverse Than Meets the Eye – The students are not all nerds, but you can find an inner geek in most students, even the hard-core partyers. The dorms each have a very unique culture.",
            "Author": "College Freshman",
            "Date": "2010-12-28T20:32:58.657Z"
        },
        {
            "Rating": 3,
            "Review": "You're Given Your Freedoms, but Don't Abuse Them – The police are definitely out of your face. Most frats are off campus, so they also have less control.",
            "Author": "College Freshman",
            "Date": "2010-12-28T20:29:51.463Z"
        },
        {
            "Rating": 5,
            "Review": "MIT accepts based on merit, so the diversity students at this school stand their ground and are truly exceptional.  MIT LGBT students are also highly prevalent on campus, and have activities that are all inclusive.  MIT has a global orientation and outlook, so anyone from any race would feel included here.",
            "Author": "Recent Alumnus",
            "Date": "2010-12-24T01:59:47.16Z"
        },
        {
            "Rating": 5,
            "Review": "Go crazy – at MIT they try their best to make sure that the students here can work hard and then play hard. I haven't heard of MIT police arresting anyone for alcohol use. The police here are really nice and you can get away with most anything if you aren't stupid about it.",
            "Author": "College Sophomore",
            "Date": "2010-12-18T19:40:33.297Z"
        },
        {
            "Rating": 5,
            "Review": "At MIT, more than half of boys and a good percentage of girls are a part of a frat or sorority. It's a big part of the school because frat parties dominate the socializing scene.",
            "Author": "College Sophomore",
            "Date": "2010-10-04T17:12:02.013Z"
        },
        {
            "Rating": 3,
            "Review": "Not Too Hot – Both the girls and the boys at MIT are not too attractive, although they make up for that with intelligence. Once in a while though, you can find one or two that are worth a double take.",
            "Author": "College Sophomore",
            "Date": "2010-10-04T17:08:49.2Z"
        },
        {
            "Rating": 4,
            "Review": "Pretty Diverse, Mostly Asian – you can find lots of different races and religions at MIT, although the majority of the school seems to be asian.",
            "Author": "College Sophomore",
            "Date": "2010-10-04T17:06:25.497Z"
        },
        {
            "Rating": 3,
            "Review": "Good Balance – The campus police are mostly around to ensure safety. There aren't too many crackdowns on underage drinking and such, as the party scene is quite large here. Academic-wise, however, it is in your best interest to follow the integrity policy as professors will dish out punishments accordingly if caught cheating or copying.",
            "Author": "College Freshman",
            "Date": "2010-05-29T19:56:48.337Z"
        },
        {
            "Rating": 3,
            "Review": "Sports Not in Spotlight – While there is a good variety of sports, and a solid athletic program, unlike most schools, athletics are not as big of a deal here. They're visible, but not a top priority. However, among the people you meet are still a large number of athletes. IM sports are more common across the general population.",
            "Author": "College Freshman",
            "Date": "2010-05-29T19:54:57.283Z"
        },
        {
            "Rating": 5,
            "Review": "Melting Pot – Coming from a small town in a red state, MIT's diversity was spectacular.  People are very open and accepting, people have very different tastes, and it's very easy to meet people with the same interests, economic backgrounds, or religious affiliations or sexual orientation.",
            "Author": "College Sophomore",
            "Date": "2010-04-15T19:12:51.733Z"
        },
        {
            "Rating": 5,
            "Review": "You really shouldn't go on rooftops, or you can get fined if caught... Yet every year, the frosh and prefrosh go on tours that take them up there with no problems.\r\nIf you drink and you weren't suppose to, you might get yelled at, or your parents might be informed, but usually that doesn't happen. My friend ended up in medical after over-drinking. He had also fallen and hurt his head. They ended up shaving his hair off. Well, he's still around and nothing else happened. \r\nParties that involve alcohol in your dorm buildings have to be registered in advanced, but it is a very straightforward process.\r\nUnless you are planning to hurt someone or damage property, you're likely not to get in much trouble.",
            "Author": "Recent Alumnus",
            "Date": "2010-04-08T15:48:31.75Z"
        }
    ],
    "Academics": [
        {
            "Rating": 5,
            "Review": "The academics at MIT are exceptional because each and every student is willing to put forth the effort to achieve their own goals, that are motivated by intrinsic values.",
            "Author": "College Freshman",
            "Date": "2015-12-29T19:35:51Z"
        },
        {
            "Rating": 4,
            "Review": "They expect you to learn a lot on your own.",
            "Author": "College Sophomore",
            "Date": "2015-12-29T16:36:22Z"
        },
        {
            "Rating": 5,
            "Review": "For my major, MIT is the best right now",
            "Author": "College Freshman",
            "Date": "2014-11-25T05:29:42Z"
        },
        {
            "Rating": 5,
            "Review": "Internships are easy to come by here. Having \"MIT student\" on an internship application helps tremendously because of both the excellent alumni network and the reputation that comes with the school.",
            "Author": "College Freshman",
            "Date": "2014-11-19T14:02:28Z"
        },
        {
            "Rating": 5,
            "Review": "Getting into a specific program is as easy as choosing that program once you're accepted into the institute.",
            "Author": "College Junior",
            "Date": "2014-09-24T03:36:50Z"
        },
        {
            "Rating": 5,
            "Review": "I love studying biology at MIT. The workload is probably average for an MIT major, and there are so many amazing professors to learn from and do research with.",
            "Author": "College Senior",
            "Date": "2014-08-14T21:58:09Z"
        },
        {
            "Rating": 5,
            "Review": "The professors are amazing. You'll probably learn from Nobel laureates and future Nobel winners. A lot of professors will discuss a topic in class and casually mention, \"I figured this out in my graduate research\" or \"my lab made this discovery.\" The curriculum is challenging but very interesting and doable. The workload is manageable and registration is easy.",
            "Author": "College Senior",
            "Date": "2014-08-14T21:58:09Z"
        },
        {
            "Rating": 4,
            "Review": "MIT is a great place to find research or biotech internships if you're studying biology.",
            "Author": "College Senior",
            "Date": "2014-08-14T21:45:09Z"
        },
        {
            "Rating": 4,
            "Review": "Studying biology at MIT is great. It's a relatively flexible major, and you'll (almost) never have trouble scheduling the classes you want to take.",
            "Author": "College Senior",
            "Date": "2014-08-14T21:45:09Z"
        },
        {
            "Rating": 5,
            "Review": "When it comes to getting a job or doing undergraduate research, MIT provides countless opportunities and support for its students. We have a GECD office where they will review your resume, conduct a mock interview, and provide other support. We also have multiple career fairs on campus which is where most students find summer internship opportunities. Another option is doing research, which often comes as easy as shooting an e-mail to a professor.",
            "Author": "College Junior",
            "Date": "2014-08-03T12:44:53Z"
        },
        {
            "Rating": 5,
            "Review": "For the internships and research opportunities that I've had, the process has been very easy. It simply took me e-mailing a few professors and going in for a simple interview.",
            "Author": "College Junior",
            "Date": "2014-08-03T12:44:53Z"
        },
        {
            "Rating": 5,
            "Review": "The professors are some of the best in the world, and the kid sitting next to you might just be the next Bill Gates.",
            "Author": "College Senior",
            "Date": "2014-06-23T21:21:33Z"
        },
        {
            "Rating": 5,
            "Review": "It's MIT.  You're surrounded by some of the smartest people in the world.  It's great.",
            "Author": "College Senior",
            "Date": "2014-06-23T21:15:23Z"
        },
        {
            "Rating": 5,
            "Review": "The academics are brutally difficult, but very rewarding.",
            "Author": "College Senior",
            "Date": "2014-06-23T21:15:23Z"
        },
        {
            "Rating": 4,
            "Review": "Professors tend to be very well-qualified, if not overly qualified. Many of the best are here at MIT (especially in linguistics). While some people complain about the GIRs (General Institute Requirements) which include physics (Newtonian and electricity and magnetism), biology, chemistry, and calculus, I think it's very useful to have a grounding in these basic fields so you can communicate with other academics and understand their fields. The humanities requirement is also something to complain about, but I think there's value in it. Naturally, MIT's workload is massive, to the point where people will cry about their homework (I have, one very long night that lasted until 7am). We have a joke (which apparently is used elsewhere as well): sleep, social life, and grades, pick two. Despite the workload, people are not very competitive since we're all basically screwed. The only way to do MIT is to help each other survive, hence the extremely collaborative academic environment. Popular study areas are the libraries, but personally, I always hung out in my fraternity or at my dorm in the common areas.",
            "Author": "Recent Alumnus",
            "Date": "2014-05-27T14:42:23Z"
        },
        {
            "Rating": 4,
            "Review": "There are plenty of research opportunities as undergraduates via UROP, either as paid research or for-credit research. You can apply for any such opportunity in any department, so long as you're qualified. I did research at a cognitive science lab, with the linguistics department, and with a group at the MIT Media Lab.",
            "Author": "Recent Alumnus",
            "Date": "2014-05-27T14:26:53Z"
        },
        {
            "Rating": 5,
            "Review": "Every major gets the best faculty, the best classes, and the best resources available in the world.",
            "Author": "College Freshman",
            "Date": "2014-05-02T19:33:56Z"
        },
        {
            "Rating": 5,
            "Review": "We are the best Engineering school in the world!!!!!",
            "Author": "College Freshman",
            "Date": "2014-03-26T01:09:40Z"
        },
        {
            "Rating": 5,
            "Review": "As a freshman, I am not in a specific major. I will declare in April",
            "Author": "College Freshman",
            "Date": "2014-03-26T01:00:36Z"
        },
        {
            "Rating": 5,
            "Review": "You'll work harder in school than you ever have, but it's entirely worth it. The faculty are amazing, and there are always a wealth of internship/job opportunities.",
            "Author": "College Sophomore",
            "Date": "2014-01-23T10:12:31Z"
        },
        {
            "Rating": 5,
            "Review": "I plan to have an internship this summer. I know that MIT can help me find one. Employers prefer MIT students as MIT is known preparing students well for the workforce.",
            "Author": "College Freshman",
            "Date": "2014-01-08T15:47:48Z"
        },
        {
            "Rating": 5,
            "Review": "Academics are challenging at MIT as it holds up to its prestigious name. However, first semester of freshmen year students are on a pass/ no record system where every class they take appears on their transcripts only if they pass. And if they pass, the only grade indicated is a P. Professors are amazing and very helpful as well as TAs and upperclassmen. So though the work can be hard, MIT supplies a large support network. Also, many students are involved with research on campus and finding an internship is very easy.",
            "Author": "College Freshman",
            "Date": "2014-01-08T13:45:12Z"
        },
        {
            "Rating": 5,
            "Review": "Professors are amazing and teach well to the curriculum. There is rarely a problem of getting the classes you desired. Though the workload is a lot, there are many resources to help you along. Many people study in the libraries, dorm lounges, or in their rooms. There is rarely a time where finding a study space is a problem.",
            "Author": "College Freshman",
            "Date": "2014-01-08T13:45:12Z"
        },
        {
            "Rating": 4,
            "Review": "I don't know much about it yet, but from what I hear it's a nice program",
            "Author": "College Freshman",
            "Date": "2013-12-27T12:23:46Z"
        },
        {
            "Rating": 5,
            "Review": "All the classes are hard, but it's nice to have people to work with.",
            "Author": "College Freshman",
            "Date": "2013-12-27T12:23:46Z"
        },
        {
            "Rating": 5,
            "Review": "The best college, nobody can ever see.",
            "Author": "Recent Alumnus",
            "Date": "2013-10-17T05:03:37Z"
        },
        {
            "Rating": 5,
            "Review": "There is no special application process for entering any major at MIT; you just enroll in the relevant classes. You can declare a major at the end of your freshman year.",
            "Author": "College Junior",
            "Date": "2013-06-18T13:26:19.387Z"
        },
        {
            "Rating": 5,
            "Review": "I'm studying Nuclear Science and Engineering. It has been a fantastic experience so far. The department is very small--we have approximately 35 undergrads, and around 100 grads. However, we also have on the order of 30 professors, so you get to know everyone really well. UROPs are really easy to come by, and the faculty and staff as a whole are very supportive.",
            "Author": "College Junior",
            "Date": "2013-06-18T13:23:59.953Z"
        },
        {
            "Rating": 4,
            "Review": "I love that you dont have to declare a major right away.  There are a lot of opportunities to explore options and speak to advisors and even change your mind as you go.",
            "Author": "College Sophomore",
            "Date": "2013-06-09T09:40:54.203Z"
        },
        {
            "Rating": 4,
            "Review": "It is very difficult to get in and the admissions process is very unique.  They are looking for people with good grades and test scores who also have other fascinating or impressive activities and accomplishments that show they are much more than a test taker.  My advice for perspective students is that first they really make the most of their high school experience.  Dont participate in everything just to say you did.  Find one or two things that you love and pursue them and become great.  When you fill out the application, be yourself.  Dont lie or say things just to impress, but also highlight your positives and show that you have learned much, but are excited about the prospect of learning so much more.  Write essays that show you are human and can handle hardship and that you can work with others effectively.  Then, be sure to apply to plenty of other schools.",
            "Author": "College Sophomore",
            "Date": "2013-06-09T09:32:21.943Z"
        },
        {
            "Rating": 5,
            "Review": "I'm not going to lie, academics at MIT is challenging. But it makes you think. You're not just handed the answer or asked to regurgitate what the professor has taught you. You solve problems, learn the underlying principles of complex ideas, derive equations that you were given in high school in order to figure out how things work, and do so much more. MIT brings new meaning to learning, and they make sure you get out truly knowing what you have studied.",
            "Author": "College Freshman",
            "Date": "2013-05-30T13:06:02.277Z"
        },
        {
            "Rating": 5,
            "Review": "The Computer Science program at MIT is excellent. It gives students the opportunity to work in labs and experience first hand what it means to be computer scientists.",
            "Author": "College Freshman",
            "Date": "2013-01-29T19:57:54.2Z"
        },
        {
            "Rating": 5,
            "Review": "All the professors are experienced and love what they do.",
            "Author": "College Freshman",
            "Date": "2013-01-29T19:56:07.837Z"
        },
        {
            "Rating": 5,
            "Review": "I'm in the Aerospace engineering program and I love it. Students pick their major/department at the end of freshman year. Sophomore year in Aerospace Engineering, all students take the same core engineering classes and do projects together (like build gliders and rc airplanes) and the whole class gets very close. The workload is heavy but our professors are engaging and available a lot to help us.",
            "Author": "College Sophomore",
            "Date": "2013-01-27T14:27:02.557Z"
        },
        {
            "Rating": 5,
            "Review": "MIT has a good reputation for a reason: you really do learn very well from the classes. I've had only one semester so far, but all of my classes have been very interesting and well taught. Intro to Linguistics, for example, was possibly one of the best classes I've ever taken; we learned about everything from phonetics to syntax, and the professor was funny, accessible (he even stayed after class basically every day for quite some time to answer extra questions from several students), and very knowledgeable. And that's just my one Humanities/Arts/Social-Sciences class--there are also the technical classes, which you would expect MIT to be even better at (and it is indeed at least as good).",
            "Author": "College Freshman",
            "Date": "2012-12-27T02:04:29.667Z"
        },
        {
            "Rating": 5,
            "Review": "It is extremely difficult to be successful here without the help of other students. Everyone may be smarter than you in one way but you might beat them in another subject. The professors are great and the available tutoring and support from fellow classmates is great as well.",
            "Author": "College Freshman",
            "Date": "2012-11-29T14:34:24.567Z"
        },
        {
            "Rating": 5,
            "Review": "If I could do it all over again, I would. MIT is an amazing place. I plan to be a physicist and an astronaut, and I know MIT will prepare me well in how to find opportunities to do what I want. MIT helps you look for jobs, and helps you prepare for networking, resumes, and anything else to help you succeed",
            "Author": "College Freshman",
            "Date": "2012-01-21T15:09:55.87Z"
        },
        {
            "Rating": 5,
            "Review": "Internships that students acquire on campus can be payed or graded. All the students that I know have wanted a UROP have gotten one.",
            "Author": "College Freshman",
            "Date": "2012-01-19T12:04:34.677Z"
        },
        {
            "Rating": 5,
            "Review": "Extremely Easy – It is extremely easy to declare your major because all you have to do is choose one at the end of your freshman year (and you can still conceivably change it for about a year after that). Before declaring your major, you take required general education classes, so if you don't know what you want to major in or change your mind during that year you don't fall behind in any way.",
            "Author": "College Junior",
            "Date": "2012-01-19T08:55:45.327Z"
        },
        {
            "Rating": 4,
            "Review": "I'm currently a Mechanical Engineering major at MIT and I must say that I really truly enjoy it here. The psets are pretty tough and there is much work to be done, but I absolutely adore the place and can never see myself anywhere else. Job openings are available to anyone who needs the extra cash to go out in Boston and to pay tuition, and there is a plethora of activities to be a part of! MIT is really a wonderful, cohesive community where we all enjoy being Beavers and learn and work together.",
            "Author": "College Freshman",
            "Date": "2011-08-15T12:01:26.067Z"
        },
        {
            "Rating": 5,
            "Review": "Engineering and Beyond – Even though MIT is most know for being the #1 Engineering University in the world, its breadth of classes range from phenomenal classes in Linguistics to majors in the pure sciences. Registration is easy and the amount of General Institute Requirements are manageable. The professors are extremely nice and freshman are even allowed, and actually encouraged, to take classes with Nobel Laureates since they too try to reach out to all ages at the Institute. The curriculum and workload are rigorous but it all indeed pays off when you finally get to turn over your \"brass rat\" and walk out into the world, a confident and qualified individual.",
            "Author": "College Freshman",
            "Date": "2011-08-15T11:48:42.347Z"
        },
        {
            "Rating": 4,
            "Review": "Mathematics Major – The professors are amazing and really involved with their students. They really want to see the students succeed.",
            "Author": "College Senior",
            "Date": "2011-08-04T23:59:40.403Z"
        },
        {
            "Rating": 5,
            "Review": "Challenge Accepted! Classes at MIT are definitely not easy. Even if you think you've seen material in the class before, it's worth relearning it because of all the extra insight that is given in lectures. The professors are exceptional; they're available for help,but at the same time encourage students to find their own solutions and really learn how to learn rather than representing the material. It's an intense workload, but if you can take the heat, you'll come out having learned more than you ever thought you could.",
            "Author": "College Sophomore",
            "Date": "2011-07-25T01:12:58.813Z"
        },
        {
            "Rating": 5,
            "Review": "Mechanical Engineering – Classes are very interesting and useful to real world applications.",
            "Author": "College Sophomore",
            "Date": "2011-06-10T18:55:51.98Z"
        },
        {
            "Rating": 5,
            "Review": "Obviously, MIT has a reputation for a solid science, math, and engineering curriculum. One thing that you don't hear is how easy it is to get help with the difficult coursework if you are struggling. There are tutors and TAs that are always willing to give up time to help you out. And in addition to being renowned scientists, researchers, and physicists, our professors are extremely approachable and are willing to not only talk with you about the class but also about their research or other things that interest them.",
            "Author": "College Sophomore",
            "Date": "2010-10-04T17:18:17.23Z"
        },
        {
            "Rating": 4,
            "Review": "Advisors Have Your Best Interest at Heart – While I have not officially started classes in my major (Mechanical Engineering), I have already met with my academic advisor and spoken with other various professors in the MechE field regarding my classes. They were all extremely attentive and helped me work out my class schedule for this semester and the semesters to come",
            "Author": "College Sophomore",
            "Date": "2010-09-04T21:13:29.317Z"
        },
        {
            "Rating": 5,
            "Review": "There is a wide range of classes offered. The workload will keep you very busy, and students often have extra-curricular activities that keep them even busier. There is a lot of help offered, though office hours and tutoring services. There is even a Reading Room, which is a quite room of tables and desks to study.",
            "Author": "College Freshman",
            "Date": "2010-04-13T03:55:37.167Z"
        }
    ],
    "Campus": [
        {
            "Rating": 5,
            "Review": "I am in love with the city of Boston and the surround area.",
            "Author": "College Freshman",
            "Date": "2015-01-12T15:33:33Z"
        },
        {
            "Rating": 4,
            "Review": "The Boston/Cambridge area is an awesome place to go to college because there's always something to do nearby. It can be within walking distance or a few stops on the T. There are museums, malls, restaurants, you name it, it's most likely there.",
            "Author": "College Junior",
            "Date": "2014-12-16T13:51:15Z"
        },
        {
            "Rating": 4,
            "Review": "It's easy to get wrapped up in your own world on campus, and Cambridge sometimes feels a little sketchy. But if you take the time to venture into Boston, there's a ton to do. A lot of fraternities are located in Boston, and I'm jealous that the brothers get to have so much culture and life around them!",
            "Author": "College Sophomore",
            "Date": "2014-11-13T13:52:51Z"
        },
        {
            "Rating": 5,
            "Review": "With Boston just a bridge away, there's countless activities to do all the time. It's more of a challenge of deciding which ones to do when!",
            "Author": "College Junior",
            "Date": "2014-09-24T03:17:09Z"
        },
        {
            "Rating": 4,
            "Review": "Lots to do in Boston.",
            "Author": "College Junior",
            "Date": "2014-08-25T12:56:46Z"
        },
        {
            "Rating": 5,
            "Review": "From Newbury Street to Boston Commons, there's always something to do or somewhere to go.",
            "Author": "College Sophomore",
            "Date": "2014-08-21T20:48:04Z"
        },
        {
            "Rating": 4,
            "Review": "The campus facilities are varied and interesting. There are plenty of easy-to-access computer labs with great services such as free printing.",
            "Author": "College Senior",
            "Date": "2014-08-14T21:52:23Z"
        },
        {
            "Rating": 5,
            "Review": "Boston is a fantastic college city. There are concerts, clubs, restaurants, and tons of college students to mingle with.",
            "Author": "College Senior",
            "Date": "2014-08-14T21:40:27Z"
        },
        {
            "Rating": 4,
            "Review": "There are a lot of great facilities at MIT - particularly in the more science/technology side of things but we are lacking in some of the facilities for arts, etc.",
            "Author": "College Junior",
            "Date": "2014-08-03T13:02:11Z"
        },
        {
            "Rating": 5,
            "Review": "So much free software. Free Windows, free VPN clients, FTP/SSH clients, etc. Our computer labs (called Athena clusters) are numerous and all over the place. You can print tons for free. And MIT internet is pretty darn fast. Wifi is available practically everywhere. I'd say you should have your own laptop just so it's very convenient, especially if you are Course 6 (electrical engineering and computer science). But, you can easily do without a laptop as there are many many Athena clusters.",
            "Author": "Recent Alumnus",
            "Date": "2014-05-27T14:36:57Z"
        },
        {
            "Rating": 3,
            "Review": "Public transportation in Boston is a mixture of things. The T (or MBTA) is the subway/bus system in Boston. It will take you to many places within the metro-Boston area, including the suburbs (where I grew up), thus offering many opportunities to easily explore the many neighborhoods and suburbs in Boston. The cost is a bit steeper than what it used to be, but it's fine, I suppose. You can easily take the T to Boston Logan International Airport (BOS) so there's not much need for taxis unless you have a flight at some wee-hour of the night/morning when the T doesn't run. Yes, that is a problem. The T doesn't run very late, so you can't go out at night and stay out very very late if you plan to return home without a taxi. Another thing about the T is that it is notorious for not being on time, especially the Green Line (the subway/trolley line) and the buses.",
            "Author": "Recent Alumnus",
            "Date": "2014-05-27T14:31:16Z"
        },
        {
            "Rating": 3,
            "Review": "Boston is not known for its good weather. Outside of early fall and late spring, you will be experiencing rain, snow, and more rain and snow. It's also very finicky. One second, it could be sunny. The next, it could be cloudy and potentially rainy. The summer is extremely hot (due to the humidity). But this is not to say there aren't good days. There are, it's just they're usually less frequent. There is a running joke that whenever we invite pre-frosh to CPW (Campus Preview Weekend), we turn on our weather machine. If you like seasons and if you like snow, then the weather will be perfect for you.",
            "Author": "Recent Alumnus",
            "Date": "2014-05-27T14:07:42Z"
        },
        {
            "Rating": 5,
            "Review": "Cambridge and Boston are vibrant college areas, with tons of students. That being the case, there are always parties everywhere. If you're not a partier, there's plenty of stuff to do around Boston, especially museums and things related to American History (e.g. the Freedom Trail). Aside from that, the Boston area is extremely diverse and you will find food and cultural events of all kinds. I've lived in Boston essentially all my life and I feel that people are very used to all the students around the city.",
            "Author": "Recent Alumnus",
            "Date": "2014-05-27T13:55:47Z"
        },
        {
            "Rating": 3,
            "Review": "Shuttle system is hopelessly unreliable and inconvenient.",
            "Author": "College Freshman",
            "Date": "2014-05-02T19:40:10Z"
        },
        {
            "Rating": 4,
            "Review": "Cambridge, MA is a charming college town in a great area.",
            "Author": "College Freshman",
            "Date": "2014-05-02T19:36:27Z"
        },
        {
            "Rating": 4,
            "Review": "Free shuttles, fairly priced trains and easy access to zip cars.",
            "Author": "College Freshman",
            "Date": "2014-03-26T01:18:35Z"
        },
        {
            "Rating": 3,
            "Review": "I don't know. I don't own a car",
            "Author": "College Freshman",
            "Date": "2014-03-26T01:01:47Z"
        },
        {
            "Rating": 3,
            "Review": "Boston, take it as you will.",
            "Author": "College Freshman",
            "Date": "2014-02-21T18:45:35Z"
        },
        {
            "Rating": 4,
            "Review": "The atmosphere is great. Everyone is so smart and has something to contribute.",
            "Author": "College Freshman",
            "Date": "2014-01-21T18:33:06Z"
        },
        {
            "Rating": 4,
            "Review": "It's MIT... The technology is good.",
            "Author": "College Freshman",
            "Date": "2014-01-21T18:27:01Z"
        },
        {
            "Rating": 4,
            "Review": "It's better at night than during the day.",
            "Author": "College Freshman",
            "Date": "2014-01-21T18:23:57Z"
        },
        {
            "Rating": 4,
            "Review": "The athletic center is very new and updated. The student center can use updates but does include many different fast food places. The libraries are very nice and updated with much study space.",
            "Author": "College Freshman",
            "Date": "2014-01-08T15:45:14Z"
        },
        {
            "Rating": 5,
            "Review": "By far, MIT is a rare place in the world. It is extremely diverse and accepts all type of people. It's academic program is extremely rigorous and gives you an academic background that is unlike any other university in the fields of engineering and science. MIT also has a lively social scene that many students participate in.",
            "Author": "College Freshman",
            "Date": "2014-01-08T15:45:14Z"
        },
        {
            "Rating": 4,
            "Review": "Most students have their own laptop but if a student cannot purchase his or her own MIT will help cover the cost. There are also many labs and computers in almost every dorm and most buildings.",
            "Author": "College Freshman",
            "Date": "2014-01-08T13:37:02Z"
        },
        {
            "Rating": 3,
            "Review": "MIT provides shuttles to all the Boston frats and sororities as well as the Cambridge dormitories.",
            "Author": "College Freshman",
            "Date": "2014-01-08T13:34:45Z"
        },
        {
            "Rating": 3,
            "Review": "While MIT's campus is not the prettiest to look it, it's facilities are generally very convenient and everyone is very friendly.  There's always something going on, and it's always a lot of fun.  The meal plan is a little weird, but it's designed to profit the people selling us food, so there's not much we can do about it.",
            "Author": "College Freshman",
            "Date": "2014-01-06T22:56:28Z"
        },
        {
            "Rating": 5,
            "Review": "MIT is weird.  I don't mean that in a bad way, but it's definitely the first word that comes to mind when describing my school.  I love it, and I love the people.  I feel completely at home at MIT.  It's well known for the hacks that happen around campus, and for pushing a very strong dorm-oriented culture.",
            "Author": "College Freshman",
            "Date": "2014-01-06T22:56:28Z"
        },
        {
            "Rating": 4,
            "Review": "I don't use them much, but when I do, it's great",
            "Author": "College Freshman",
            "Date": "2013-12-31T01:05:28Z"
        },
        {
            "Rating": 2,
            "Review": "New England, what can I say",
            "Author": "College Freshman",
            "Date": "2013-12-31T01:04:49Z"
        },
        {
            "Rating": 5,
            "Review": "Boston is a great city, it's not horribly big and you can walk around and have fun.",
            "Author": "College Freshman",
            "Date": "2013-12-27T12:32:23Z"
        },
        {
            "Rating": 5,
            "Review": "They have a whole bunch of shuttles that will take you where you need to go.",
            "Author": "College Freshman",
            "Date": "2013-12-27T12:30:11Z"
        },
        {
            "Rating": 5,
            "Review": "Facilities are good. The school has a lot of money.",
            "Author": "College Freshman",
            "Date": "2013-12-27T12:29:30Z"
        },
        {
            "Rating": 5,
            "Review": "You can't find the people anywhere else. People are really smart.",
            "Author": "College Freshman",
            "Date": "2013-12-27T12:29:30Z"
        },
        {
            "Rating": 5,
            "Review": "Since it's so academically rigorous, it sets you up to do very well when you graduate.  Many of the professors are world-renowned and very interesting.  There are many opportunities to do paid research at the undergraduate level.  And those who want a more active social life will have many opportunities.",
            "Author": "College Sophomore",
            "Date": "2013-12-10T22:04:09Z"
        },
        {
            "Rating": 4,
            "Review": "The athletic center is great, the student center is okay.  The location is fantastic and there's plenty to do.  Some of the buildings are beautiful and others are ugly.  It's not the prettiest campus, but being on the Charles River is great and being in Cambridge is even better.",
            "Author": "College Sophomore",
            "Date": "2013-12-10T22:04:09Z"
        },
        {
            "Rating": 5,
            "Review": "With a mobile app that tells you all the times the bus will be there by, the transportation shuttles are easy to use",
            "Author": "College Freshman",
            "Date": "2013-11-24T19:24:02Z"
        },
        {
            "Rating": 2,
            "Review": "The weather is awful and makes everyone depressed. Nobody comes to Boston for the weather.",
            "Author": "College Sophomore",
            "Date": "2013-11-12T15:41:51Z"
        },
        {
            "Rating": 4,
            "Review": "We have MIT shuttles which run during the day through campus and across the river to the Boston-based living groups, and nighttime shuttles which run until 2am across the river and through Cambridge. The subway stop is on the other side of campus from most dorms, but it's still at most a 20 minute walk away, and the bus system is really easy and convenient to use as well.",
            "Author": "College Sophomore",
            "Date": "2013-11-12T15:38:13Z"
        },
        {
            "Rating": 5,
            "Review": "You don't need a computer, but it helps. Athena clusters (rooms full of desktop computers) are everywhere and printing is free, but having your own laptop is more convenient so you don't have to always be working in a cluster.",
            "Author": "College Sophomore",
            "Date": "2013-11-12T15:36:31Z"
        },
        {
            "Rating": 3,
            "Review": "Weather is pretty unpredictable, so you need to pay close attention to weather forecasts to avoid getting rained on. The winter is long and snow is heavy. However, as long as you have all the winter garbs wintering in MIT is not as bad as it might look, as the facilities do pretty good job of clearing snow, and most of MIT main campus buildings are connected to each other.",
            "Author": "Recent Alumnus",
            "Date": "2013-06-30T17:59:31.703Z"
        },
        {
            "Rating": 4,
            "Review": "Cambridge's pretty safe and student-friendly neighborhood. \r\nIt is also pretty easy to get to interesting places as well. Boston is a city where you can actually get around without a car, if you are familiar with the local transit. MIT students frequent Back Bay just across the river and Central Square&Harvard Square to the North as well.",
            "Author": "Recent Alumnus",
            "Date": "2013-06-30T17:47:57.423Z"
        },
        {
            "Rating": 5,
            "Review": "Because MIT is between Cambridge and Boston right off the Harvard Bridge, you get a taste of the city life and it's great. There's always something going on and it makes college life exciting. There are tons of places to go to from restaurants, museums, stores, and general attractions. The city is generally pretty safe but always be smart about when you go out, especially if you're alone.",
            "Author": "College Sophomore",
            "Date": "2013-06-10T14:13:51.35Z"
        },
        {
            "Rating": 5,
            "Review": "Amazing university transportation system that merges seamlessly with an excellent city system.  Its one of the things I love the most about Boston.",
            "Author": "College Sophomore",
            "Date": "2013-06-09T09:46:44.677Z"
        },
        {
            "Rating": 4,
            "Review": "MIT has tons of computers available everywhere. There's also unlimited printing for undergraduates.",
            "Author": "College Freshman",
            "Date": "2013-05-15T13:37:44.53Z"
        },
        {
            "Rating": 4,
            "Review": "There are many computer labs, called Athena clusters, that are easily accessible throughout campus. The only setback is that most of these Athena clusters don't have color printers. Other than that, most software is already installed on these computers, and they are very useful.",
            "Author": "College Freshman",
            "Date": "2013-03-10T16:20:10.89Z"
        },
        {
            "Rating": 1,
            "Review": "It's a pretty small campus so not much need for a car at all really.  Permits are expensive and there are very few parking lots.  Having a car might not get you any closer to classes than you would be if you just walked from your dorm.",
            "Author": "College Junior",
            "Date": "2013-03-10T09:35:52.687Z"
        },
        {
            "Rating": 5,
            "Review": "Unlimited Internet access and printing.  Top notch network and speed and computer labs (called Athena Clusters) are all over campus.\r\n\r\nWireless is great and accessible all over campus, both indoors or outdoors.",
            "Author": "College Junior",
            "Date": "2013-03-10T09:27:13.823Z"
        },
        {
            "Rating": 4,
            "Review": "The main transportation is Bicycling. There are several bike racks around campus that allow for secure parking. It's a convenient way to get around.",
            "Author": "College Freshman",
            "Date": "2013-01-29T20:00:26.21Z"
        },
        {
            "Rating": 1,
            "Review": "There is only parking available on the street, or in paid parking garages.",
            "Author": "College Sophomore",
            "Date": "2013-01-27T14:25:33.23Z"
        },
        {
            "Rating": 5,
            "Review": "There are multitudes of labs on campus, including an aeronautics lab with a wind tunnel, a nuclear research lab with a functional fission reactor, and a material science lab working with experimental liquid metal batteries just to name some of the research facilities; if you want to research it, it's here. Also, as a student athlete, I can say the athletic facilities are also state of the art with the new Zesiger fitness center being featured as one of the best/most comprehensive in the country. Their is on campus medical, post office, optical, and shopping, just to name a few services.",
            "Author": "College Freshman",
            "Date": "2013-01-19T21:53:43.543Z"
        },
        {
            "Rating": 1,
            "Review": "You really don't need a car on campus. Parking spaces are limited, and it's much more convenient to walk and take public transportation.",
            "Author": "College Freshman",
            "Date": "2013-01-14T14:18:04.023Z"
        },
        {
            "Rating": 3,
            "Review": "It seems like everyone warned me about the weather before I came here, but it hasn't been as bad as I expected. It's usually pretty pleasant, if a little on the cold side.",
            "Author": "College Freshman",
            "Date": "2013-01-14T14:14:49.753Z"
        },
        {
            "Rating": 4,
            "Review": "I actually thought the Boston weather would be worse than it was. It's cold, certainly, but not too cold. The sun is shining frequently enough (which basically counteracts the cold most of the time), and the morning chill is quite brisk and helps to wake you up. The wind-tunnel areas are fun, too.",
            "Author": "College Freshman",
            "Date": "2012-12-27T02:14:30.427Z"
        },
        {
            "Rating": 2,
            "Review": "It's really cold here. It's really humid when you arrive in the summer and impossible to not be sweaty but then it freezes around the middle of October and snows a lot.",
            "Author": "College Freshman",
            "Date": "2012-11-29T14:41:15.333Z"
        },
        {
            "Rating": 4,
            "Review": "Easy to Drive Around, Decent Public Transit Access – MIT is right by Mass ave. and it has a few parking lots and garages. It also has a zipcar location so students could rent them. \r\nThere's also access to bus and T which is nice, though I should note that the T station is on the east side of campus and is away from most of the dorms.\r\nMIT runs shuttles around campus, and they have daytime shuttles and \"saferides\" at night to Boston area.",
            "Author": "Recent Alumnus",
            "Date": "2012-09-12T09:29:16.11Z"
        },
        {
            "Rating": 5,
            "Review": "T and Saferide Rock – Still haven't been to an area with better public transit and MIT provides awesome buses that drive around the centers of social life and living.",
            "Author": "College Sophomore",
            "Date": "2012-08-25T18:42:21.29Z"
        },
        {
            "Rating": 4,
            "Review": "Cold and Rainy – Classes don't get canceled due to weather (unless very extreme), but Boston's weather is pretty cold and takes getting used to. I for one like it",
            "Author": "College Sophomore",
            "Date": "2012-08-20T09:55:19.653Z"
        },
        {
            "Rating": 3,
            "Review": "free shuttle gets you anywhere at fairly convenient times, and a shuttle goes into boston until 2am for late-night pizza, froyo, or early-night Greek life. taxis, solid subway system, and zipcars.",
            "Author": "College Sophomore",
            "Date": "2012-08-14T00:00:56.033Z"
        },
        {
            "Rating": 5,
            "Review": "5 wireless networks with access everywhere, amazing IT help, and half the students are computer experts anyway.",
            "Author": "College Sophomore",
            "Date": "2012-08-13T21:46:31.003Z"
        },
        {
            "Rating": 1,
            "Review": "No One Really Has a Car – A car is not really necessary at MIT. The T, the main mode of transportation, is very convenient, whether in bus or subway form.  There is a T subway stop  right next to campus and the buses run through the middle of campus.  You can cheaply and easily get to pretty  much anywhere you would like to go in Cambridge or Boston via the T.  There is some minimal parking on campus and the Greek houses, but it really is not necessary.",
            "Author": "College Junior",
            "Date": "2012-08-01T06:35:01.023Z"
        },
        {
            "Rating": 4,
            "Review": "Computer Use Improving – The computer use at MIT is greatly improving.  There are computer labs and printers conveniently sprinkled throughout campus and also in the dorms.  Sometimes they can get pretty crowded, but for the most part you can find an open spot.  A new printing system was recently implemented by which you can send documents to print and then swipe your ID card at pretty much any printer on campus and have your document print there.  Issues with running out of paper and ink used to plague printer use, but there have been great improvements recently.",
            "Author": "College Junior",
            "Date": "2012-08-01T06:16:20.27Z"
        },
        {
            "Rating": 4,
            "Review": "MIT is an amazing campus. While I've noticed while walking along the Charles River or down dorm row how architecturally outstanding the place is, it's the people that make it so wonderful. Also, Boston is full of exciting sites and attractions to visit - including Prudential, North End (Mike's Pastry!) and more.",
            "Author": "College Sophomore",
            "Date": "2012-07-18T17:34:51.903Z"
        },
        {
            "Rating": 3,
            "Review": "There is no freshman parking. Some living groups have there own parking but since the school is in Boston there is no convient free parking.",
            "Author": "College Sophomore",
            "Date": "2012-07-15T23:31:45.897Z"
        },
        {
            "Rating": 4,
            "Review": "We Are a Community – Here at MIT, people work very hard. There is always an intense sort of energy here that gets people going every morning to work their hardest. However, there are such wonderful spots to relax and take a break whether it is on campus or off-campus in Boston near the Boston Commons or even farther into Cambridge or by the Charles River. The MIT bubble can be intense and a bit intimidating, but everyone here is always welcoming and willing to help a fellow student out.",
            "Author": "College Sophomore",
            "Date": "2012-07-10T13:30:50.347Z"
        },
        {
            "Rating": 5,
            "Review": "Unparalleled Flexibility in Academics – MIT truly believes that learning comes directly from the student. We have such flexibility that you can take up to 6 years to finish a degree, you can take a gap year, or you can even take years off in between to pursue a startup career or train for sports teams. Also, the academic programs are amazing. You have complete flexibility when to take classes and you can either do your lectures online or go to the lecture hall to listen to the professors. Every professor and teacher's assistant have office hours and there are tutoring services everywhere. MIT is a great place to explore your independence while still getting a stellar education.",
            "Author": "College Sophomore",
            "Date": "2012-07-10T13:22:30.073Z"
        },
        {
            "Rating": 4,
            "Review": "Overwhelmed With Awesomeness – MIT is sandwiched between the Charles River and Harvard University in Cambridge which buttresses right along Boston. Essentially, all you have to do to go into Boston to eat at a fancy restaurant, go shopping, watch a play or performance, or go see a Red Sox game is cross the Harvard Bridge which is only about a 5 minute walk across from the dorms. There are always a multitude of activities on campus like making ice cream from liquid nitrogen and study breaks that range from \"laughing yoga\" to ultimate frisbee. Our sports center is only 3 years old and one of the largest facilities for any university. And our auditoriums have hosted multiples of famous guests and speakers.",
            "Author": "College Sophomore",
            "Date": "2012-07-10T13:00:33.25Z"
        },
        {
            "Rating": 4,
            "Review": "Athena Linux Based System – we use an Athena system.  super easy access with tons of printers but sometimes they get jammed and the computers are old and slow.",
            "Author": "College Sophomore",
            "Date": "2012-07-10T11:28:44.62Z"
        },
        {
            "Rating": 5,
            "Review": "Great Convenience Store – The Zesiger Center is very clean and efficient. The Student Center offers a variety of food options and student services. La Verdes--school store-- is open late, and has all that you could ever need.",
            "Author": "College Junior",
            "Date": "2012-06-01T15:44:39.36Z"
        },
        {
            "Rating": 5,
            "Review": "Tech Shuttle Is Always on Time – The Tech Shuttle is the best way to get around MIT's huge campus on cold and rainy days, or when you just don't feel like walking for 20 minutes. You can track it right from your phone, and it is very reliable.",
            "Author": "College Junior",
            "Date": "2012-06-01T15:39:41.857Z"
        },
        {
            "Rating": 5,
            "Review": "Athena Clusters Are Fantastic. Campus computing is widespread and convenient. Some of the clusters are nearly always busy (Building 12, Building 56) but unless you absolutely have to use a computer in one of those buildings you'll usually find plenty of open workstations. Printing quotas aren't a problem, and the Pharos system is great--just hit print, and then swipe your id card at any printer on campus and your print job pops out.",
            "Author": "College Freshman",
            "Date": "2012-02-11T14:56:49.617Z"
        },
        {
            "Rating": 4,
            "Review": "MIT is different in many ways. For one thing, it's very nerdy. I would say the attitude is very work hard, play hard. People place their academics first and it's understood if you have to stay in on the weekend to study. All nighters are not uncommon... However, it's surprisingly social! There are plenty of awkward people but there's also a decent greek community. We also have a great undergraduate research program where students can work in labs and get experience in the field they're studying- it's pretty cool. Academically, things are pretty flexible. You're given a set of requirements but can choose to take classes whenever, so some classes will have students from all years.",
            "Author": "College Junior",
            "Date": "2012-02-03T16:52:45.457Z"
        },
        {
            "Rating": 2,
            "Review": "WTF Boston – The weather in Boston is ridiculous. It'll go from 40 degrees one day to 60 the next. Thankfully, most of the buildings are connected via a tunnel system so even on rainy/ snowy days it's easy to get to class without too much hassle. We rarely get snow days, which is tough.",
            "Author": "College Junior",
            "Date": "2012-02-03T16:49:24.313Z"
        },
        {
            "Rating": 5,
            "Review": "OMG, Boston! If you've lived in Boston, you probably know how beautiful a giant river looks when it's frozen over. To those of you who don't, it is spectacular. The campus is great too. Lots of old, techie buildings, tunnels that go under all the buildings on campus, giant ridiculous-but-fun statues, and the Big Dome. The campus is also really safe with a fantastic (and really nice!) police force. There's a mall and Newbury Street a bus ride away, tons of food just off the campus grounds, and of course everything in Downtown Boston (China Town, The North End (Italian), Faneuil Hall, etc.).",
            "Author": "College Senior",
            "Date": "2012-01-29T16:44:59.367Z"
        },
        {
            "Rating": 4,
            "Review": "MIT is a beautiful mixture of historical and modern aesthetics.  With an enormous and top-of-the-line athletic center, MIT Z center has a beautiful pool and athletic facility.  The student center is designed for the rigorous and long hours of a typical MIT student. Libraries are comfortable and convenient.",
            "Author": "College Junior",
            "Date": "2012-01-25T20:28:33.42Z"
        },
        {
            "Rating": 2,
            "Review": "I Mean... You're in Boston – It's Boston. You didn't choose to go to University of Miami. It's cold. It's wet. The sun doesn't shine too often. It snows. I love Boston, but I didn't come here expecting to sunbathe...",
            "Author": "College Sophomore",
            "Date": "2012-01-20T22:43:26.263Z"
        },
        {
            "Rating": 5,
            "Review": "Easy to Go Anywhere in Boston/Cambridge – Between the MBTA (\"The T\" aka Boston's subway system), the 1 bus, MIT's saferide and Boston Daytime, it's always easy to get anywhere on or off campus.",
            "Author": "College Sophomore",
            "Date": "2012-01-20T22:42:00.107Z"
        },
        {
            "Rating": 5,
            "Review": "Best of the Best – We have \"athena clusters\" --essentially large computer labs -- all over campus.  Printing is free for up to ~2000 pages per semester, and no one ever goes over that.",
            "Author": "College Sophomore",
            "Date": "2012-01-20T22:35:53.8Z"
        },
        {
            "Rating": 4,
            "Review": "Boston definitely has seasons, but the weather is generally pretty mild. The temperature rarely drops below 15 degrees in the winter and above 90 in the summer. One could always wish for more sunshine though. :)",
            "Author": "College Sophomore",
            "Date": "2012-01-20T13:17:00.163Z"
        },
        {
            "Rating": 4,
            "Review": "Living Group Culture – This is by no means a rule, but dorm/living group culture is pretty strong here. Based on MIT's housing rules, one could live in the same dorm, within the same wing, all 4 years. And some people actually do so because they form a tight group of friends in their dorm. In addition, those in Greek life (about 40% of MIT), often move to their Greek houses. Each dorm or living group tends to have a \"culture,\" and even wings within dorms have very distinct personalities. In many ways, the dorm you choose to live in shapes your identity and how your peers view you.",
            "Author": "College Junior",
            "Date": "2012-01-19T23:53:44.67Z"
        },
        {
            "Rating": 2,
            "Review": "Very Cold – The weather gets pretty bad in the winter and it can become extremely cold.",
            "Author": "College Junior",
            "Date": "2012-01-19T16:04:21.843Z"
        },
        {
            "Rating": 4,
            "Review": "Lots of Good Options – MIT provides a shuttle to the fraternity and sorority houses for free. There is also a T line nearby which is very convenient.",
            "Author": "College Junior",
            "Date": "2012-01-19T16:03:40.19Z"
        },
        {
            "Rating": 5,
            "Review": "MIT has a nickname for everything.  These things are (mostly) all good!\r\n\r\nIAP: aka \"J-Term\" aka Independent Activities Period.  A month in which MIT drops their classes and you either get a) an extra month of vacation, b) an opportunity to do an additional internship during the year, c) time to focus on your research, d) time to go to Charm School and get your PhD in Charm!, e) a chance to take classes like the Chocolate Lab's truffle class, or DAPER's \"Head of the Zieger\"...\r\n\r\nUROP: Undergraduate Research Opportunities Program.  MIT has a lot of grad students, and undergrads can capitalize on their research, mentorship, and general awesomeness by doing research with them.  Many students have several publications before they graduate because of this....",
            "Author": "College Junior",
            "Date": "2012-01-19T10:51:07.007Z"
        },
        {
            "Rating": 4,
            "Review": "100% Possible to Get Around – MIT runs several campus shuttles that get you from everywhere important (your dorm, your sorority/fraternity, your classes) to everywhere else important (your friend's dorm, your study group, the subway, Boston, etc.).  They run all day and until 2am (4am on Fridays and Saturdays).  Most of the drivers are nice, and the GPS-tracking is *usually* working.\r\n\r\nMIT is right on the Red Line (subway) and the number 1 bus.  These provide easy access to the rest of the city.  This review gives an A- because the Boston Transport system shuts down at 12:35am everyday.",
            "Author": "College Junior",
            "Date": "2012-01-19T10:39:40.833Z"
        },
        {
            "Rating": 3,
            "Review": "No One Drives – so no one parks... I know 3 people with cars. Because you don't need one, it's like inconvinent to have one. Parking on campus is hard. Parking around campus is not.",
            "Author": "College Sophomore",
            "Date": "2012-01-19T09:17:29.503Z"
        },
        {
            "Rating": 5,
            "Review": "It has pretty good athletics facilities and libraries. These resources are constantly used by students. The student center has a central location and it has all basic things you need as a student: computers, printers, study rooms, lounges, conference rooms, food vendors, etc. In general the campus provides a good environment and is currently under some nice aesthetics renovations. There are a lot of campus activities, many of them run by students themselves.",
            "Author": "College Freshman",
            "Date": "2012-01-19T01:49:02.333Z"
        },
        {
            "Rating": 4,
            "Review": "So Much to Do, So Little Time – Everything around MIT is really awesome. There are a lot of restaurants, shopping areas and movie theaters in boston and cambridge. The only problem is that there isn't a lot of time to go out and explore those things. With all the work that MIT hands us, it's hard to make time to go out a lot. Maybe I'm just not making it a priority, though. I feel like all of the great places around MIT are really interesting, and I wish I could get out and see them more often.",
            "Author": "College Sophomore",
            "Date": "2012-01-19T00:53:15.767Z"
        },
        {
            "Rating": 4,
            "Review": "Intense All the Way – MIT is known for being a rigorous school. That certainly is true. Academics can be extremely tough if you don't balance yourself, but help is always available if you're willing to go look for it. The social scence can get pretty intense, if you're that type of person. Also, make sure to look for a UROP, which is basically a program that lets undergrads do research. MIT has so much to offer and I'm only just beginning to scratch the surface of it all!",
            "Author": "College Freshman",
            "Date": "2012-01-18T23:07:37.663Z"
        },
        {
            "Rating": 3,
            "Review": "The Boston-Cambridge area has one of the best integrated transportation systems anywhere in the country. It is easy and relatively inexpensive to utilize the subways and busses that make up the T system, and there are also many cabs and other busses that one can take to get anywhere off of the main route that the T takes. Most things that one needs can be found within walking distance of a T station, although in winter a couple blocks might still seem like a trip to the North Pole and back. The biggest issue with transport in the area is if you might want to take a car with you to school. For the most part this will turn out to be completely unnecessary as most students will inform you. Parking can be expensive and hard to find and the roads can be difficult and confusing. If you don't plan on taking a car to school, there is no need to worry about transportation. If you do plan on taking a car, forget it and you'll have one less thing to worry about.",
            "Author": "College Freshman",
            "Date": "2011-12-30T00:52:41.177Z"
        },
        {
            "Rating": 4,
            "Review": "I Hate Athena – It's all Linux based which is super obnoxious, but there's a lot of computers available.",
            "Author": "College Sophomore",
            "Date": "2011-12-27T17:57:44.907Z"
        },
        {
            "Rating": 3,
            "Review": "Usually State of the Art – MIT facilities tend to be well kept and also are very state of the art.  The athletics center was recently re-done and is very nice now, with multiple floors and a bay opening up to view the pool while working on cardio or weights.  The libraries are incredible (smaller ones all over, so you can study wherever).",
            "Author": "College Sophomore",
            "Date": "2011-11-07T22:11:00.963Z"
        },
        {
            "Rating": 4,
            "Review": "Plethora of Ways to Travel – There are ways to get anywhere in the Boston area free or cheaply with the shuttle services offered and the T system. Ride sharing or zip car is necessary to get too far beyond the limits of the city.",
            "Author": "College Freshman",
            "Date": "2011-09-25T14:54:11.85Z"
        },
        {
            "Rating": 3,
            "Review": "Saferide Is Helpful Sometimes, the T Is Good to Get Anywhere, Otherwise Ride Your Bike – Depending where you live on campus, the campus shuttles can be useful. Students in some of the farther dorms on the west side of campus use them to get to classes, but because I lived on the east side I only ever used them to go across the river to Boston. When it's cold out or you're feeling lazy, a free ride over the Harvard bridge is really nice, and sometimes you can stay on the bus for a while longer, depending on your destination. For anyone traveling between the Boston fraternities and the campus, it's a godsend in winter.\r\n\r\nThe MBTA system of buses and subway trains is good for getting most places in Cambridge, Boston and all of its suburbs, and only costs $1.70 a ride, but for destinations close to MIT often biking is faster.",
            "Author": "College Senior",
            "Date": "2011-08-30T19:08:27.51Z"
        },
        {
            "Rating": 5,
            "Review": "Cambridge to Boston to Anywhere! Massachusetts Institute of Technology (MIT) is not only considered a great research university where students from barely-adult freshman to aged and wise post-doctorates get to rub shoulders with Nobel Laureates but it is also an amazing place to live. Just a walk across the Harvard Bridge to Boston, our location is the perfect hub to enjoy the fast life of Boston as well as take the collegiate route by enjoying MIT-living and launching an occasional \"hack\" on Harvard. With over 30 colleges around the area, there is no dearth of students around the atmosphere is electric with intellectual and physical energy. People of all ages run, work out, go sailing, or row crew in the area. The night life is impeccable and every TV screen in taverns are hooked on some New England sports channel. Even in the coldest of winters is there a shining light that \"Yes, Cambridge is indeed a magical place to live.\"",
            "Author": "College Freshman",
            "Date": "2011-08-15T11:37:35.69Z"
        },
        {
            "Rating": 2,
            "Review": "Not Great – I don't drive, but i know very few people who do, unless they live in greek housing with its own parking, because parking is in short supply and very expensive in Boston in general.\r\nBut you don't need a car on campus, because bus and subway system is so great, plus most places students want to go to are in walking distance.",
            "Author": "College Junior",
            "Date": "2011-03-25T15:49:01.583Z"
        },
        {
            "Rating": 5,
            "Review": "Instant Credibility in the Working World – If you are able to graduate from MIT, you will be able to succeed anywhere, have an infinite global connection of friends and alumni worldwide, and gain instant credibility with your degree.\r\n\r\nAdditionally, MIT offers research experience for students without prior work experience, thus setting students apart in searching for internships.  For example, I was able to secure a freshman year research opportunity just by applying through an online listing.  My Rubbermaid-sponsored work for the MIT Media Lab was also highly fascinating.\r\n\r\nFinally, MIT's Boston location is unparalleled.  It's the largest college town in the world, highly educated and affluent, and a jogger's paradise.  Recruiters constantly came to MIT, and I always felt I had a finger on the pulse of what's going on in society while having a sanctuary between NY and DC to make lifelong friends (many of whom I've now imported to California!).",
            "Author": "Recent Alumnus",
            "Date": "2010-12-24T02:07:17.447Z"
        },
        {
            "Rating": 4,
            "Review": "I think the title says it all\r\nYou're in the northeast\r\nbe realistic.",
            "Author": "College Sophomore",
            "Date": "2010-12-18T19:37:14.73Z"
        },
        {
            "Rating": 4,
            "Review": "You don't really need transportation to get around campus, it's pretty small. There is a shuttle that goes to the far reaches, but I never take it because it's really not that far. \r\n\r\nThere are night shuttles around the city. It's cool, they come pretty frequently and you can call a number for ETA or to find out where the stop is, but the number isn't reliable and I've had trouble finding my way back to the stop.\r\n\r\nLuckily, public transportation in Boston is pretty good, except that it stops running late at night. But you can get nearly anywhere with public transit. MIT offers passes, but you have to buy a month's pass a month in advance, which is super inconvenient. You often don't know you need it until it's too late.",
            "Author": "College Senior",
            "Date": "2010-12-10T11:11:33.353Z"
        },
        {
            "Rating": 3,
            "Review": "There's Something Outside of Lab? MIT could do a lot better to give back to its community. Central Square, just down the street, is a poor and undeveloped area, but it could be thriving like Harvard square is. Harvard square is nearby, and it's cute, and Boston has a lot of nice places to go, but it would be nice to be located in one.\r\nKendal is growing,though, and there are some restaurants tucked in there. So is the Mass ave area between central and MIT, several places have opened while I've been here.\r\n\r\nBoston in general is pretty great, if you ever manage to get yourself off campus. Unfortunately, being at MIT leaves you with little time to do that. On campus, though, food choices are highly limited.",
            "Author": "College Senior",
            "Date": "2010-12-10T11:04:39.227Z"
        },
        {
            "Rating": 5,
            "Review": "athena clusters all over the place.\r\nprinters everywhere.\r\nmit n wireless network is super fast and everywhere.\r\ni know of people that don't have a computer, but i think that would be tough.  also i know there is a program where mit students can borrow/rent out a laptop for weeks at a time..\r\nsome of the printers aren't 100% reliable (especially dorm printers), but it's not hard to just print to one in the infinite through quickprint.mit.edu, which is easy to do",
            "Author": "College Sophomore",
            "Date": "2010-10-22T04:32:59.743Z"
        },
        {
            "Rating": 4,
            "Review": "What You Have Is Awesome... Now Multiply It by 10 – it's nice, especially when the weather is good, but i wish there were more \"reading room\"-esque lounge places in the infinite, like in or near an athena cluster",
            "Author": "College Sophomore",
            "Date": "2010-10-22T04:28:23.397Z"
        },
        {
            "Rating": 3,
            "Review": "there is usually lots and lots of snow during the winter, which gets tough when you are walking to class from your dorm",
            "Author": "College Sophomore",
            "Date": "2010-10-04T14:36:16.187Z"
        },
        {
            "Rating": 3,
            "Review": "there is almost no parking available on campus, only a few garages and metered spots (which are always full). but this isn't an issue for most students because, instead of having a car, we usually walk, use the school shuttles, or ride a bike.",
            "Author": "College Sophomore",
            "Date": "2010-10-04T14:34:56.113Z"
        },
        {
            "Rating": 5,
            "Review": "Everything You Need. There are plenty of computers all over the campus. There are also lots of places to print and everything you need computer-wise. I mean, we are a tech school.",
            "Author": "College Sophomore",
            "Date": "2010-07-25T17:58:19.523Z"
        },
        {
            "Rating": 4,
            "Review": "MIT gives all of its student the chance to get a UROP (Undergraduate Research Opportunity Program) where the students will get hands on experience in a lab for either credit or pay.  It is a great resource that many take advantage of to learn what they like and what they don't like.",
            "Author": "College Sophomore",
            "Date": "2010-07-21T15:59:23.873Z"
        },
        {
            "Rating": 3,
            "Review": "Free Transporation – We have a great bus service around campus and off campus to many sororities and fraternities and also in Boston.  They are very helpful getting to frat houses and getting to class, especially when the weather isn't very nice.  The public transportation is also very good when trying to get into and around Boston and Cambridge.",
            "Author": "College Sophomore",
            "Date": "2010-07-21T15:54:41.457Z"
        },
        {
            "Rating": 4,
            "Review": "The main athletic center (dubbed the Z-Center) is modern and well-equipped, and there are a number of other gyms as well. The student center has everything you need - ATMs, convenience store, food, study rooms, and a whole host of other rooms perfect for meetings. The campus isn't known for being beautiful, though, and things tend to have a more stark, modernistic look.",
            "Author": "College Freshman",
            "Date": "2010-05-29T19:50:29.067Z"
        },
        {
            "Rating": 5,
            "Review": "Research Opportunities – You can get any kind of research position you want as an undergrad. 80% of students have a research job at some point in their 4 years here; you can try a new field completely or go for something in a field you are majoring in. Professors are very approachable about research opportunities.",
            "Author": "College Freshman",
            "Date": "2010-05-11T18:17:50.56Z"
        },
        {
            "Rating": 5,
            "Review": "Life it self is not surrounded in the bounds of a book , it is not surfaced on a page and the end of a pencil , it surpasses the boundaries of the brain to a land lost in time . Everyone doesn't seek for self benefit , though that is the purpose of a greater education , everyone aids in another life. Everyone gives . They know the true meaning of \"it is better to give then to receive \", that inst a problem in MIT .",
            "Author": "College Junior",
            "Date": "2010-04-10T11:11:37.93Z"
        },
        {
            "Rating": 3,
            "Review": "It Can Be Dealt With – There are underground tunnels connecting most of the main buildings. That being said, weather is fairly unpredictable. It can be hot one day, and cold the next, bright and sunny, then snowing 3 feet. It can be dealt with though. Shuttles are also very helpful during rainy and snowy days.",
            "Author": "Recent Alumnus",
            "Date": "2010-04-08T15:52:39.097Z"
        },
        {
            "Rating": 1,
            "Review": "There are almost no parking spaces, and to get those that do exist, you need to obtain a very expensive yearly parking permit. In fact, MIT subsidizing people NOT getting parking permits by offering discounted monthly T-passes for example.",
            "Author": "College Sophomore",
            "Date": "2010-03-27T14:20:45.07Z"
        },
        {
            "Rating": 5,
            "Review": "This School – this school is great. they really help you out alot.",
            "Author": "College Junior",
            "Date": "2010-03-05T16:30:48.387Z"
        }
    ],
    "Value": [
        {
            "Rating": 5,
            "Review": "Getting a degree from this school means a lot and can really influence and help career prospect after graduation.",
            "Author": "College Sophomore",
            "Date": "2016-08-03T17:15:51Z"
        },
        {
            "Rating": 5,
            "Review": "The quality of employers recruiting on campus is high",
            "Author": "College Freshman",
            "Date": "2016-07-19T20:18:42Z"
        },
        {
            "Rating": 5,
            "Review": "MIT really prepares the student for their career.  A manifold of opportunities to explore areas of interest, with a definite push to get a job.",
            "Author": "College Sophomore",
            "Date": "2016-07-10T19:52:43Z"
        },
        {
            "Rating": 5,
            "Review": "Everyone knows MIT really whips you into shape. Nothing is guaranteed. It is up to you to decide the type of life you'll lead after school, but MIT gives you the tools necessary to be successful and get hired.",
            "Author": "College Junior",
            "Date": "2016-06-17T05:04:55Z"
        },
        {
            "Rating": 4,
            "Review": "I've had a hard time in my internship search, but the company who did hire me this summer is really impressed with MIT.",
            "Author": "College Junior",
            "Date": "2016-06-06T02:56:41Z"
        },
        {
            "Rating": 5,
            "Review": "MIT is wonderful, it opens a lot of doors that otherwise would remain closed.",
            "Author": "College Sophomore",
            "Date": "2016-06-03T21:58:39Z"
        },
        {
            "Rating": 5,
            "Review": "There are opportunities everywhere, I've gotten job offers just by saying I go to MIT",
            "Author": "College Sophomore",
            "Date": "2016-03-30T00:18:59Z"
        },
        {
            "Rating": 5,
            "Review": "I hear that getting a job is promising, and I know dozens of people who have received outstanding internships by their junior and senior years.  MIT is known for the possibilities for their students after graduation, which is one of the reasons I chose the school.  I just know I have to do my part and apply myself and find these opportunities.",
            "Author": "College Freshman",
            "Date": "2016-01-16T13:09:39Z"
        },
        {
            "Rating": 5,
            "Review": "Companies want MIT grads. You will have no problem getting a job.",
            "Author": "College Senior",
            "Date": "2015-12-31T03:11:33Z"
        },
        {
            "Rating": 5,
            "Review": "There are endless ways of getting in touch with professors for UROPs, internship opportunities, etc.",
            "Author": "College Freshman",
            "Date": "2015-12-29T19:42:43Z"
        },
        {
            "Rating": 5,
            "Review": "A lot of Alumni help get students internships and jobs. There are a lot of offices that also facilitate getting an internship or job.",
            "Author": "College Freshman",
            "Date": "2015-12-29T16:56:20Z"
        },
        {
            "Rating": 5,
            "Review": "Companies tend to look at our applications first.",
            "Author": "College Sophomore",
            "Date": "2015-12-29T16:34:34Z"
        },
        {
            "Rating": 5,
            "Review": "Those three letters get you access to virtually any company you want. Just don't mess up.",
            "Author": "College Freshman",
            "Date": "2015-12-24T01:56:11Z"
        },
        {
            "Rating": 5,
            "Review": "It is a need blind admission school. What ever you prove you can't pay, MIT will cover.",
            "Author": "College Sophomore",
            "Date": "2015-06-09T18:18:08Z"
        },
        {
            "Rating": 3,
            "Review": "I feel like the financial aid that the students get could in general be improved in terms of the amount and how it measures up to the true financial situation of the student and their family. I think applying for outside scholarships is one of the best ways to get financial aid, so try not to rely on MIT's financial aid too much.",
            "Author": "College Junior",
            "Date": "2015-05-25T06:53:10Z"
        },
        {
            "Rating": 5,
            "Review": "Career fairs at MIT are the best. SO many tech companies come and most take your resumes on the spot and help you out.",
            "Author": "College Freshman",
            "Date": "2015-01-12T15:27:40Z"
        },
        {
            "Rating": 5,
            "Review": "The requirements and procedures are very clearly laid out and explained.",
            "Author": "College Junior",
            "Date": "2014-09-24T03:18:17Z"
        },
        {
            "Rating": 4,
            "Review": "I received need-based financial aid as necessary, and it was not a problem for me.",
            "Author": "College Senior",
            "Date": "2014-08-14T21:43:56Z"
        },
        {
            "Rating": 5,
            "Review": "There is an incredible network of alumni and an abundance of resources in landing jobs. At career fairs, it is almost as if you walk in and find summer employment. The value of an MIT degree is one that cannot be underlooked.",
            "Author": "College Junior",
            "Date": "2014-08-03T13:04:29Z"
        },
        {
            "Rating": 4,
            "Review": "My only problem is with the amount of aid they give. MIT uses a separate algorithm from the federal one to calculate the amount of aid awarded which sometimes can make it so you get less money than you need. Aside from that, the process went smoothly.",
            "Author": "College Junior",
            "Date": "2014-08-03T12:51:36Z"
        },
        {
            "Rating": 2,
            "Review": "Despite claims that the school provides for all need, it doesn't.",
            "Author": "College Senior",
            "Date": "2014-06-23T21:13:23Z"
        },
        {
            "Rating": 5,
            "Review": "We have need baised financial aid which is great.",
            "Author": "College Freshman",
            "Date": "2014-03-26T01:23:38Z"
        },
        {
            "Rating": 4,
            "Review": "If I have a question, I can ask a financial aid counselor and always count on receiving a helpful response.",
            "Author": "College Sophomore",
            "Date": "2014-01-09T23:55:37Z"
        },
        {
            "Rating": 5,
            "Review": "Though I didn't qualify for any financial aid, MIT gives as much money as any student needs to attend. This includes expenses like travel and a laptop if need be.",
            "Author": "College Freshman",
            "Date": "2014-01-08T15:49:14Z"
        },
        {
            "Rating": 3,
            "Review": "Very expensive school, MIT is",
            "Author": "College Freshman",
            "Date": "2013-12-31T01:06:40Z"
        },
        {
            "Rating": 5,
            "Review": "Meh, money is money and they have a lot of it.",
            "Author": "College Freshman",
            "Date": "2013-12-27T12:31:26Z"
        },
        {
            "Rating": 4,
            "Review": "It's a need based aid. If you get in, they'll work with you and your family to make sure you can afford the education.",
            "Author": "College Freshman",
            "Date": "2013-01-29T20:06:24.953Z"
        },
        {
            "Rating": 4,
            "Review": "Strict but Helpful – They really take into consideration all of your needs and try to help you out as much as possible. However, they have a set system and are not willing to compare their offer with other institutions' offers.",
            "Author": "College Freshman",
            "Date": "2012-01-19T12:02:19.71Z"
        },
        {
            "Rating": 2,
            "Review": "Easy for people with REALLY low income. Hard for middle class to get any scholarships, so most financial aid generally comes from other programs.",
            "Author": "College Sophomore",
            "Date": "2012-01-19T10:12:08.55Z"
        },
        {
            "Rating": 5,
            "Review": "Good and Easy – Most of the people I know receive a good financial aid. I received a great amount of financial aid. It is pretty much organized with most of the forms filled online. You would like to make a personal appointment with a financial aid officer since they are very helpful and will explain everything you need to know.",
            "Author": "College Freshman",
            "Date": "2012-01-19T01:56:21.743Z"
        },
        {
            "Rating": 4,
            "Review": "MIT is not a cheap school but admission is completely need-blind and financial aid is fully need-based. In my opinion, aid falls off a bit sharply at higher income brackets, but the figures given to students are always manageable and more than fair. For most prospective students, dealing with financial aid won't be too much of a hassle and the financial office and programs are quite helpful. If you are considering enrollment at MIT, finances should not be an impassible wall, though it might seem like a steep hill.",
            "Author": "College Freshman",
            "Date": "2011-12-30T01:03:34.913Z"
        },
        {
            "Rating": 5,
            "Review": "MIT doesn't do scholarships, they do need based financial aid. And in my experience, they follow through with their promise to help out should your financial situation change for the worse.",
            "Author": "College Junior",
            "Date": "2011-03-25T15:50:01.86Z"
        }
    ],
    "Food": [
        {
            "Rating": 5,
            "Review": "Cambridge has awesome food and right across the river is Boston, which has even more options. It's pretty much limitless.",
            "Author": "College Sophomore",
            "Date": "2015-06-09T18:26:10Z"
        },
        {
            "Rating": 4,
            "Review": "The food depends on the dining hall, but it is generally really solid. There are also enough options that you won't get bored and feel like you are eating the same thing over and over again.",
            "Author": "College Sophomore",
            "Date": "2015-06-09T18:20:58Z"
        },
        {
            "Rating": 5,
            "Review": "MIT is right in-between Boston and Cambridge so you get a lot of variety in restaurants, plus, they're close by.",
            "Author": "College Junior",
            "Date": "2015-05-25T06:56:32Z"
        },
        {
            "Rating": 4,
            "Review": "There are a lot of options on campus from the dining halls to the restaurants in the student center to the restaurants out in the city. I have the meal plan, and it's convenient since I don't have to worry about food. But it is generally pretty expensive and it is cheaper, and sometimes more fun to cook for yourself.",
            "Author": "College Junior",
            "Date": "2015-05-25T06:47:57Z"
        },
        {
            "Rating": 5,
            "Review": "Boston is filled with nice places to eat",
            "Author": "College Freshman",
            "Date": "2015-03-16T15:26:24Z"
        },
        {
            "Rating": 4,
            "Review": "Sometimes very repetitive, but the food usually tastes good",
            "Author": "College Freshman",
            "Date": "2015-03-16T15:21:27Z"
        },
        {
            "Rating": 3,
            "Review": "Meal plan is convenient and good quality, which is enough to make me happy.  Forced into a meal plan if you live in a dorm with a dining hall which some hate.",
            "Author": "College Freshman",
            "Date": "2015-03-01T01:35:12Z"
        },
        {
            "Rating": 4,
            "Review": "Everything up here in Boston is much more expensive than home (deep south texas) so I do not eat out as much since I am on a ridiculously expensive meal plan, now that does not give me my moneys worth at all.",
            "Author": "College Freshman",
            "Date": "2015-01-12T15:23:15Z"
        },
        {
            "Rating": 4,
            "Review": "There's a small pizza place about a block from campus that's open until 4am. Great for those late nights studying.",
            "Author": "College Sophomore",
            "Date": "2014-11-13T13:48:23Z"
        },
        {
            "Rating": 4,
            "Review": "I order food often and there are tons of restaurants nearby to order from. Many students use Grubhub to order froyo from Cafe 472 and places like Rice Bowl late at night.",
            "Author": "College Senior",
            "Date": "2014-08-14T21:54:50Z"
        },
        {
            "Rating": 4,
            "Review": "I am not on a meal plan, but from what I've tried, the campus dining seems pretty good.",
            "Author": "College Senior",
            "Date": "2014-08-14T21:45:40Z"
        },
        {
            "Rating": 3,
            "Review": "I am actually not on campus dining so I can't really speak to it, but I know that there are about five dining halls across campus - and each has it's own speciality.",
            "Author": "College Junior",
            "Date": "2014-08-03T12:53:22Z"
        },
        {
            "Rating": 1,
            "Review": "Campus dining is overpriced and not really high quality.",
            "Author": "College Senior",
            "Date": "2014-06-23T21:14:34Z"
        },
        {
            "Rating": 3,
            "Review": "The food's fairly good if you have time to go off campus to get it.  Some fairly good takeout.  Boston's open later.",
            "Author": "College Senior",
            "Date": "2014-06-23T21:12:47Z"
        },
        {
            "Rating": 3,
            "Review": "Off-campus dining is better than on-campus, Central Square is good.",
            "Author": "College Freshman",
            "Date": "2014-05-02T19:37:52Z"
        },
        {
            "Rating": 3,
            "Review": "The cost is pretty practical for a college student and the locations are also convenient. There are a variety of options including ethnic foods and vegetarian/vegan options.",
            "Author": "College Freshman",
            "Date": "2014-03-26T00:41:53Z"
        },
        {
            "Rating": 3,
            "Review": "The dining hall food is pretty good. The downside is that students who choose a meal plan have limited options.",
            "Author": "College Freshman",
            "Date": "2014-01-21T18:22:51Z"
        },
        {
            "Rating": 5,
            "Review": "We have vegan and vegetarian options everyday which can get a bit annoying.",
            "Author": "College Freshman",
            "Date": "2013-12-27T12:28:42Z"
        },
        {
            "Rating": 5,
            "Review": "Well, I mean it's Boston so there's a little of everything.",
            "Author": "College Freshman",
            "Date": "2013-12-27T12:24:29Z"
        },
        {
            "Rating": 5,
            "Review": "Great options! It's a city!",
            "Author": "Recent Alumnus",
            "Date": "2013-11-27T22:56:59Z"
        },
        {
            "Rating": 5,
            "Review": "With Boston right across the bridge and Cambridge on the school side, there is an endless variety of options from all kinds of different types of food. I had legitimate dimsum (chinese food) in the morning and italian for dinner, with mochi ice cream for dessert.",
            "Author": "College Freshman",
            "Date": "2013-11-24T19:16:39Z"
        },
        {
            "Rating": 5,
            "Review": "Get off the meal plan as soon as you can because the food in Boston and Cambridge is amazing and much cheaper than the meal plan! Ethnic food and vegan/vegetarian options are huge in Cambridge right next to campus.",
            "Author": "College Sophomore",
            "Date": "2013-11-12T15:41:33Z"
        },
        {
            "Rating": 5,
            "Review": "There's so much variety for off-campus dining. Since MIT is in the city, you can go to many local restaurants as well as familiar chains. There's somewhere for everyone to eat.",
            "Author": "College Sophomore",
            "Date": "2013-07-08T17:43:15.11Z"
        },
        {
            "Rating": 3,
            "Review": "There are some really excellent restaurants if you're willing to walk a little ways. Look for the wide variety of ethnic food (Middle Eastern, Thai, etc.), as well as some great Boston classics.",
            "Author": "College Junior",
            "Date": "2013-06-18T13:20:14.08Z"
        },
        {
            "Rating": 5,
            "Review": "Scoozi's scampi calzone! Excites me to think of it",
            "Author": "College Junior",
            "Date": "2013-06-12T13:43:18.793Z"
        },
        {
            "Rating": 3,
            "Review": "In my opinion, the meal plans are rather expensive when paired with its value but they are also cheaper in price than at most other colleges. Certain dining halls, like Next and McCormick, serve the best quality food and are my favorite dining halls to eat at. Maseeh, being relatively new and a dining hall that caters to a lot of people and is open the latest, has the least quality food. Simmons, being far away and only really caters to its residents, also has subpar quality food but it has been getting better with new management. Don't overestimate the time you'll have to eat, most people end up getting large meal plans and then wasting meals. Start small and know your limits.",
            "Author": "College Freshman",
            "Date": "2013-05-30T12:58:40.467Z"
        },
        {
            "Rating": 1,
            "Review": "It's very expensive - about 12 dollars per meal on average.  Food is not great.  Meal plans are required if you live in a dorm with a dining hall.",
            "Author": "College Junior",
            "Date": "2013-03-10T09:36:50.297Z"
        },
        {
            "Rating": 4,
            "Review": "There are five different dining halls at MIT, all of which serve different food. There are also several convenience stores (La Verdes and MacCon) and fast food places in the student center. Dining halls are expensive but the food there is very good and has a lot of variety.",
            "Author": "College Sophomore",
            "Date": "2013-01-27T14:24:29.94Z"
        },
        {
            "Rating": 4,
            "Review": "There are plenty of great options that are only a short T ride away, especially in the North End.",
            "Author": "College Freshman",
            "Date": "2013-01-14T14:21:37.167Z"
        },
        {
            "Rating": 5,
            "Review": "MIT dining is the best food around. It's even better than the restaurants around campus AND there are tons of vegan/vegetarian/gluten-free options.",
            "Author": "College Freshman",
            "Date": "2013-01-06T08:40:10.867Z"
        },
        {
            "Rating": 3,
            "Review": "Campus Dining at MIT is pretty bad. There are four dining hall dorms, and if you live in these dorms you must be on a meal plan. The meal plans are overpriced and the food is just meh. My main complaint with the campus dining are the limited dining hours. Maseeh is the only dorm you can get lunch at, and it's only open for a few hours. Dining also closes really early, so it's not convenient at all. You really have to plan your schedule around the dining hours if you want to get your money's worth. However, the dorms that do not have dining halls have kitchens so you can cook for yourself. There is a huge cooking culture at MIT. Trader Joes and Star Market are within walking distance, but it is a bit of a hassle to carry all of your food back to campus. If you have money to spend, there are a lot of really awesome restaurants located right next to MIT. And foodtrucks. Yum. So if you're feeling lazy, ordering delivery is really easy and there is so much variety to chose from.",
            "Author": "College Freshman",
            "Date": "2012-10-29T11:06:00.83Z"
        },
        {
            "Rating": 3,
            "Review": "Ok but Overpriced – The Campus food is plated well, it tastes okay, and it costs too much. Most people who are on the meal plan don't know how to cook, don't care about money, or had parents who don't know how to cook.",
            "Author": "College Sophomore",
            "Date": "2012-08-25T18:32:19.62Z"
        },
        {
            "Rating": 3,
            "Review": "Boston: Pricey but Yummy – Newbury Street and the Prudential Center have some great and fancy places to dine. Most places are only a 20 minute walk across Harvard Bridge. A bit pricey, but it's a nice change of pace to get out of campus and treat yourself. Recommendations: Pinkberry (froyo), Sweet (cupcakes), Island Hopper (Asian).",
            "Author": "College Freshman",
            "Date": "2012-05-30T22:47:59.293Z"
        },
        {
            "Rating": 4,
            "Review": "There are lots of wonderful dining places near campus, both in Boston and in Cambridge.",
            "Author": "College Freshman",
            "Date": "2012-04-09T00:13:37.6Z"
        },
        {
            "Rating": 3,
            "Review": "OK but Repetitive – The places around campus are good. I guess you get kind of tired of eating at dining halls, but when you need something to eat between classes, you can't complain. MIT dining hall food is not all that bad, it just gets old sometimes. I suggest not buying a huge meal plan after freshman year.",
            "Author": "College Freshman",
            "Date": "2012-03-02T01:27:03.21Z"
        },
        {
            "Rating": 4,
            "Review": "Sooooo Much Variety! Fantastic variety, but you are in Boston, so things are never \"cheap.\" There are definitely really well priced restaurants in the area though! Especially Pour House's half priced burgers on Saturday evenings!",
            "Author": "College Senior",
            "Date": "2012-01-29T16:38:09.863Z"
        },
        {
            "Rating": 3,
            "Review": "Decent Except for Meal Plan – Students living in dorms with dining halls are required to enroll in a dining meal plan, which is my largest complaint. Else then that, food trucks and food court are always available and serve decent quality food.",
            "Author": "College Freshman",
            "Date": "2012-01-20T14:18:07.78Z"
        },
        {
            "Rating": 5,
            "Review": "Incredible and Diverse Boston Dining Options – There is a plethora of restaurants in the Boston/Cambridge area with a wide range of cuisines and prices for any night out.",
            "Author": "College Sophomore",
            "Date": "2012-01-20T13:09:33.547Z"
        },
        {
            "Rating": 3,
            "Review": "Boston Has Many Options! There are many options. The main problem is that most of the good options are on the expensive side. Those that are accessible to a college student income tend not to be the best dining options out there. That said, there are many off-campus dining options near by or easily accessible through public transportation.",
            "Author": "College Freshman",
            "Date": "2012-01-19T11:57:33.02Z"
        },
        {
            "Rating": 4,
            "Review": "The dining halls are located in five dorms and open for anyone to eat in. People who live in dining dorms must have a meal plan while others may choose not to. Plenty of variety since every dining hall has different food everyday. However lunch is somewhat limited to Maseeh Dining Hall. (the biggest one on campus)",
            "Author": "College Freshman",
            "Date": "2012-01-19T10:06:33.503Z"
        },
        {
            "Rating": 5,
            "Review": "Better Than on Campus – Around the campus are the cities of Boston and Cambridge. Almost every type of dining is present within walking distance. Everything off campus is better than any of the food on campus.",
            "Author": "College Freshman",
            "Date": "2011-12-05T14:19:43.04Z"
        },
        {
            "Rating": 3,
            "Review": "Variety If You Go Far Enough – There are lots of different places to eat, but they are all a far walk away.",
            "Author": "College Senior",
            "Date": "2011-08-30T19:27:46.467Z"
        },
        {
            "Rating": 5,
            "Review": "Boston Restaurants – There are numerous affordable and diverse food options.",
            "Author": "College Sophomore",
            "Date": "2011-06-10T18:56:26.797Z"
        },
        {
            "Rating": 3,
            "Review": "There is none really.\r\nUnless you feel like blowing 8 bucks a meal. The difference at MIT is that students can cook for themselves, and learn life skills that will follow them beyond their years at MIT. So even though the dining here isn't great, I wouldn't rank my college choices based on this.\r\n\r\nAnd go get off campus if you want food diversity. There are plenty of places to eat down Mass. Ave, in Harvard square, central square, and across the river. If you think there's nothing to eat then you aren't looking hard enough.",
            "Author": "College Sophomore",
            "Date": "2010-12-18T19:33:46.067Z"
        },
        {
            "Rating": 5,
            "Review": "boston and cambridge have so many options for every price level and variety",
            "Author": "College Sophomore",
            "Date": "2010-10-22T04:34:13Z"
        },
        {
            "Rating": 2,
            "Review": "No Meal Plan – Dining options are not very good. The dining halls are only open for dinner from 5:30-8:30. Only two are open on Fridays and Saturdays. Although the meals themselves are good and accommodate nearly every dining style, students have to pay by meal, which costs about $8. I suppose students have the option to save money by cooking for themselves but when in a time crunch, its not very convenient.",
            "Author": "College Sophomore",
            "Date": "2010-09-04T21:17:30.177Z"
        },
        {
            "Rating": 2,
            "Review": "Might as Well Go Out – Dining is difficult at MIT. I often find myself going off-campus for meals and such. Off-Campus dining is great, though :)",
            "Author": "College Sophomore",
            "Date": "2010-07-25T17:59:39.817Z"
        },
        {
            "Rating": 3,
            "Review": "Could Be Cheaper Places Around – College students live on a budget, so it would be nicer to see more cheap options around. Perhaps even some places giving MIT students discounts would be great. But there are plenty of nice places to go on a date either across the river in Boston or right here in Cambridge.",
            "Author": "College Freshman",
            "Date": "2010-05-11T18:13:38.643Z"
        },
        {
            "Rating": 3,
            "Review": "Food is not a problem but it isn't  a great thing either.",
            "Author": "College Junior",
            "Date": "2010-04-10T11:12:13.573Z"
        }
    ],
    "Housing": [
        {
            "Rating": 4,
            "Review": "Great value, considering you don't have to do housekeeping, and as a junior or senior you can easily obtain your own room.",
            "Author": "Recent Alumnus",
            "Date": "2016-08-29T13:46:24Z"
        },
        {
            "Rating": 5,
            "Review": "I love my dorm, the building is beautiful and the people are wonderful. Each dorm has its own culture and because of that, all types of people can find their place and the type of people they want to surround themselves with.",
            "Author": "College Sophomore",
            "Date": "2016-08-03T17:05:38Z"
        },
        {
            "Rating": 4,
            "Review": "I got my third choice of dorm, but it is working out OK.",
            "Author": "College Freshman",
            "Date": "2016-07-19T20:13:30Z"
        },
        {
            "Rating": 4,
            "Review": "I am very satisfied with my current dorm - Simmons Hall.  Great building and people who reside in it.",
            "Author": "College Sophomore",
            "Date": "2016-07-10T19:45:44Z"
        },
        {
            "Rating": 4,
            "Review": "I live on the east side of campus, which could not be more convenient--very close to classes and to the T (subway). In my dorm, specific halls form close communities with decades of traditions. This is fun and engaging, but people tend to form groups/cliques and are often rude to each other because we have no explicit rules about how to treat other members of our hall.",
            "Author": "College Senior",
            "Date": "2016-06-24T00:44:30Z"
        },
        {
            "Rating": 4,
            "Review": "Despite the occasional fire alarm, living in a dorm was great. You get to choose who you live near in some of the dorms and form a strong community with the people around you. Each section or lounge gets funds to spend however they want to help facilitate that. The dorms are larger than at any other school.",
            "Author": "College Junior",
            "Date": "2016-06-17T04:55:58Z"
        },
        {
            "Rating": 3,
            "Review": "The communities are great, but the housing is super expensive.",
            "Author": "College Junior",
            "Date": "2016-06-06T02:51:07Z"
        },
        {
            "Rating": 4,
            "Review": "The community atmosphere is exceptional, the facilities can leave some to be desired.",
            "Author": "College Sophomore",
            "Date": "2016-06-03T21:54:07Z"
        },
        {
            "Rating": 4,
            "Review": "It's clean, nice, and social",
            "Author": "College Sophomore",
            "Date": "2016-03-30T00:12:41Z"
        },
        {
            "Rating": 5,
            "Review": "MIT's housing is unusual in that it emphasizes community",
            "Author": "College Sophomore",
            "Date": "2016-02-22T21:54:33Z"
        },
        {
            "Rating": 5,
            "Review": "Housing is very easy to choose and there is a guaranteed place for everyone.",
            "Author": "College Freshman",
            "Date": "2016-02-01T22:46:21Z"
        },
        {
            "Rating": 3,
            "Review": "The most frustrating thing about the dorms is their distance from the main campus.  However, each dorm has its own social community which really makes it feel like a home.  The dorms could all use more laundry options since the machines seem to always be in use or out of order.  The kitchens in MacGregor suck, but I still love the rooms in MacGregor.  Burton Connor is generally falling apart and dirty, but the social atmosphere there is great.  Front desk security people are lazy and rude many times, so I do not like dealing with them.  I also hate the process for checking in 'guests' into your dorm, and I personally think that if a guest is another MIT student with ID this should be much easier.",
            "Author": "College Freshman",
            "Date": "2016-01-16T13:02:36Z"
        },
        {
            "Rating": 5,
            "Review": "My dorm is amazing. The community is tight-knit and the staff are really nice.",
            "Author": "College Senior",
            "Date": "2015-12-31T03:06:26Z"
        },
        {
            "Rating": 4,
            "Review": "The aspects of campus housing are largely dependent on the dorm you choose. That being said, as opposed to most other colleges, housing options are much more lenient and students are given much more freedom to choose where they feel the most comfortable living and whom they would like to live with.",
            "Author": "College Freshman",
            "Date": "2015-12-29T19:38:16Z"
        },
        {
            "Rating": 3,
            "Review": "The housing is a bit expensive, but reasonable priced for the area. There was a lack of community in my dorm but I have heard positive things about other dorms",
            "Author": "College Freshman",
            "Date": "2015-12-29T16:47:06Z"
        },
        {
            "Rating": 5,
            "Review": "My dorm is nice and warm and roomy. Awesome people",
            "Author": "College Sophomore",
            "Date": "2015-12-29T16:38:16Z"
        },
        {
            "Rating": 3,
            "Review": "The best part is that you have a lot to choose from. Each dorm has a unique culture, and you'll probably find a niche if you look hard enough. Some dorms are a bit far from main campus, though, and some dorms have notable construction issues while others are right in the middle of campus (the East side) and/or are super crisp and attractive (Maseeh, Simmons, Next).",
            "Author": "College Freshman",
            "Date": "2015-12-24T01:48:49Z"
        },
        {
            "Rating": 5,
            "Review": "They are so many different options. It all depends on what kind of dorm atmosphere you are looking for.",
            "Author": "College Sophomore",
            "Date": "2015-06-09T18:16:50Z"
        },
        {
            "Rating": 4,
            "Review": "I find that the students in my dorm are all very friendly, and the cost is somewhat manageable.",
            "Author": "College Freshman",
            "Date": "2015-05-27T14:59:56Z"
        },
        {
            "Rating": 5,
            "Review": "It's great to live on campus since that's where a majority of your friends and classmates are. Each dorm has its own culture and atmosphere, and I think it's quite easy to find one that fits your personality",
            "Author": "College Junior",
            "Date": "2015-05-25T06:49:06Z"
        },
        {
            "Rating": 5,
            "Review": "Really clean, great community, great facilities",
            "Author": "College Freshman",
            "Date": "2015-03-16T15:20:01Z"
        },
        {
            "Rating": 5,
            "Review": "Housing is amazing: you can select from 11 unique dorms with wide-ranging cultures and amenities, and later have the option to change dorms.  The dorms all have their perks, such as East Campus, which builds roller coaters attatched to 3 story dance arenas (and many other things) to Simmons, which has spacious lounges, is new and well maintained, and inclusive government.  There is really a huge variety, and people seem to always find an environment they're happy in.",
            "Author": "College Freshman",
            "Date": "2015-03-01T01:31:08Z"
        },
        {
            "Rating": 4,
            "Review": "If you do not get the dorm that is too far away from campus it is great. and get one where you don't have to clean your own bathroom, it makes life easier.",
            "Author": "College Freshman",
            "Date": "2015-01-12T15:34:45Z"
        },
        {
            "Rating": 5,
            "Review": "MIT operates on a residential housing system, and because of this each dorm has it's own culture that, for the most part, remains the same over the years. Because of this, it is easy to find the dorm you want to live in and the lottery is generally very fair in giving you one of your top three choices.",
            "Author": "College Freshman",
            "Date": "2014-11-19T13:58:02Z"
        },
        {
            "Rating": 3,
            "Review": "Expensive and not very convenient, unless you live in an off-campus sorority or fraternity. In the summer, I looked for an apartment off-campus, but the dorms MIT kept open for summer living were just more convenient.",
            "Author": "College Sophomore",
            "Date": "2014-11-13T13:54:56Z"
        },
        {
            "Rating": 3,
            "Review": "Living on campus is quite expensive, and many students are upset about the new enforced security. However, most students do live on campus.",
            "Author": "College Junior",
            "Date": "2014-08-25T12:53:11Z"
        },
        {
            "Rating": 3,
            "Review": "There are a few off-campus communities. I have not lived in them, but the people who do are very tight-knit communities and almost always satisfied with their housing.",
            "Author": "College Junior",
            "Date": "2014-08-25T12:51:50Z"
        },
        {
            "Rating": 4,
            "Review": "Living off-campus has many pros in terms of being closer to cheaper restaurants and places to shop, but many students stay on campus.",
            "Author": "College Senior",
            "Date": "2014-08-14T22:00:47Z"
        },
        {
            "Rating": 4,
            "Review": "I love our campus housing. It allows us so much more freedom than your typical university, and the dorms are really hubs of MIT student culture.",
            "Author": "College Senior",
            "Date": "2014-08-14T21:43:20Z"
        },
        {
            "Rating": 4,
            "Review": "There's lots of places to live in Cambridge or Boston if you want to move off campus after Freshman year. MIT does not impose any restrictions on living off campus so it is an option that many students take. With Greek life a big part of the MIT social scene, many affiliated people move into their respective sorority and fraternity houses while other students move into apartments.",
            "Author": "College Junior",
            "Date": "2014-08-03T12:55:34Z"
        },
        {
            "Rating": 3,
            "Review": "Some of the dorms are very nice and new while others are super old, and run down. What this allows for is dorm-based culture that includes a great deal of freedom and things such as painting murals on walls. The social atmosphere also varies a lot between the dorms, some are all about the social scene while others are much more quiet and chill.",
            "Author": "College Junior",
            "Date": "2014-08-03T12:40:58Z"
        },
        {
            "Rating": 5,
            "Review": "MIT has a unique housing system, with everyone living together for all four years.",
            "Author": "College Senior",
            "Date": "2014-06-23T21:19:33Z"
        },
        {
            "Rating": 4,
            "Review": "If you count fraternities, almost half of us live off campus.  Extra freedom is nice.",
            "Author": "College Senior",
            "Date": "2014-06-23T21:16:19Z"
        },
        {
            "Rating": 4,
            "Review": "Dorms, predictably, determine the social scene and ultimately your social life. There's very little mixing between dorms so once you get into a dorm, there's a high chance you'll stay there forever (by choice) just because your friends are there. That being said, there's plenty of variety. The main split is between east and west campus, with east campus being the strange kids, the dye-our-hair-pink kids, the hackers, the clothing-optional kids, etc. West campus is more \"mainstream\". In terms of location, east campus is right in the center of everything. Some kids don't even have to see daylight to get their classes because of the tunnel systems linking that part of campus. As for west campus, the unfortunate part is that it's laid out on a single road (Amherst Alley, along Mem Drive). So if you live at the very far end, it will take you a good 10-15 minutes to walk to class. Additionally, because there's few obstructions on this street, you may have to fight your way to class against the strong wings that come from time to time.",
            "Author": "Recent Alumnus",
            "Date": "2014-05-27T14:18:22Z"
        },
        {
            "Rating": 3,
            "Review": "Quality of housing varies wildly but it's true that there's something for everyone.",
            "Author": "College Freshman",
            "Date": "2014-05-02T19:42:50Z"
        },
        {
            "Rating": 3,
            "Review": "Generally it's better to live on campus for proximity to everything.",
            "Author": "College Freshman",
            "Date": "2014-05-02T19:37:18Z"
        },
        {
            "Rating": 3,
            "Review": "Off campus housing is great if u can afford it. There are off campus living groups that are affordable but private housing is expensive.",
            "Author": "College Freshman",
            "Date": "2014-03-26T01:07:00Z"
        },
        {
            "Rating": 3,
            "Review": "Most people who live off-campus live at their fraternity/sorority house. Independent options are limited, and Boston is on the expensive end.",
            "Author": "College Sophomore",
            "Date": "2014-01-23T10:09:13Z"
        },
        {
            "Rating": 4,
            "Review": "I like it a lot. I've really gotten to know and get close to the people I live with.",
            "Author": "College Freshman",
            "Date": "2014-01-21T18:29:09Z"
        },
        {
            "Rating": 3,
            "Review": "Some buildings are old and the facilities aren't completely updated but the dorms provided a social environment and a culture for their students.",
            "Author": "College Freshman",
            "Date": "2014-01-08T13:33:52Z"
        },
        {
            "Rating": 5,
            "Review": "I love where I live",
            "Author": "College Freshman",
            "Date": "2013-12-31T01:07:30Z"
        },
        {
            "Rating": 5,
            "Review": "I love my dorm. It's one of the further ones from campus, but it's nice.",
            "Author": "College Freshman",
            "Date": "2013-12-27T12:30:55Z"
        },
        {
            "Rating": 5,
            "Review": "MIT dorm life is crazy and fun and different than anywhere else. Every dorm is different, and every floor/entry/house within each dorm has its own culture as well. Housing process is pretty involved for freshmen - you get placed in a temporary room, then have the option of switching dorms, then have the option of doing a 'floor rush'.",
            "Author": "College Sophomore",
            "Date": "2013-11-12T15:35:26Z"
        },
        {
            "Rating": 3,
            "Review": "If you are in need of an apartment, you'll have no trouble finding one, but the price might scare you far from your ideal location. My dorm closed down this year and I managed to find a 4 bedroom, 2 bath flat 10 minute walking distance from campus within the 3 days of searching. The flat ended up being quite affordable because we are fitting 6 people (2 in massive living room), and I have a roommate. Otherwise, I would say the flat was quite expensive for building quality and location (Central Square is not the best of neighborhoods).",
            "Author": "College Senior",
            "Date": "2013-08-21T11:58:21.71Z"
        },
        {
            "Rating": 4,
            "Review": "Each dorm has its own unique culture and usually, you can find the dorm that's right for you. Being required to live on campus your freshman year is a good thing since it allows you to assimilate to college life and helps you meet other freshmen and upperclassmen.",
            "Author": "College Freshman",
            "Date": "2013-05-30T12:51:45.597Z"
        },
        {
            "Rating": 3,
            "Review": "Off-campus housing at MiT is often done through frats/sororities making it very easy and still somewhat dorm-like. On the other hand though, I've never heard of anyone having trouble finding an apartment off campus or roommates.",
            "Author": "College Freshman",
            "Date": "2013-05-15T13:42:16.207Z"
        },
        {
            "Rating": 3,
            "Review": "It's the cheapest way to live at MIT if you're not in a fraternity or sorority.  Although all of the dorms differ significantly, most rooms have plenty of space.  Most dorms are located on prime property on the Charles River.",
            "Author": "College Junior",
            "Date": "2013-03-10T09:32:32.27Z"
        },
        {
            "Rating": 5,
            "Review": "A Place for Everybody and Everybody Always in Multiple Places – most students live on campus all four years for a reason. few have meal plans, so it's a lot of cooking on your own, and there are constantly study breaks, dorm awesomeness, dormwide hacking, and East Campus vs West Campus shenanigans. i can't imagine a more lively, more communal, more amazing place to spend 4 years of sleep (or lack thereof)",
            "Author": "College Sophomore",
            "Date": "2012-08-13T23:58:58.553Z"
        },
        {
            "Rating": 3,
            "Review": "The housing process is great; administration does everything possible to make sure you end up where you want to be.\r\nSimmons is a very nice dorm with big rooms, good cooking and lounge spaces, and friendly people. It's costly, though, and the in-house dining hall isn't as good as some of the others.",
            "Author": "College Freshman",
            "Date": "2012-02-11T14:35:29.967Z"
        },
        {
            "Rating": 5,
            "Review": "MIT is MIT... unless you're a student here, you won't really get us from outside. It's a nerdy place yes, but the stereotypes of a bunch of kids who only study is bogus. Yeah, we do a lot of work, but here, the unofficial motto is \"work hard play hard\". Why else would the BU and Wellesey people always crash the MIT parties. Dorm culture is super unique to MIT. And it makes dorm life awesome. There is no real dining hall and most of campus is OK with this. Social atmosphere is literally what any kid who actually gets into MIT will want. We are all dedicated to our work, but we have SO much more than that to do in college, and it makes for a great place.",
            "Author": "College Sophomore",
            "Date": "2012-01-19T09:15:47.353Z"
        },
        {
            "Rating": 4,
            "Review": "Dorms for Any Type of Person – Each dorm at MIT can be perfect for any type of person. MIT doesn't separate freshmen and upperclassmen in different dorms, and I think that's a great way to get freshman to know and talk to upperclassmen. Also, every dorm is different, so there are a few places each type of person can comfortably live at. Most dorms at MIT have hall and dorm culture, so everyone on a specific hall can be close to those people that they live next to or near each other. In my opinion, I think that is really cool, and something that I feel is a positive thing. But there are some dorms that don't strive to achieve that sort of close dorm culture. Anyways, because MIT does have greek life, some people can also move into their fraternity or sorority's house, though most of those are off-campus and take some time to commute to. I think the housing process is pretty great for freshman trying to find the best fit for themselves, but it can sort of be difficult for those people who want to move out of their current dorm, and are on the waitlist to a dorm that they really want to get into.",
            "Author": "College Sophomore",
            "Date": "2012-01-19T01:04:17.11Z"
        },
        {
            "Rating": 5,
            "Review": "Good Living on Campus – Each dorm has its own personality. It is very unique and most of the people live in the dorm they fit at.",
            "Author": "College Freshman",
            "Date": "2012-01-19T00:09:14.52Z"
        },
        {
            "Rating": 3,
            "Review": "Available but No Need – A lot of students live off campus in fraternities and/or sororities, but these houses are still owned and partially funded by MIT.  MIT guarantees housing throughout your undergraduate education, so there's really no need to live off-camps, except during the summer.  Also, the dorms are each unique, so you can live in one that feels more like an apartment (no dining hall and kitchens everywhere) or choose the typical dorm with a dining hall.  Boston in general is expensive, so it's really not worth it.",
            "Author": "College Sophomore",
            "Date": "2011-11-07T21:56:19.253Z"
        },
        {
            "Rating": 4,
            "Review": "Awesome and Totally Dependent on Culture – It's great. Each dorm has its own culture and that really helps freshmen determine where they belong.",
            "Author": "College Freshman",
            "Date": "2011-03-23T01:47:27.267Z"
        },
        {
            "Rating": 4,
            "Review": "Either a Greek House or a Really  Expensive Apartment – Apartments near campus are really easy to find in Boston - they are all over the place. However, the better option for off campus housing is a frat or sorority. Apartments are really expensive and sometimes don't have certain amenities (like a washer and dryer).",
            "Author": "College Sophomore",
            "Date": "2010-10-04T17:21:23.99Z"
        },
        {
            "Rating": 3,
            "Review": "Housing on Campus – each dorm on campus has its own community, making it easy for students to find where they fit in. although not all of the dorms have dining halls, there are campus food options within walking distance. some of the dorms are situated a little far from main campus, which is rough during the winter.",
            "Author": "College Sophomore",
            "Date": "2010-10-04T14:29:36.21Z"
        },
        {
            "Rating": 3,
            "Review": "Very Nice but Too Expensive – Off-campus housing at MIT is way too expensive for most people. An apartment on University Park behind campus runs for much more a month than any dormitory. On-campus housing is more convenient because of the proximity to classes and the many resources available at dorms.",
            "Author": "College Sophomore",
            "Date": "2010-05-27T19:04:07.807Z"
        }
    ]
}