{
    "Overall%20Experience": [
        {
            "Rating": 5,
            "Review": "I genuinely enjoyed my experience with Princeton. I would say it is significantly more rigorous than similar academic institutions (e.g., Harvard), however, I find that it really challenges you to explore subjects very deeply. I did enjoy the eating club culture since it allowed you to engage with those who you otherwise might not have.",
            "Author": "Alum",
            "Date": "2025-02-23T20:38:53.45447Z"
        },
        {
            "Rating": 5,
            "Review": "As a freshman at Princeton University, my experience has been transformative, filled with both challenges and opportunities for growth. The academic workload has pushed me to think critically, especially in computer science. Collaborating with brilliant peers has opened my mind to new perspectives. Outside the classroom, the supportive campus community offers many clubs and activities, allowing me to connect with others who share my passion for technology and leadership. Princeton’s focus on excellence and innovation inspires me to set high goals. Overall, my first year has been a whirlwind of academic challenges, personal growth, and meaningful connections, shaping my journey as both a student and an individual.",
            "Author": "Freshman",
            "Date": "2025-02-19T03:15:33.410159Z"
        },
        {
            "Rating": 5,
            "Review": "This place is amazing! The social atmosphere is amazing as well as the amazing academics. I very much recommend. Mental health support was awesome!",
            "Author": "Works Here",
            "Date": "2024-11-10T04:27:29.259185Z"
        },
        {
            "Rating": 5,
            "Review": "I loved how they teach and how they show us example😙.\nThank you for doing everything,You did for me.Princeton is the best college ever.",
            "Author": "Other",
            "Date": "2024-10-22T20:59:38.752106Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton University is ranked the #1 undergraduate university in the United States for a reason. They invest so much money into making sure their students have all of the resources they need to be successful.",
            "Author": "Sophomore",
            "Date": "2024-08-16T00:47:43.101286Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton really cares about academics and take an approach of preparing you for the real world. They also have alot of resources for students financially, socially, and mentally.",
            "Author": "Freshman",
            "Date": "2024-07-27T16:44:27.245077Z"
        },
        {
            "Rating": 5,
            "Review": "A great campus with unbelievable academics! I'm an incoming freshman and the preview event was very informational and gave me a through insight on what to expect. Couldn't recommend more!",
            "Author": "Freshman",
            "Date": "2024-07-22T16:48:25.530021Z"
        },
        {
            "Rating": 4,
            "Review": "Princeton University is certainly an academically rigorous college. It attracts students who hold themselves to high standards which, due to grade deflation, adds to the stress of most students. The campus is beautiful in the more historic part of campus. The newer buildings are very clean and there are several food options. I don’t ever feel the need to snack with the amount of options I have in the undergraduate meal plan. Many of the student organizations are wonderful and everyone is very passionate about their field. It is certainly not an athletic school but alumni are extremely passionate about Princeton pride.",
            "Author": "Sophomore",
            "Date": "2024-06-17T22:33:24.886146Z"
        },
        {
            "Rating": 5,
            "Review": "The surrounding town is very picturesque and safe; I can go out, day and night, and feel like home. The academics, while challenging, are intellectually very stimulating and rewarding. I've met some of the smartest people I've met here, and I know I will continue to do so.",
            "Author": "Freshman",
            "Date": "2024-06-13T02:02:27.558551Z"
        },
        {
            "Rating": 4,
            "Review": "I don't think anything I have to say is too surprising. The academics are great, the classes are interesting but challenging. The professors are extremely knowledgable and, in my experience, willing to work with you and get to know you. However, the shorter semesters mean the pace of academic life is intense, and it can be hard to feel like you're getting the \"college experience\" socially. There are plenty of events, campus groups, and parties, it's just difficult to find the time often.",
            "Author": "Sophomore",
            "Date": "2024-06-11T02:19:51.930004Z"
        },
        {
            "Rating": 4,
            "Review": "Princeton is an incredible place for learning, making academic connections, and gaining lifelong friends.",
            "Author": "Alum",
            "Date": "2024-05-31T14:38:54.672483Z"
        },
        {
            "Rating": 1,
            "Review": "Princeton was once considered luxurious, but now little of that hype remains. Today, Princeton is characterized by violence, aggression, and trauma. Daily protests echo through the campus, accompanied by a significant police presence. Academic pursuits have taken a back seat. It feels as though Princeton, once known for its high academic standards, has been transformed into pawns in a political game in the Middle East",
            "Author": "Junior",
            "Date": "2024-05-06T07:42:45.204778Z"
        },
        {
            "Rating": 5,
            "Review": "The environment cultivated at Princeton continually prompts the frontier of knowledge to be expanded. The unquenchable thirst for understanding is shared amongst peers and faculty. Princeton supports your endeavors to change the world so much so that they fund your abroad internships and activities in building your thesis. Princeton changes its students for the better. and society's advancement.",
            "Author": "Freshman",
            "Date": "2024-04-19T07:08:55.719656Z"
        },
        {
            "Rating": 5,
            "Review": "I am currently a first-year here at Princeton University and my experiences here have single-handedly changed my life. The school has offered me so much support in every facet of my life -- from academics, to finances, to extracurriculars. I feel that I am completely thriving here in a way that I was never able to before. Classes are suburb with professors who really care about not only about what we learn but also how we grow as individuals. Dining is amazing and we have the sweetest dining staff ever. There are so many options for clubs that you are never bored and can always find something for you. Overall, I feel like there is no better place for me than Princeton :).",
            "Author": "Freshman",
            "Date": "2024-03-26T19:05:33.32543Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton was a great place to spend my undergraduate years. There are multiple student organizations, supportive mentors, and great classes. They take good care of their undergraduates and provide them with a good foundation to enter the workforce.",
            "Author": "Alum",
            "Date": "2024-02-01T07:38:33.815725Z"
        },
        {
            "Rating": 5,
            "Review": "I have always wanted to go here it is my dream school. I would be the first person in my family to go to college in the United States so I want to bring a first generation legacy to my family name.",
            "Author": "Other",
            "Date": "2023-09-28T13:32:07.353697Z"
        },
        {
            "Rating": 5,
            "Review": "Amazing so far. I'm looking forward to taking graduate-level classes. The professors are legendary geniuses (so many of them are Nobel winners),  yet friendly and approchable.",
            "Author": "Freshman",
            "Date": "2023-09-06T11:26:54.055023Z"
        },
        {
            "Rating": 5,
            "Review": "Dream college. Made true thanks to exceptional financial aid supported by its massive endowment. Thank you, Princeton, for making graduating without loans the norm.",
            "Author": "Other",
            "Date": "2023-09-06T11:10:53.978173Z"
        },
        {
            "Rating": 5,
            "Review": "So far, I have loved my time at Princeton. The professors are great, especially as a humanities students. And the school has so much money to fund international travel for whatever research you want to do or even to fund internships. What I would want changed is a student body that is less concerned about about climbing the social ladder, and I also wish that the academic semester was a bit longer, sometimes I feel like courses go by way too fast in 12 weeks and it is hard to keep up.",
            "Author": "Sophomore",
            "Date": "2023-08-06T13:40:52.593658Z"
        },
        {
            "Rating": 5,
            "Review": "Overall, my experience at Princeton was really amazing. There were so many opportunities to become involved on campus, especially in the many music groups (accapella, synphohnia, etc.). There are also so many opportunities to become involved in service through the Pace Center for Civic engagement. The one issue I have is that there are too many things to do and not enough time! The courses here are no joke, and they take up a huge chunk of your time, so I would definitely prepare to be spending a lot of time studying and working on assignments. The academic semesters here are also relatively short (12 weeks), which sometimes makes it difficult to keep up with work. That being said, I am spending my summer on campus and having an incredible time. Finally, I think the accessibility of professors at Princeton is really amazing. They are always willing to meet one-on-one, and they have many office hours (especially in intro-level courses) to help students prepare for exams.",
            "Author": "Sophomore",
            "Date": "2023-06-22T12:33:44.175257Z"
        },
        {
            "Rating": 5,
            "Review": "I am honestly loving my time at Princeton. As an international student, I was intimidated by how rigorous academics initially appeared, but the University has plenty of resources that allow you to succeed. I like the fact that there is no major Greek life in the University, as well as the fact that there is a residential college system, which brings about a sense of community within the University.",
            "Author": "Sophomore",
            "Date": "2023-06-07T02:32:16.827141Z"
        },
        {
            "Rating": 5,
            "Review": "The most amazing college for the best of student. It is one of the most elite schools that anyone can find within the nation.",
            "Author": "Freshman",
            "Date": "2023-05-26T17:14:17.849096Z"
        },
        {
            "Rating": 1,
            "Review": "Students thinking of going to Princeton should ask for information about the school’s far-reaching disciplinary system. Pledges who were hazed, over a dozen, suspended. 150 members of ivy on probation for drinking. Unlike any college I have ever heard of, in terms of punitive attitude against its own students! Also ask about suicide rates.",
            "Author": "Other",
            "Date": "2023-05-20T04:08:02.53229Z"
        },
        {
            "Rating": 5,
            "Review": "Visiting Princeton was an incredibly memorable experience from the striking campus to the interactions between students. It was very apparent that students genuinely enjoyed being part of the Princeton community. In terms of academics, Princeton is known to be rigorous and fast-paced so it primarily depends on the student themselves to adopt efficient time management skills and study methods to succeed.",
            "Author": "Niche User",
            "Date": "2023-04-24T21:35:51.378622Z"
        },
        {
            "Rating": 1,
            "Review": "Horrible administration that is unsupportive, aggressive, and tries so hard to prevent you from graduating. The rules are onerous, and exceptions are NEVER made. In fact, the rules are unclear and constantly growing for academic requirements.\n\nYour Dean of your Residential College is your academic adviser, and she may act liken a tyrant. \n\nSTEM education is so onerous, students can expect to spend 50 hours a week minimum on labs and problem sets, plus lecture time. Yet students leave the courses having minimal actual grasp of the content. Because so much is expected for weekly assignments, actual learning is very little.\n\nThe social dynamics are terrible. Students who know one another ignore eachother when walking past eachother. I was laughed at by a group of girls for saying hello. Students have no loyalty to one another. They will do anything to get into Ivy, Cottage, and TI.\n\nThe only good thing about this place is the prestige of the name.",
            "Author": "Junior",
            "Date": "2023-04-21T23:29:42.121571Z"
        },
        {
            "Rating": 4,
            "Review": "Great research institution, with a lot of opportunities for funding. Requires students to be proactive about seeking out opportunities.",
            "Author": "Alum",
            "Date": "2023-03-20T19:41:09.44092Z"
        },
        {
            "Rating": 2,
            "Review": "Princeton University, specifically the university president Christopher L. Eisgruber, has absolutely tragic regard for the mental health and wellness of its students. We should not have to bring ourselves to the brink of death to meet the impossible academic standards imposed on us.",
            "Author": "Freshman",
            "Date": "2022-12-15T18:53:38.884735Z"
        },
        {
            "Rating": 5,
            "Review": "A fantastic experience. Extremely challenging at times, of course, but many of my closest friends are still my friends from Princeton, 12 years later.",
            "Author": "Alum",
            "Date": "2022-10-21T03:41:33.628757Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton University has a lot of services to help students in all facets of life throughout their 4 years here. Whether it be academic help, for which Princeton supplies tutors, or other help, with counselors or other social activities, Student life is great.",
            "Author": "Sophomore",
            "Date": "2022-09-21T01:53:06.790671Z"
        },
        {
            "Rating": 5,
            "Review": "My time at Princeton is something I wouldn't change for the world. The institution isn't perfect, the course load is extremely rigorous and exhausting,  and the academic pressure can often make you feel like your gonna break down; nonetheless, I've met some of the most amazing people here, the work and the thinking I do in class often sticks with me outside of the lecture, and the undergraduate-focused nature of the school makes me extremely supported and abundant with resources. Its a real give and take but overall, I love that I go to school there.",
            "Author": "Junior",
            "Date": "2022-08-04T04:53:40.238758Z"
        },
        {
            "Rating": 5,
            "Review": "I love how many resources Princeton provides the students and the amazing quality of them. They have so much to offer and endless outlets that I can reach if I ever need help. It is super easy to connect with faculty and alumni and I am so grateful to be able to attend this amazing institution.",
            "Author": "Freshman",
            "Date": "2022-07-30T06:05:18.458512Z"
        },
        {
            "Rating": 5,
            "Review": "Great school and has a lot of really interesting people to meet. I wish that there was less of a stress culture there though",
            "Author": "Sophomore",
            "Date": "2022-05-26T15:02:42.870901Z"
        },
        {
            "Rating": 4,
            "Review": "I would confidently say Princeton is one of if not the best academic institutions in terms of learning to learn. It can feel as if what you are learning is highly theoretical and so you are not getting the same hard skills directly applicable to the real world that you might somewhere else. I also think the challenge of the school does help you grow but that it teeters on the point of being too much. Princeton does ultimately offer phenomenal opportunities and prepares you to have success in life.",
            "Author": "Alum",
            "Date": "2022-05-25T21:35:36.699778Z"
        },
        {
            "Rating": 4,
            "Review": "It is a privilege to go to Princeton. Very academically rigorous, but lots of funding and research opportunities on campus and to go abroad.",
            "Author": "Graduate Student",
            "Date": "2022-05-13T21:22:03.508962Z"
        },
        {
            "Rating": 5,
            "Review": "Although I have only spent a year at Princeton, with half of that year being online, I could not express how much I love this school. The classes really push me, but in the best way possible. The professors are so well rounded and the students are so motivated.",
            "Author": "Sophomore",
            "Date": "2021-06-30T19:58:00.982153Z"
        },
        {
            "Rating": 5,
            "Review": "I like Princeton University's sense of community. There are constant opportunities to connect with other students",
            "Author": "Junior",
            "Date": "2021-04-19T19:53:00.938583Z"
        },
        {
            "Rating": 4,
            "Review": "This school seems like it is all up and coming because it's an ivy, and it really is! I highly recommend applying here, the campus is gorgeous and you are working with top notch professors and researchers",
            "Author": "Niche User",
            "Date": "2021-01-21T03:17:12.394446Z"
        },
        {
            "Rating": 4,
            "Review": "The University truly cares about its students and that is very evident in the teaching and university life.",
            "Author": "Freshman",
            "Date": "2021-01-19T17:13:25.233335Z"
        },
        {
            "Rating": 4,
            "Review": "Excellent school, minus the racism against Asian students and the Ableist bigotry against students with learning disorders and mental health conditions.",
            "Author": "Niche User",
            "Date": "2020-12-02T14:04:45.431742Z"
        },
        {
            "Rating": 5,
            "Review": "literally the best place on earth. Its hard to think of the negatives of this university - the best thing that ever happened to me. If you can apply, apply. If you get accepted, then congratulations because your life has been changed for the better forever.",
            "Author": "Sophomore",
            "Date": "2020-11-18T17:49:25.722337Z"
        },
        {
            "Rating": 5,
            "Review": "Great academics and amazing financial aid. I have only ever had good experiences working with faculty and other students.",
            "Author": "Sophomore",
            "Date": "2020-08-07T21:12:38.910816Z"
        },
        {
            "Rating": 4,
            "Review": "You can pursue anything at this school and come out feeling accomplished at the end of 4 years. Countless ways to get funding for your projects and interests at-home or internationally, and many research/internships opportunities are present at the school. Eating clubs are overrated, niche, and exclusionary.",
            "Author": "Sophomore",
            "Date": "2020-07-29T15:16:14.869016Z"
        },
        {
            "Rating": 4,
            "Review": "I had the  unique experience at Princeton of getting in for engineering and walking on to a varsity sports team. Needless to say my days are generally longer and harder. However, you are very well taken care of. The rooms are nice, the food is good, and as you progress the professors get better and better. School carries a heavy load, but it is manageable. Don't ever pass on an opportunity to spend times with friends: this will be the main thing that keeps to going.",
            "Author": "Junior",
            "Date": "2020-07-09T23:44:21.161692Z"
        },
        {
            "Rating": 5,
            "Review": "The courses, faculty, resources, and community here are all wonderful. There is truly a culture throughout the university of caring about the students and doing everything possible to help them succeed. The academics are, of course, extremely challenging, but there are plenty of ways to get help and the academic faculty are always very receptive to students needing assistance. Most everyone has the drive to succeed without creating an overly competitive or cutthroat environment. Culture outside of academics - arts, music, clubs, sports - is vibrant as well.",
            "Author": "Freshman",
            "Date": "2020-06-03T19:18:19.509959Z"
        },
        {
            "Rating": 5,
            "Review": "Amazing undergraduate experience. It was difficult, but I made some of the best friends of my life. Financial aid is superb. Great diversity of ideas, races, and nationalities.",
            "Author": "Alum",
            "Date": "2020-05-12T21:08:19.599701Z"
        },
        {
            "Rating": 1,
            "Review": "After reflecting on my four year of attending, and comparing it to my graduate institutions and study abroad, I feel that Princeton leaves much to be desired for engineering/COS students. Much of the coursework will not prepare you for graduate programs. \n\nDespite doing academically well, I felt that my quality of life suffered in comparison to equally credible institutions due to an incompetent administration. I do not think that the university is a safe place. If you have a choice with another top institution, go elsewhere. The \"name\" wasn't worth it as a student or as an alumni- assuming you have a choice of another top university.",
            "Author": "Alum",
            "Date": "2020-05-04T19:52:33.849678Z"
        },
        {
            "Rating": 4,
            "Review": "It is one the leading university in the world allowing for internship and  employament on completing the study program , more opportunities to connect,network with the community where we work and live both economically and social through assistance such as grants and financial aid such as scholarship to finance your tuition and stay while at the university,the student support for the minority is good for the international student who come to study in a different cultural environment from their home country making them settle in and concentrate on their studies.The academics is very competitive,the diversity support is very good,the athlethics is very competitive,the professors highly ranked ,the dorm facilities are very good,the safety is fine,return on investment is good,the campus is fine,the party scene is good,the local area is nice,the campus food is good,student life is very satisfactory.",
            "Author": "Niche User",
            "Date": "2020-02-14T11:12:59.468888Z"
        },
        {
            "Rating": 5,
            "Review": "They are a great school. Amazing  school. I visited and I thought the campus was great. I really am hoping I can attend in the fall.",
            "Author": "Niche User",
            "Date": "2020-01-15T02:09:49.52633Z"
        },
        {
            "Rating": 5,
            "Review": "I'm only half way through my first semester and I can already tell that Princeton was the right choice for me.",
            "Author": "Freshman",
            "Date": "2019-11-02T02:38:41.499055Z"
        },
        {
            "Rating": 5,
            "Review": "I love Princeton University because, the people and professors are amazingly nice. Also the people are sometimes just too nice.",
            "Author": "Niche User",
            "Date": "2019-09-30T00:26:08.977695Z"
        },
        {
            "Rating": 5,
            "Review": "Academic resources are outstanding, and the amount of help offered students to enhance both personal and academic life is nearly overwhelming.\nClasses are challenging yet include stimulating discussion and ample opportunity to make lasting connections with peers, mentors, and professors across campus. \nStudent life is diverse and varied, allowing for nearly any club or activity to thrive if students are interested in participating.",
            "Author": "Sophomore",
            "Date": "2019-09-25T05:20:13.032599Z"
        },
        {
            "Rating": 5,
            "Review": "I greatly enjoy the overall ambience of Princeton University. The University truly offers a high quality education, especially as a result of its wonderful professors, some of which are Nobel Laureates. Moreover, the University's network allows for extensive connection between current and graduated students. This leads to great opportunities that would not necessarily be available elsewhere. Lastly, I really believe the Bridge Year program instills a humble nature in students through introducing the opportunity to volunteer for a year abroad. Doing so allows students to mature and experience other cultures prior to embarking on a difficult, yet rewarding task of attending Princeton University.",
            "Author": "Niche User",
            "Date": "2019-08-15T00:09:09.042397Z"
        },
        {
            "Rating": 4,
            "Review": "Princeton is very diverse. There are a lot of different perspectives as well. I like the amount of activities one can be involved with. The professors are very open to meeting with students for help with assignments. The campus life is great. There's always something going on that you can get involved with. The food is good too. I think Princeton would benefit from more academic support and better advisors.",
            "Author": "Sophomore",
            "Date": "2019-08-11T19:28:18.432741Z"
        },
        {
            "Rating": 5,
            "Review": "I have had such a great experience with Princeton. The professors and courses were excellent, but mostly I've been so happy to find great people all over the campus, and a community I genuinely click with.",
            "Author": "Sophomore",
            "Date": "2019-08-05T19:08:38.113446Z"
        },
        {
            "Rating": 4,
            "Review": "Challenging curriculum. Highly motivated student body. Professors are very helpful in junior and senior years but freshmen year could be isolating. Overall a wonderful experience. I will miss Princeton",
            "Author": "Senior",
            "Date": "2019-07-30T01:32:31.982913Z"
        },
        {
            "Rating": 4,
            "Review": "Princeton devotes a lot of time into its undergraduate students so the students come out with a lot and have access to a lot of resources. Academically it is challenging but you learn valuable life lessons throughout the experience and the friendships you make at the school is invaluable",
            "Author": "Junior",
            "Date": "2019-06-27T17:40:38.949686Z"
        },
        {
            "Rating": 5,
            "Review": "Having just completed my first year as an undergrad, I can truly say that attending this university is the best choice I’ve ever made. Not only are the professors incredible and the resources abundant, but I’ve made an incredible network of close friends. And, as a low-income student, I have never wanted for anything due to Princeton’s generous financial aid.",
            "Author": "Sophomore",
            "Date": "2019-06-06T15:01:30.947505Z"
        },
        {
            "Rating": 4,
            "Review": "Princeton is a very challenging school and will definitely push you both academically and mentally. I've learned a lot since coming to this school, and I am glad I chose it. However, the stress of classes and the pressure to always be doing something (during the term and the summer) is sometimes overwhelming.  But I believe the amazing opportunities (study abroad, internships, career help, funding, etc.) outweigh these grievances.",
            "Author": "Junior",
            "Date": "2019-05-29T22:39:30.240221Z"
        },
        {
            "Rating": 5,
            "Review": "It's definitely not all perfect, and is a lot of hard work to be a student here. However, Princeton has many amazing resources and I have been able to do a lot that I would not be able to elsewhere.",
            "Author": "Sophomore",
            "Date": "2019-05-29T14:38:28.956926Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton is a great college.  The student body is very diverse and there are many different clubs and activities.  The campus is also very beautiful.",
            "Author": "Niche User",
            "Date": "2019-05-24T02:15:13.462567Z"
        },
        {
            "Rating": 5,
            "Review": "The school has plenty of resources. Don't get overwhelmed by that fact. If you are blessed to go in already having an idea of what you want to do, you should be set. As for going in with no idea and trying to figure it out, you might become overwhelmed. That's normal. Good luck.",
            "Author": "Freshman",
            "Date": "2019-05-22T23:29:31.962948Z"
        },
        {
            "Rating": 5,
            "Review": "I fell in love with Princeton on my first college visit. I am an athlete and loved the academic and athletic excellence associated with Princeton.   I was accepted as part of the class of 2023 and am very excited to call Princeton home.",
            "Author": "Freshman",
            "Date": "2019-05-22T21:58:33.223588Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton is my favorite place on Earth. It's not perfect, it has room to grow to make it a better place for all students, but I believe it is working toward those gaols.",
            "Author": "Alum",
            "Date": "2019-05-21T01:44:09.164252Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton is a great school. Quite challenging but definitely worth the investment. The party scene can be quite boring at times but you should be doing your work anyways. The professors know you by name and aren't looking to kill you with work. Also, their is a real undergraduate focus at the university.",
            "Author": "Freshman",
            "Date": "2019-05-05T00:48:58.966219Z"
        },
        {
            "Rating": 4,
            "Review": "The campus is beautiful and everyone I've run into is super nice and helpful. The town surrounding the campus is awesome and there is always something to do!",
            "Author": "Niche User",
            "Date": "2019-05-01T02:09:46.903758Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton provides a great deal of support for it's students.  Class offerings are excellent and amazing faculty teach those courses.  Princeton's focus on undergraduate students makes it a special place to study.",
            "Author": "Freshman",
            "Date": "2019-02-19T04:12:48.228625Z"
        },
        {
            "Rating": 4,
            "Review": "I am currently on Princeton's Bridge Year Program and am loving the experience. Princeton seems to understand the importance of experiential education and I am learning a lot from my NGO work and the general culture and atmosphere in Jogja.",
            "Author": "Niche User",
            "Date": "2019-02-07T05:24:45.738141Z"
        },
        {
            "Rating": 5,
            "Review": "I love the diversity and the blend of liberal arts with STEM. That is why I am attending the university in the fall of 2019.",
            "Author": "Niche User",
            "Date": "2019-02-04T18:50:36.451256Z"
        },
        {
            "Rating": 5,
            "Review": "I liked the community setting, and the overall city of Princeton. It has a nice, cozy feel to it, and I'm sure that anyone who goes there will come out great",
            "Author": "Niche User",
            "Date": "2019-01-05T08:48:57.56252Z"
        },
        {
            "Rating": 4,
            "Review": "Princeton is a University that will continuously invest in you as long as you invest in yourself. It doesn’t matter your past or your situation, Princeton will be there for you through it all. With that being said, sometimes it’s difficult to find your niche within the university, it’s there but sometimes it can be a bit hidden.",
            "Author": "Freshman",
            "Date": "2018-12-28T00:32:28.85959Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton instilled in me an incredible work ethic that I don't think I could have developed anywhere else. While the coursework was always challenging and there were times I was completely exhausted, I wouldn't change it!",
            "Author": "Alum",
            "Date": "2018-12-11T22:44:40.580522Z"
        },
        {
            "Rating": 5,
            "Review": "The campus is very beautiful, it's a very studious university, so you won't be seeing a lot of partying like you would with other school, public or private.",
            "Author": "Niche User",
            "Date": "2018-10-27T04:39:33.750055Z"
        },
        {
            "Rating": 5,
            "Review": "I love the academic strength and rigor. My only problem is the party scene as I feel all groups (athletes, narps, ...) just stay together and don't really mix due to the eating club structure (as opposed to having bar-life near a college).",
            "Author": "Junior",
            "Date": "2018-08-29T06:21:53.437039Z"
        },
        {
            "Rating": 5,
            "Review": "Prestigious  Prestigious Prestigious Prestigious Prestigious Prestigious Prestigious Prestigious Prestigious Prestigious",
            "Author": "Niche User",
            "Date": "2018-08-27T01:05:34.941968Z"
        },
        {
            "Rating": 4,
            "Review": "I like the small school vibe which makes Princeton feel more tight-knit than larger universities. The residential college system also helps to promote a sense of unity among students on campus. I also think there is enough entertainment on and off campus with eating clubs on campus and NYC and Philadelphia within a train ride away from campus. However, academics can be intense and stress culture is definitely palpable, especially during midterms and finals period.",
            "Author": "Sophomore",
            "Date": "2018-08-24T13:50:19.292248Z"
        },
        {
            "Rating": 5,
            "Review": "Classes at Princeton are superb in all regards. Faculty to student ratios are very low, so students can receive a significant amount of attention from world-class professors and extremely helpful teacher assistants. The amount of resources dedicated to each student is unmatched. The alumni system is very structured, ensuring a connected student body with those in industry or academia. The campus is beautiful, showing off a gothic architecture juxtaposed with modern designs. The local area is a safe, cozy college town. The university is within an hour of New York and Philadelphia by train, but there are countless activities, clubs, and organizations to stay busy on campus. The food is relatively good and healthy. Some of the dorm conditions could be improved, but regardless the university does provide adequate housing and space for all students.",
            "Author": "Sophomore",
            "Date": "2018-08-23T01:15:07.050318Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton University is an amazing college for students. they are ranked the number one best college in the united states. their education is high quality and very renowned.",
            "Author": "Senior",
            "Date": "2018-07-26T19:36:36.798946Z"
        },
        {
            "Rating": 5,
            "Review": "Wonderful campus! The faculty and students make you feel so welcome once you enter nearly every building! Great comradery.",
            "Author": "Niche User",
            "Date": "2018-06-30T04:58:35.478554Z"
        },
        {
            "Rating": 4,
            "Review": "its pretty good, very nice town and cute shops! the dining hall food could be a lot better though. add more veggies!",
            "Author": "Freshman",
            "Date": "2018-05-17T23:36:41.491611Z"
        },
        {
            "Rating": 4,
            "Review": "Princeton University is one of the top schools in America. Not only does it provide students with a great academic life, but it also provides chances for everyone to meet new people and create a community.",
            "Author": "Niche User",
            "Date": "2018-05-05T18:15:09.806708Z"
        },
        {
            "Rating": 5,
            "Review": "As an entering student, I visited Princeton University in the middle of April. The campus is coated in blossoming trees, while the buildings are old yet renovated inside. The air is cool and moist, but not humid like southeast Texas.\n\nAnother thing I enjoy is the commitment to sustainability, especially in projects abroad and the dining hall food. The Princeton Environmental institute does classes with local farmers using a variety of methods and chefs from many culinary backgrounds.\n\nWhat I like most about Princeton is the community. My host and his friends had endless intellectual and personal discussions and readily invited me into their part of Princeton.",
            "Author": "Freshman",
            "Date": "2018-04-23T23:02:51.480973Z"
        },
        {
            "Rating": 5,
            "Review": "The students at Princeton University are so bright and are willing to share what they know with the community. The area surrounding Princeton is beautiful, and has a lot of food options. The sports aren't great, but they're still fun to go to.",
            "Author": "Niche User",
            "Date": "2018-04-16T19:37:04.151206Z"
        },
        {
            "Rating": 5,
            "Review": "Great university. Provides many research opportunities. Professors are very open and willing to meet with students after class. Would highly recommend.",
            "Author": "Niche User",
            "Date": "2018-04-10T00:00:59.853972Z"
        },
        {
            "Rating": 4,
            "Review": "Great scholarly environment. However, the fast pace makes it much more academically challenging than it needs to be.",
            "Author": "Sophomore",
            "Date": "2018-03-23T03:51:06.212386Z"
        },
        {
            "Rating": 5,
            "Review": "I have attended their campus tour and information session since I am a future applicant. I have no complaints and this is my dream school.",
            "Author": "Niche User",
            "Date": "2018-03-05T03:51:56.216435Z"
        },
        {
            "Rating": 5,
            "Review": "It is an amazing school. Visiting the campus at Princeton, and learning about its various course options is a true joy.",
            "Author": "Niche User",
            "Date": "2018-02-08T13:03:42.362454Z"
        },
        {
            "Rating": 4,
            "Review": "The campus culture here is amazing. It's rigorous academically, but the vast majority of people are supportive of each other. There is a problem with diversity - or a lack thereof - but the university and (mostly) students make support networks.",
            "Author": "Sophomore",
            "Date": "2018-01-22T03:03:10.949806Z"
        },
        {
            "Rating": 4,
            "Review": "In my experience, which has only been one semester, Princeton is a wonderful place. It has comfortable dorms, beautiful study spaces, delicious food and amazing professors. I am pursuing a BA degree rather than a BSE, and I was able to take a wide range of classes that I enjoyed. There are endless oppportunities for extra cirriculars. It is however, a stressful environment depending on how many things you decide to take on, in addition to the pressure of going to such a prestigious institution with students that have the same goals of achievement.",
            "Author": "Freshman",
            "Date": "2017-12-29T03:33:27.11168Z"
        },
        {
            "Rating": 4,
            "Review": "I found that Princeton University has a very difficult and challenging curriculum - there is no such thing as an easy major or an easy class. However, it really sets you up for the mentality that there will always be something new to learn and ways to improve yourself.",
            "Author": "Sophomore",
            "Date": "2017-08-23T20:59:24.729858Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton University is a stellar institution with a strong focus on undergraduate teaching. World class faculty are approachable and invested in the success of their undergraduate students.",
            "Author": "Freshman",
            "Date": "2017-07-22T14:32:36.250923Z"
        },
        {
            "Rating": 4,
            "Review": "The environment was such that I felt that almost any subject that I wanted to learn or investigate, I could.",
            "Author": "Alum",
            "Date": "2017-02-24T23:48:18.025279Z"
        },
        {
            "Rating": 5,
            "Review": "At Princeton University are world-class professors and facilities. Not only would you earn an excellent education and have access to a myriad of on-campus resources, you will also be surrounded by an environment rich in history, diversity, and community.",
            "Author": "Sophomore",
            "Date": "2016-12-31T07:29:46.513847Z"
        },
        {
            "Rating": 5,
            "Review": "Students are consistently motivated by high standards, enthusiasm, and responsibility from staff, faculty, and fellow students. The school provides very diverse and engaging learning and experiential opportunities that are unique to the university.",
            "Author": "Alum",
            "Date": "2016-12-30T16:40:56.146981Z"
        },
        {
            "Rating": 5,
            "Review": "Great focus on undergraduates. I loved my time at Princeton, learned a lot, and now I'm in medical school.",
            "Author": "Alum",
            "Date": "2016-12-30T00:38:01.391569Z"
        },
        {
            "Rating": 5,
            "Review": "Going into Princeton, you know it's going to be hard.  No matter where you went to high school, no matter how hard you worked, no matter how smart you are, you're going to be working really hard, and there aren't really any \"paths of least resistance.\"\n\nThat being said, Princeton is an incredible place, and probably the best undergraduate education in the country.  There is no where else where you have even nearly as much access to nobel laureates, successful businesspeople, famous lecturers or general funding as you do at Princeton.\n\nAs far as the student body, they work hard and play hard.  Everyone has a lot of work, but the students really do like to have a good time, be that through engagement in extracurricular activities or a party at one of the eating clubs.\n\nI would do it all over again, and easily would make the same decision.",
            "Author": "Senior",
            "Date": "2016-12-19T05:06:55.344932Z"
        },
        {
            "Rating": 4,
            "Review": "My experience at Princeton was wonderful. Everyone at Princeton is so humble but extremely smart and talented. It is a brilliant environment to learn in.",
            "Author": "Recent Alumnus",
            "Date": "2016-06-08T20:49:24Z"
        },
        {
            "Rating": 5,
            "Review": "Even when it is hard, you are with such an incredible group of people that the entire experience is amazing. There is room for whatever you commit to making time for - athletics, socialization, volunteering, etc.",
            "Author": "Recent Alumnus",
            "Date": "2016-05-23T15:42:45Z"
        },
        {
            "Rating": 5,
            "Review": "It's Princeton for a reason. Professors are amazing and geniuses. They are also typically very helpful and care immensely about the undergrads.",
            "Author": "College Freshman",
            "Date": "2016-03-31T17:26:48Z"
        },
        {
            "Rating": 5,
            "Review": "It is the most challenging yet most rewarding experience I have ever had. I am growing so much as a person and learning so much about myself and the world around me.",
            "Author": "College Freshman",
            "Date": "2016-03-31T17:15:29Z"
        },
        {
            "Rating": 4,
            "Review": "It is very hard and challenging but if you capitalize all of the resources available to you and learn to ask for help, you will have a much better experience. The challenges become smaller.",
            "Author": "College Sophomore",
            "Date": "2016-03-02T13:58:23Z"
        },
        {
            "Rating": 4,
            "Review": "The vibrant social life helps counterbalance the workload each week.",
            "Author": "College Freshman",
            "Date": "2016-02-17T13:25:28Z"
        },
        {
            "Rating": 5,
            "Review": "As a graduating senior, I can definitively say that my four years at Princeton have been the best four years of my life. No-loan financial aid, a wealth of quality opportunities, and the best student and faculty body I could have ever wanted combine here to make a school which has rightly been rated #1 the whole time I've been in attendance. Princeton has some of the tightest-knit and most generous alums in the world, and it's easy to see why. If you get accepted, you'd be a fool not to come.",
            "Author": "College Senior",
            "Date": "2015-11-30T02:15:54Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton is a place of incredible opportunity.  Where else could first year students learn from a Nobel laureate in a class of 25 students?  Over the past months, the integrated science curriculum at Princeton has introduced me to new subjects and ways of thinking about problems that are totally different from anything I have experienced before.  I was also impressed with how approachable faculty are and how easy it is to form relationships.",
            "Author": "College Freshman",
            "Date": "2015-10-21T01:34:31Z"
        },
        {
            "Rating": 4,
            "Review": "Like with any school, Princeton has its pros and cons. One of the best things the school has provided me with and one of the major reason's I chose it is because of its financial aid package, and the financial support it gives students in whatever endeavor you wish to pursue. Princeton has renowned professors, classes are rigorous but rewarding, the campus is beautiful and the food is excellent. On the other hand, one of the things that has frustrated me is that selectivity seems to be the rule of the game on campus beyond academics - whether its for extracurriculars which often have application processes, or socially with eating clubs. However, it is the best school in the country for a reason.",
            "Author": "College Sophomore",
            "Date": "2015-09-06T19:51:54Z"
        },
        {
            "Rating": 5,
            "Review": "It's been a dream come true! Of course I'm challenged daily socially, physically and of course, academically! That's just all a part of the fun!",
            "Author": "College Sophomore",
            "Date": "2015-08-10T00:23:04Z"
        },
        {
            "Rating": 5,
            "Review": "Literally the best university in the world, no doubt.",
            "Author": "College Freshman",
            "Date": "2015-07-24T22:39:38Z"
        },
        {
            "Rating": 4,
            "Review": "I would choose this school for many reasons, one of which being I don't think I could go to a better school for less money. Princeton is a great school but what really helped me choose this school over others was their great financial aid package. I also enjoy how Princeton feels like the best of both worlds in a way. If you like a suburban sprawling campus with a heavy focus on undergraduates (seriously, sorry potential grad students) then Princeton is definitely unique, especially when it comes to other Ivies and equally competitive universities. I like that I don't feel overshadowed by a renowned graduate school. I like that I can see new people every day but I can also recognize faces in Frist. There are things that Princeton should work on: like economic diversity (or at the least, addressing it), spiffing up cultural understanding amongst the student body and frankly changing the entire finals schedule but overall, Princeton is a pretty cool place.",
            "Author": "College Freshman",
            "Date": "2015-01-19T00:25:19Z"
        },
        {
            "Rating": 4,
            "Review": "Overall, Princeton is a really great institution that is also great for the price. Like any school, it has its shortcomings, but those are often outweighed if one thinks about the great things the school has going for it.",
            "Author": "College Freshman",
            "Date": "2015-01-18T21:51:58Z"
        },
        {
            "Rating": 3,
            "Review": "Princeton can be extremely stressful and that can impinge on your overall happiness.",
            "Author": "Recent Alumnus",
            "Date": "2014-06-27T23:52:18Z"
        },
        {
            "Rating": 5,
            "Review": "If I could do it all over again, I would choose Princeton 100% but perhaps choose a different major. It's difficult to choose your major and then you get so swept up and away by it that by the time graduation rolls around, some people think their lives would have been easier/nicer if they had chosen a different major.",
            "Author": "Recent Alumnus",
            "Date": "2014-06-17T12:55:12Z"
        },
        {
            "Rating": 3,
            "Review": "Positive, except for eating club social scene",
            "Author": "Recent Alumnus",
            "Date": "2014-04-21T15:24:02Z"
        },
        {
            "Rating": 4,
            "Review": "Great support in my department, but not the most practical.",
            "Author": "Recent Alumnus",
            "Date": "2014-04-21T15:23:31Z"
        },
        {
            "Rating": 4,
            "Review": "Great School – Princeton offers the opportunity to take classes with some really fantastic professors, as well as the chance to get to know amazing people with unique backgrounds.",
            "Author": "College Freshman",
            "Date": "2012-08-17T14:17:50.083Z"
        },
        {
            "Rating": 5,
            "Review": "My time at Princeton was and probably will be the most amazing and formational time of my life. It was like living in a magical land where everything was beautiful and easy, but that was rich rich rich with academics and innovative thinkers and interesting people to meet and things to do. I can't even really begin to explain it, but my children will be going there.",
            "Author": "Recent Alumnus",
            "Date": "2012-04-20T15:01:18.967Z"
        },
        {
            "Rating": 5,
            "Review": "Amazing Community – I love being here. You're surrounded by the best of the best and it's definitely very challenging at all levels but there is an immense sense of community that promotes working and growing together.",
            "Author": "College Freshman",
            "Date": "2012-04-17T10:42:39.91Z"
        },
        {
            "Rating": 4,
            "Review": "Fantastic Experience – The academic experience at Princeton is unparalleled, and it's incredible to be surrounded by so many bright and gifted individuals.  The social scene has been much better than anticipated, and there's always lots to do on campus and people looking to have a good time.  My only complaint is that at times the stress of the work can be overwhelming -- If you come here, be prepared to work harder than you've ever worked in your entire life (and you'll still most likely only make mediocre grades).",
            "Author": "College Junior",
            "Date": "2012-01-02T14:52:24.27Z"
        },
        {
            "Rating": 5,
            "Review": "The Best! I can't imagine being anywhere else.  I always dreamt of attending Princeton, and the experience has lived up to my expectations in every way.  The campus is beautiful and the people are diverse and interesting.  When you have time for some night life there is a wide variety of things to do.  Princeton has many Division I sporting events, there are many levels of performing arts events, and the eating clubs are the best places to party.  As an engineering student my classes are extremely challenging, but the university provides a plethora of resources to ensure academic success.  I'm working harder than I ever have in my life, and loving every minute of it.",
            "Author": "College Freshman",
            "Date": "2011-11-17T18:01:57.633Z"
        },
        {
            "Rating": 5,
            "Review": "Before arriving on campus, alumni from my neighborhood would gush over this school, returning nearly every year to reunions and proudly displaying their Princeton license plate frames and window stickers. \r\n\r\nNow that I've been here for a year, I get it. I have found amazing friends here, and have been able to pursue what I love, both academically and in my extracurricular activities. Honestly, all of my complaints about this school could be summed up in two words: grade deflation. But you can't let it consume you, and huge key to enjoying it here is finding the perfect balance between socializing and studying; it is very easy to be consumed by either. I know not everyone loves it here, to each their own, but I feel like Princeton was definitely the school for me.",
            "Author": "College Sophomore",
            "Date": "2011-08-24T14:40:08.81Z"
        },
        {
            "Rating": 4,
            "Review": "I love it here. I think Princeton has something to offer for everyone. I don't exactly have the same idea of a good time as others on this campus but I've found great people to hang out with and have fun with all the same.\r\n\r\nAcademics will suffocate you, but only if you let them. There are tons of resources available to you if you are struggling or if you just need some help with problem sets or essay writing or whatever. It's really hard to fail at Princeton. \r\n\r\nIf I could choose again, I would definitely still choose Princeton. I can't see myself anywhere else.",
            "Author": "College Sophomore",
            "Date": "2010-09-28T01:12:40.257Z"
        },
        {
            "Rating": 4,
            "Review": "You Just Gotta Love It – Even though the work is incredibly hard sometimes, they really take care of you at Princeton once you get in.  The sense of community is incredible-once you are in, you are in, and people will do everything they can to help you succeed.",
            "Author": "College Student",
            "Date": "2010-05-19T22:08:06.257Z"
        },
        {
            "Rating": 5,
            "Review": "I love everything about Princeton--the people, the classes, the campus, alumni, etc. I honestly could not see myself happier at any other university.",
            "Author": "College Student",
            "Date": "2009-12-20T04:16:06.613Z"
        }
    ],
    "Student%20Life": [
        {
            "Rating": 4,
            "Review": "I was an athlete, and I thought the overall experience was great. Sometimes there is less fan support during midterms, etc., but overall the student body is small and tight-knit, and there will almost always be friends in the stands.",
            "Author": "Recent Alumnus",
            "Date": "2016-05-23T15:45:03Z"
        },
        {
            "Rating": 2,
            "Review": "Greek life is not really recognized by the university and not really a part of student life.",
            "Author": "College Freshman",
            "Date": "2016-03-31T17:18:27Z"
        },
        {
            "Rating": 4,
            "Review": "I am a Varsity athlete and there is not a ton of support for athletics, but it is certainly a great experience.",
            "Author": "College Freshman",
            "Date": "2016-03-31T17:17:34Z"
        },
        {
            "Rating": 3,
            "Review": "There is barely any Greek life presence on campus since the University does not really recognize the groups. Most people are not involved in Greek life and it usually won't have an effect on the social scene.",
            "Author": "College Sophomore",
            "Date": "2016-03-02T14:05:34Z"
        },
        {
            "Rating": 4,
            "Review": "If we were a bigger football school with a better team, I think athletics would be more of a thing on campus among students but otherwise most other sports get a fair amount of recognition.",
            "Author": "College Sophomore",
            "Date": "2016-03-02T14:00:56Z"
        },
        {
            "Rating": 4,
            "Review": "For big games, a good amount of the student body comes out and supports the team.",
            "Author": "College Freshman",
            "Date": "2016-02-17T13:27:15Z"
        },
        {
            "Rating": 3,
            "Review": "Princeton doesn't have much of a dating culture, especially early on in college careers. That's not to say that there aren't relationships, because there are but they are less common than just hookups (whatever you perceive that to be). The guys and girls here are okay. There's a rather negative perception that all Princeton students are \"preppy\" but that's really not the case. People are pretty approachable here and although you may find that some people are a bit into themselves, there are plenty of people who are willing to talk or socialize (either platonically or romantically).",
            "Author": "College Freshman",
            "Date": "2015-01-18T23:58:25Z"
        },
        {
            "Rating": 4,
            "Review": "I was surprised by how diverse Princeton is, especially for an Ivy League. There are so many people here from so many different countries. In most of my seminars, there was a fair representation of students of color. That being said, there are still cases of intolerance that have become apparent after such incidents as Ferguson. Politically, Princeton seems to be a bit split. There's only a small portion of people that seem particularly interested in politics but those that are can find their niche in either major political ideology. Religion isn't a major major part of campus but if you're religious, there are ways to get involved. There are students who make that a big part of their campus experience. Sexual orientation is also something that seems pretty acceptable here. In terms of economic background, I think that's the most taboo thing of all. While there are several students who come from lower-income families, Princeton as a whole doesn't really address differences in lifestyles. There are several (more) students of privilege here and if you're not one of those students, it could be easy to feel left out in some ways.",
            "Author": "College Freshman",
            "Date": "2015-01-18T21:50:15Z"
        },
        {
            "Rating": 3,
            "Review": "Princeton doesn't really have Greek Life in the traditional sense. It's quite low-key and the Eating Clubs replace it in many ways- the parties occur in the Eating Clubs and they carry the same sense of exclusivity that Greek Life would. There are traces of Greek Life but as an underclassman I almost have no experience with it. Definitely not a big thing on the Princeton campus.",
            "Author": "College Freshman",
            "Date": "2015-01-18T21:17:45Z"
        },
        {
            "Rating": 3,
            "Review": "Princeton school spirit could be better. It seems as if only the Princeton University Band and the sports teams themselves really care about the athletics. Princeton isn't really big on sports but performs well against several of the other Ivies.",
            "Author": "College Freshman",
            "Date": "2015-01-18T21:11:27Z"
        },
        {
            "Rating": 4,
            "Review": "Although Greek life does not exist, eating clubs do not make you look for more.",
            "Author": "College Freshman",
            "Date": "2015-01-13T12:40:42Z"
        },
        {
            "Rating": 4,
            "Review": "The administration is mostly on your side and mainly enforces the educational aspect of things more than the social/drinking/sex/drug part. However, if you are caught with drugs you can get disciplinary action. The honor code here is unique in that none of our tests are proctored; we just sign a statement saying we upheld the honor code. But if you are found to have cheated you will get suspended, most likely.",
            "Author": "College Freshman",
            "Date": "2015-01-03T13:13:06Z"
        },
        {
            "Rating": 3,
            "Review": "our sports teams are definitely good but we don't go to the games unless it's ivyleague vs. ivyleague (like Princeton v. Yale or Princeton v Yale)",
            "Author": "College Freshman",
            "Date": "2015-01-03T13:08:44Z"
        },
        {
            "Rating": 1,
            "Review": "Overly liberal. Students are more liberal than profs",
            "Author": "College Senior",
            "Date": "2014-12-28T19:29:47Z"
        },
        {
            "Rating": 3,
            "Review": "they are okay. Decent show up for most games, bust should be more",
            "Author": "College Senior",
            "Date": "2014-12-28T19:13:52Z"
        },
        {
            "Rating": 1,
            "Review": "Social life revolves around the eating clubs at Princeton. Greek life has little to no effect.",
            "Author": "College Freshman",
            "Date": "2014-12-07T15:27:37Z"
        },
        {
            "Rating": 5,
            "Review": "It's very lenient where it should be: drinking, dorms, and social events. But it's also strict where it needs to be: the Honor Code. And most students understand and respect where the Honor Code comes from.",
            "Author": "College Freshman",
            "Date": "2014-12-07T15:24:14Z"
        },
        {
            "Rating": 3,
            "Review": "Low school spirit. Low attendance at football games. Gym is relatively small for class size.",
            "Author": "College Freshman",
            "Date": "2014-12-07T15:17:57Z"
        },
        {
            "Rating": 4,
            "Review": "I'm not much involved in the sports' life on campus but from what I've seen, there is great school spirit and put team is getting better!",
            "Author": "College Junior",
            "Date": "2014-11-27T07:35:20Z"
        },
        {
            "Rating": 3,
            "Review": "Greek life is practically non existent at Princeton.",
            "Author": "Recent Alumnus",
            "Date": "2014-11-19T17:36:16Z"
        },
        {
            "Rating": 4,
            "Review": "Our athletic facilities are great.",
            "Author": "College Sophomore",
            "Date": "2014-08-31T17:20:57Z"
        },
        {
            "Rating": 3,
            "Review": "Our greek life is pretty insignificant.",
            "Author": "College Sophomore",
            "Date": "2014-08-31T17:17:02Z"
        },
        {
            "Rating": 4,
            "Review": "Coming from a predominantly white, straight, Christian, middle-class, Republican, omnivorous area, I thought it was so interesting to suddenly be surrounded by all sorts of ethnicities, sexual identities, religions, economic backgrounds, and mostly Democrats. It has been an amazing learning experience for me. However, I have heard from a few people who identify as queer that the campus is not entirely receptive to people trying to come out.",
            "Author": "College Sophomore",
            "Date": "2014-07-29T19:48:00Z"
        },
        {
            "Rating": 4,
            "Review": "The Honor Code is taken super seriously here, but then some things are very easy to get away with. Unless you are in substance-free housing, it is typically okay to have alcohol in your dorm. As far as underage drinking goes, you only have to be 18 to get into the Eating Clubs, and from there they don't ID anyone for beer. Even if someone underage gets drunk and has to go to McCosh (the clinic on campus), they don't punish them for being underage. They want people to feel comfortable getting professional help when drunk rather than being afraid of the consequences of being underaged and risking major health issues.",
            "Author": "College Sophomore",
            "Date": "2014-07-29T19:45:32Z"
        },
        {
            "Rating": 4,
            "Review": "Our varsity football/basketball teams aren't very important to the Princeton experience, unlike some other colleges. I know more people on Sprint Football and other club/intramural teams than I do varsity athletes, except for crew. Everyone does crew.",
            "Author": "College Sophomore",
            "Date": "2014-07-29T19:41:46Z"
        },
        {
            "Rating": 3,
            "Review": "Many people here are preppy, as the average income here is quite high. But that doesn't mean they aren't friendly! As far as attractiveness goes, it kind of varies. There are some gorgeous guys, but a large majority of the population is less than desirable. BUT! It's Princeton, so you know everyone is smart and probably going to make a lot of money in the future.",
            "Author": "College Sophomore",
            "Date": "2014-07-29T19:31:33Z"
        },
        {
            "Rating": 5,
            "Review": "There are tons of athletic opportunities on campus for people of every interest and level.",
            "Author": "College Junior",
            "Date": "2014-07-11T00:01:55Z"
        },
        {
            "Rating": 4,
            "Review": "There is a lot of diversity on campus, and I've enjoyed getting to know people from very different backgrounds from me and with very different interests from mine.",
            "Author": "College Junior",
            "Date": "2014-07-11T00:00:08Z"
        },
        {
            "Rating": 3,
            "Review": "Greek life barely affects the social scene.  Instead, the eating clubs dominate.",
            "Author": "College Junior",
            "Date": "2014-07-10T23:59:01Z"
        },
        {
            "Rating": 5,
            "Review": "They have a safety first policy, which is excellent.  If you bring someone to the health center who has had too much to drink, there is no punishment.",
            "Author": "College Junior",
            "Date": "2014-07-10T23:55:53Z"
        },
        {
            "Rating": 2,
            "Review": "Princeton needs more true diversity.",
            "Author": "Recent Alumnus",
            "Date": "2014-06-28T00:01:06Z"
        },
        {
            "Rating": 5,
            "Review": "Public safety is pretty chill and there are almost no consequences for drinking",
            "Author": "Recent Alumnus",
            "Date": "2014-06-27T23:57:06Z"
        },
        {
            "Rating": 4,
            "Review": "The amount of attention and success is sport-dependent.",
            "Author": "Recent Alumnus",
            "Date": "2014-06-17T12:46:47Z"
        },
        {
            "Rating": 3,
            "Review": "There are many different types of people at Princeton, and I am sure that if you are looking for a significant other, you will find him/her.",
            "Author": "Recent Alumnus",
            "Date": "2014-06-17T12:40:09Z"
        },
        {
            "Rating": 3,
            "Review": "I am not really that sure because I am not all into sports...",
            "Author": "College Freshman",
            "Date": "2014-05-19T04:06:55Z"
        },
        {
            "Rating": 4,
            "Review": "Our campus it very diverse. There are people from different backgrounds, religion, sexual orientation, etc.",
            "Author": "College Freshman",
            "Date": "2014-05-19T04:06:09Z"
        },
        {
            "Rating": 3,
            "Review": "They all dress pretty rich.... It is an ivy league...",
            "Author": "College Freshman",
            "Date": "2014-05-19T03:57:55Z"
        },
        {
            "Rating": 3,
            "Review": "The hookup culture is a problem here",
            "Author": "College Sophomore",
            "Date": "2014-04-26T13:57:46Z"
        },
        {
            "Rating": 3,
            "Review": "Club tennis was a little lacking",
            "Author": "Recent Alumnus",
            "Date": "2014-04-21T15:24:27Z"
        },
        {
            "Rating": 3,
            "Review": "There's a sprinkling of everyone, but not enough for it to really be a comfortable environment.",
            "Author": "College Sophomore",
            "Date": "2014-03-31T17:04:01Z"
        },
        {
            "Rating": 4,
            "Review": "There seems to be a wide diversity of beliefs, socio-economic class, and race here.",
            "Author": "College Freshman",
            "Date": "2014-03-25T21:54:41Z"
        },
        {
            "Rating": 2,
            "Review": "Greek life is pretty non-existant. Apparently there at 12 Frats, but only two are considered \"cool.\" Most people see Frats/sororities as a gateway to a certain more exclusive eating club.",
            "Author": "College Freshman",
            "Date": "2014-03-25T21:51:57Z"
        },
        {
            "Rating": 4,
            "Review": "pretty much the only thing the school actually gets mad about is drugs other than alcohol--if someone files a noise complaint about a party in your room and public safety comes and you have alcohol, they won't care, you only get in trouble if you're rude to the officers.",
            "Author": "College Freshman",
            "Date": "2014-01-03T21:42:08Z"
        },
        {
            "Rating": 4,
            "Review": "People are really passionate about what they do, and club sports are a great way of meeting people",
            "Author": "College Freshman",
            "Date": "2014-01-03T21:36:22Z"
        },
        {
            "Rating": 4,
            "Review": "people are super diverse and i have yet to hear of anyone being unaccepting",
            "Author": "College Freshman",
            "Date": "2014-01-03T21:27:37Z"
        },
        {
            "Rating": 5,
            "Review": "People are really normal, but people rarely go out more than twice a week",
            "Author": "College Freshman",
            "Date": "2014-01-03T21:26:37Z"
        },
        {
            "Rating": 4,
            "Review": "Most people join to meet upperclassmen in eating clubs",
            "Author": "College Freshman",
            "Date": "2014-01-03T21:25:03Z"
        },
        {
            "Rating": 4,
            "Review": "Most people are very friendly and helpful and want to get to know you.",
            "Author": "College Freshman",
            "Date": "2013-11-04T20:03:33Z"
        },
        {
            "Rating": 3,
            "Review": "Varsity sports are paid attention to when Princeton plays the big Ivies. Students not in Varsity sports can still participate in as much as they want.",
            "Author": "College Freshman",
            "Date": "2013-11-04T20:02:06Z"
        },
        {
            "Rating": 4,
            "Review": "The University has worked very hard to diversify the school by bringing in many international students and students from all over the country.",
            "Author": "College Freshman",
            "Date": "2013-11-04T19:51:29Z"
        },
        {
            "Rating": 5,
            "Review": "The University is very lenient towards alcohol. The University is only concerned with students' safety and you won't get in trouble for calling for help for a friend in trouble. They will actually email you thanking you the next day.",
            "Author": "College Freshman",
            "Date": "2013-11-04T19:45:57Z"
        },
        {
            "Rating": 1,
            "Review": "Right now Greek life is pretty underground after the University made it against the rules for freshman to even be in a Greek house. The Greeks are not recognized by the University at this time.",
            "Author": "College Freshman",
            "Date": "2013-11-04T19:41:53Z"
        },
        {
            "Rating": 3,
            "Review": "I feel comfortable with the amount of minority students here, whether it's ethnic, racial, or sexual minorities. However, the atmosphere isn't as welcoming at times. As with most elite universities, Princeton is a predominantly white institution. However, students do make good friendships with people of other races. After being here for a year, I'm able to detect more atheism and prejudice (but that's just a relatively small amount of people).",
            "Author": "College Sophomore",
            "Date": "2013-10-14T14:58:50Z"
        },
        {
            "Rating": 3,
            "Review": "Social life gets monotonous sometimes... work hard all week, drink a lot Thurs/Sat nights, stay up late Sunday catching up on work, wash, rinse, repeat.",
            "Author": "College Junior",
            "Date": "2013-07-19T22:46:31.13Z"
        },
        {
            "Rating": 4,
            "Review": "There are all sorts of people here.  Lots of diversity.",
            "Author": "College Freshman",
            "Date": "2013-04-16T14:08:14.253Z"
        },
        {
            "Rating": 5,
            "Review": "Great sense of community on teams, and everyone loves to cheer them on!",
            "Author": "Recent Alumnus",
            "Date": "2013-03-20T11:13:18.61Z"
        },
        {
            "Rating": 3,
            "Review": "The sports are decent here but not a huge part of campus life. If you're interested in going to games, you can go but it's not central to campus life. This can be a huge plus if you're too interested but a bummer if you're looking for sports to be the center of your campus experience.",
            "Author": "College Sophomore",
            "Date": "2013-01-16T13:30:21.423Z"
        },
        {
            "Rating": 5,
            "Review": "A variety of students from different backgrounds, making my campus experience very valuable to how I interact with people and how I see the world.",
            "Author": "College Sophomore",
            "Date": "2013-01-16T13:26:43.693Z"
        },
        {
            "Rating": 4,
            "Review": "Frankly, there can sometimes be a frustrating indifference in the general student body when it comes to school spirit in athletics.  There is generally great support for the basketball teams, both men and women, and spirit is likely at an all-time high after beating Harvard and Yale at football.  There is a great intramural program and the athletic facilities open to student are world-class.",
            "Author": "College Freshman",
            "Date": "2013-01-04T15:03:28.72Z"
        },
        {
            "Rating": 5,
            "Review": "Tons of Different Backgrounds – Yes there is a lot of representation from upper class white kids and studious asians, stereotypical to an ivy league school. But every day I am amazed by the interesting people I have met on campus; I've met a computer-programming musician from the Middle East, an athlete drafted by a professional team who decided to complete an electrical engineering degree before he turns pro, and a small-town farmer who happens to speak three languages. This mixture of people from so many unique backgrounds is a huge reason why I love this school so much.",
            "Author": "College Junior",
            "Date": "2012-08-29T21:38:59.633Z"
        },
        {
            "Rating": 5,
            "Review": "Melting Pot – Princeton is much more diverse than my hometown.  We get a lot of really amazing international students, as well as a wide range of economic backgrounds.  Princeton gives great financial aid to those who need it.  Everyone is very accepting of different beliefs and very open to discuss their opinions constructively with you!",
            "Author": "College Sophomore",
            "Date": "2012-08-06T23:17:03.417Z"
        },
        {
            "Rating": 4,
            "Review": "We Try – In the Ivy League our teams are pretty good. But the big attractions at most schools (football and basketball) aren't very good.  There isn't much spirit because our teams don't do too well.  Unless you are into preppy sports like crew or lacrosse, the athletics scene is boring.  We do however have club sports that pretty much anybody could join and that's fun.  We also have recreational events like a massive dodgeball tournament and they are lots of fun and get everybody involved.  Upside is because our teams aren't that good, athletes are nice and don't walk around like they own the world.",
            "Author": "College Junior",
            "Date": "2012-08-05T21:22:58.56Z"
        },
        {
            "Rating": 4,
            "Review": "Do Whatever So Long as Its Not Cheating – Princeton really doesn't care what you do.  Distribution requirements are very lenient.  For example, everyone has to take a quantitative reasoning class (QR), but this could be anything from linear algebra to astronomy.  Princeton has lots of rules that nobody follows and nobody cares about.  Underage drinking is rampant, but the University cares more about people's health and safety than about enforcing the rules.  Therefore nobody gets in trouble for drinking if you have to call the ambulance for a severely drunk friend.  The only thing Princeton is really strict about is cheating.  We all sign an honor code and its a big source of pride that students follow it and also report any student that is not abiding by it.  Students are on their honor to do their work and faculty are not going to baby sit, but if someone is caught, they will be forced to take a year off.",
            "Author": "College Junior",
            "Date": "2012-08-05T21:00:44.42Z"
        },
        {
            "Rating": 3,
            "Review": "Grade Deflation and Honor System – The honor system at Princeton is seriously flawed. The way in which students are \"tried\" is a really strange process. Honestly, if you are put before the honor committee, you know you are going to get suspended. It's a bit of a Kangaroo court. The university does not take intention into account when prosecuting people. Someone who intended to cheat gets the same treatment as someone who accidentally plagiarized. It's very off putting. \r\n\r\nAdditionally, the grade deflation policy stresses students out unnecessarily.",
            "Author": "Recent Alumnus",
            "Date": "2012-07-20T13:02:36.07Z"
        },
        {
            "Rating": 3,
            "Review": "School Spirit but We Don't Win – We have alot of school spirit but we don't always win. Overall our athletes are students before they are athletes so we car emore about their academic performance. It would be great if we could have a fire, though, before I graduate but only if we beat Harvard and Yale in the same season.",
            "Author": "College Freshman",
            "Date": "2012-06-28T11:59:24.26Z"
        },
        {
            "Rating": 5,
            "Review": "Good Looking Campus – People care about their looks here. Most workout and go to the gym regularly.",
            "Author": "College Freshman",
            "Date": "2012-05-30T00:27:18.957Z"
        },
        {
            "Rating": 5,
            "Review": "Everything Is Here – Historically, Harvard, Yale, and Princeton lacked diversity. Princeton has tried to change that in a fundamental and profound manner. There is an incredible amount of diversity (all types, from racial to political) here.",
            "Author": "College Freshman",
            "Date": "2012-05-30T00:21:08.02Z"
        },
        {
            "Rating": 4,
            "Review": "Understanding Administration – The Administration cares most about student safety. McCosh has entire amnesty programs for the few who drink excessively and seek medical treatment.",
            "Author": "College Freshman",
            "Date": "2012-05-30T00:15:55.67Z"
        },
        {
            "Rating": 4,
            "Review": "Stanford of the Ivies – Princeton does very well in sports. Whenever we beat Harvard and Yale in football for a season, we have a huge bonfire. Basketball is becoming bigger on campus. Generally, we are very competitive in the Ivy League and lots of kids attend games against Harvard and Yale.",
            "Author": "College Freshman",
            "Date": "2012-05-30T00:09:21.053Z"
        },
        {
            "Rating": 3,
            "Review": "It's Okay. I am not really involved in the athletics at Princeton. However, we have dedicated teams and coaches and the university is also very spirited and supported of groups, from football to the squash team.",
            "Author": "College Freshman",
            "Date": "2012-05-21T01:04:49.457Z"
        },
        {
            "Rating": 5,
            "Review": "I love the whole scene at Princeton, probably because of the diversity of the student body.  You have people from around the world, rich and poor, all beautiful in their own way.  I cannot judge someone on their looks alone, and everyone here has something that makes them unique and attractive.",
            "Author": "College Freshman",
            "Date": "2012-05-09T14:03:45.847Z"
        },
        {
            "Rating": 3,
            "Review": "Great Participation – Princeton may not have the best sports teams in Divison I, but over half of the student population is involved in one sport or another.  The student body is very supportive of the various teams and some of them had very successful seasons this past year.  The Men's Squash team won the national championship in February, and the Women's Basketball team went went to the NCAA Regionals ranked 24th in the nation.  This was the first time any Ivy League women's sports team had ever been nationally ranked.  Sports plays a huge role in student life at Princeton.",
            "Author": "College Freshman",
            "Date": "2012-05-09T13:32:07.587Z"
        },
        {
            "Rating": 4,
            "Review": "Student Involvement – Over half of the student body at Princeton participate in varsity sports. Most other students can be found cheering the team on or participating in some of the intra-mural sports.",
            "Author": "College Student",
            "Date": "2012-02-15T18:38:08.29Z"
        },
        {
            "Rating": 4,
            "Review": "There If You Need Them – I think the party scene at Princeton is great.  In my short time here I haven't witnessed any campus police involvement.  Most students are expected to act responsibly and all freshman are required to complete an alcohol education program.  Drug use is not tolerated.",
            "Author": "College Freshman",
            "Date": "2011-11-17T17:48:50.713Z"
        },
        {
            "Rating": 5,
            "Review": "There are so many people of different races, nationalities, backgrounds, religions, etc, here that it's impossible to not have a diverse group of friends. It's really amazing. Only exception is probably LGBT life - it doesn't seem like the sense of the gay community is as strong as it is at other schools.",
            "Author": "College Freshman",
            "Date": "2011-10-20T20:49:14.87Z"
        },
        {
            "Rating": 4,
            "Review": "There are students of many different nationalities, ethnicities, locations and cultural backgrounds here at Princeton. Students commonly interact with others from different backgrounds, and I have learned a lot about cultures other than my own during my time here.",
            "Author": "College Sophomore",
            "Date": "2011-10-16T21:25:37.503Z"
        },
        {
            "Rating": 3,
            "Review": "Unless You Are Caught Cheating, Pretty Hard to Get in Trouble – The penalty for cheating is very very strict--even small instances of plagiarism or copying a homework problem can get you suspended for a year or even expelled. Otherwise, just be careful; lay low if you're trying to serve to minors and don't drink outside and you're good.",
            "Author": "College Sophomore",
            "Date": "2011-09-02T22:24:43.37Z"
        },
        {
            "Rating": 3,
            "Review": "Grade Deflation -- to Bitch or Not to Bitch? You will get lower grades than you expect. Some people hate that. I like it, it means more when I get A's now.",
            "Author": "College Junior",
            "Date": "2011-06-30T19:28:03.92Z"
        },
        {
            "Rating": 3,
            "Review": "Fun to Do, but Definitely Not Required – The University doesn't actually recognize Greek Life on campus, which is kind of a pain because it always seems like the school is out to get Fraternities and Sororities.  The Eating Clubs really dominate the social scene, therefore most Fraternity/Sorority events end up being dorm room parties before heading out to the Eating Clubs.  They are a great network to meet other interesting and fun people, and can help members get into particular eating clubs their sophomore year.  Other than that, they definitely aren't a necessity, and a large portion of the campus decides not to join them and still participates in the eating club drinking scene.",
            "Author": "College Sophomore",
            "Date": "2011-02-02T20:20:12.327Z"
        },
        {
            "Rating": 4,
            "Review": "Walked on-to Varsity Crew without ever rowing a boat in my life before. Lots of opportunities. NOt a huge student fan base but still a decent, fun size.",
            "Author": "College Freshman",
            "Date": "2010-11-05T01:46:32.383Z"
        },
        {
            "Rating": 4,
            "Review": "A lot of people that truly are diverse start to act the \"Ivy League\" type. However, there are seriously people from all backgrounds here.",
            "Author": "College Freshman",
            "Date": "2010-11-05T01:41:34.973Z"
        },
        {
            "Rating": 2,
            "Review": "P-Safe Can Be Tough – Public safety, if they catch you, will be strict. While you are safe on the Street or walking around campus drunk, DO NOT ever drink outside. Drinking in your room is safe, provided you are never caught with a drink in your hand. As for parties in dorms, make sure that there are no drugs (if drugs are found, everyone at the party gets punished), but feel safe going to one. P-safe doesn't come too often, usually only in cases of extreme noise. Just don't get caught with a drink in your hand, and you are fine.",
            "Author": "College Sophomore",
            "Date": "2010-08-20T23:41:12.13Z"
        },
        {
            "Rating": 3,
            "Review": "Eating Clubs – There is no official greek life at Princeton; the University doesn't support any sororities or fraternities.  The closest thing to greek life would probably be the eating clubs, which don't seem to be as negative, but can still be pretty rough if you bicker.  All in all, only about half of the upperclassmen are in eating clubs, although pretty much everyone has been to one at least once.",
            "Author": "College Student",
            "Date": "2010-05-19T22:02:15.437Z"
        },
        {
            "Rating": 3,
            "Review": "Mens Sana in Corpore Sano – Students at Princeton may not be the most avid or raucous of sports fans but they do rock the Orange and Black like it's Halloween on game day. Also men's football and basketball have a substantial following. Participation in the intramural leagues is very impressive.",
            "Author": "College Freshman",
            "Date": "2010-02-09T15:26:26.243Z"
        },
        {
            "Rating": 5,
            "Review": "All Colors, Classes and Creeds – Princeton is wildly diverse; this Ivory Tower looks like it's been dropped into New York's Hell's Kitchen. Asians and whites dominate but Princeton claims representation from every crook and cranny of the globe. You'll also find every milestone on the spectrum of religious, sexual and political orientation dining and learning together.",
            "Author": "College Freshman",
            "Date": "2010-02-09T14:28:35.26Z"
        },
        {
            "Rating": 3,
            "Review": "Severe but Fair – Don't get caught serving to minors; that could result in a few crushed skulls. However, strictness isn't a headache when it comes to drinking. Just keep a level head and don't be loud. However, academic violations are met with a hailstorm of wrath at Princeton. Honor Code violations will result in expulsion or suspension.",
            "Author": "College Freshman",
            "Date": "2010-02-09T13:51:44.203Z"
        },
        {
            "Rating": 3,
            "Review": "Guys and Girls – There are a bevy of cute girls at Princeton; however you'll never see more than a handful crawling out of the woodwork during the day. During the night though you see a pretty eclectic range of lookers from leggy blondes to ample-figured brunettes. That being said the average girl is exactly that: average.\r\n\r\nThe guys are pretty much the same; some would say a marginally better crop than the girls.",
            "Author": "College Freshman",
            "Date": "2010-02-09T13:41:01.063Z"
        },
        {
            "Rating": 3,
            "Review": "Alumni Spirit – Current Princeton undergraduates don't typically go to every athletic event on campus, however, they always sport their orange and black shirts, scarves, sweatshirts, etc all over campus. The athletic facilities are all state-of-the-art and are fantastic. If anything, it seems like Princeton alumni care more about some sporting events than students.",
            "Author": "College Student",
            "Date": "2009-12-20T04:06:45.947Z"
        },
        {
            "Rating": 4,
            "Review": "Lots of Different Backgrounds – While there may be somewhat of a divide between students of different economic backgrounds, there is an amazing amount of students from all over the world, from everywhere in the United States, and from all different sorts of backgrounds.",
            "Author": "College Student",
            "Date": "2009-12-20T04:03:00.283Z"
        }
    ],
    "Academics": [
        {
            "Rating": 4,
            "Review": "It's pretty great. World class. The workload can be pretty stressful.",
            "Author": "College Freshman",
            "Date": "2015-01-18T21:37:56Z"
        },
        {
            "Rating": 5,
            "Review": "The professors are definitely experts in their field. The professors I have had so far are enthusiastic about what they teach and give honest feedback. Grading at Princeton is notoriously \"strict\" when compared to other Ivies but that's just what comes with attending this school. It can be pretty stressful at times but student organizations seem to be making an effort to make it more manageable. There are several classes one can take and although Princeton doesn't offer majors in things like Theater or African American Studies, one can get certificates in these fields. Many people study in Firestone or the work spaces of their individual res colleges.",
            "Author": "College Freshman",
            "Date": "2015-01-18T21:02:10Z"
        },
        {
            "Rating": 5,
            "Review": "The school offers the best undergraduate education.",
            "Author": "College Freshman",
            "Date": "2015-01-13T12:42:16Z"
        },
        {
            "Rating": 4,
            "Review": "I placed out of a lot of my pre-req classes with AP credit and placement tests. You have to choose your major in sophomore year spring semester, and as a freshman I still feel in the dark about what I am supposed to be doing exactly. and what the timeline for these things are. Especially for certificate programs.",
            "Author": "College Freshman",
            "Date": "2015-01-03T13:14:50Z"
        },
        {
            "Rating": 5,
            "Review": "We have some of the best professors and top individuals in their field teaching our courses. The introductory computer science class is also one of the best classes. Workload for engineers and STEM students is significantly more than other majors. We stay up very late most nights working.",
            "Author": "College Freshman",
            "Date": "2014-12-07T15:22:34Z"
        },
        {
            "Rating": 4,
            "Review": "I have not had an internship yet through the school mainly because I did not take advantage of the opportunities around me and did not go to career service for help. I do plan to have one this summer and do not have any concerns finding one.",
            "Author": "College Junior",
            "Date": "2014-11-27T07:46:11Z"
        },
        {
            "Rating": 5,
            "Review": "There are so many opportunities to take advantage of especially if you are pre-med. The downside is that pre-meds at my school are very competitive and would kill for an A so if you are in a class with lots of pre-med beware that the curve might not work in your favor!",
            "Author": "College Junior",
            "Date": "2014-11-27T07:37:24Z"
        },
        {
            "Rating": 4,
            "Review": "The biggest difficulty was feeling like I was behind with my preparation.",
            "Author": "College Sophomore",
            "Date": "2014-08-31T17:16:26Z"
        },
        {
            "Rating": 3,
            "Review": "The workload is very intense.",
            "Author": "College Sophomore",
            "Date": "2014-08-31T17:16:26Z"
        },
        {
            "Rating": 5,
            "Review": "My department is very small, and I am on a first name basis with most of my professors, which is really nice.",
            "Author": "College Junior",
            "Date": "2014-07-10T23:57:23Z"
        },
        {
            "Rating": 5,
            "Review": "The professors are (overall) excellent.  Courses are easy to register for, and professors are very accessible.",
            "Author": "College Junior",
            "Date": "2014-07-10T23:57:23Z"
        },
        {
            "Rating": 4,
            "Review": "The anthropology department is very welcoming and enjoyable",
            "Author": "Recent Alumnus",
            "Date": "2014-06-27T23:59:53Z"
        },
        {
            "Rating": 5,
            "Review": "Honestly, it's so selective that the most qualified of candidates could potentially not get it. I would suggest participating in activities you love and not because you want to get into PU. It is better to do a couple things well for a long time than to do a mediocre job at many things.",
            "Author": "Recent Alumnus",
            "Date": "2014-06-17T12:55:12Z"
        },
        {
            "Rating": 4,
            "Review": "Like I mentioned previously, the classes are pretty challenging and you get tons of work everyday, but then again, it is an ivy league...",
            "Author": "College Freshman",
            "Date": "2014-05-19T04:00:55Z"
        },
        {
            "Rating": 3,
            "Review": "The classes are pretty rigorous but I guess it is worth it in the end...",
            "Author": "College Freshman",
            "Date": "2014-05-19T04:00:55Z"
        },
        {
            "Rating": 4,
            "Review": "I would have appreciated more support from my department regarding grad school and careers.",
            "Author": "Recent Alumnus",
            "Date": "2014-04-21T15:23:31Z"
        },
        {
            "Rating": 5,
            "Review": "...everything is amazing academically, but the work is even harder than you might expect.",
            "Author": "College Freshman",
            "Date": "2014-01-03T21:28:27Z"
        },
        {
            "Rating": 5,
            "Review": "Every topic pretty much ever with the top professors in the field.  pretty much anything you want to do, you can.",
            "Author": "College Freshman",
            "Date": "2014-01-03T21:28:27Z"
        },
        {
            "Rating": 4,
            "Review": "Study areas are abundant and perfect. Workload is particularly heavy but manageable if you know your work habits and how to manage time.",
            "Author": "College Freshman",
            "Date": "2013-11-04T19:48:48Z"
        },
        {
            "Rating": 5,
            "Review": "#1 ranked for many reasons.",
            "Author": "College Freshman",
            "Date": "2013-11-04T19:48:47Z"
        },
        {
            "Rating": 5,
            "Review": "Admissions is a game of luck if you have the same numbers as every one else. Make sure the essays are really good.",
            "Author": "College Freshman",
            "Date": "2013-11-04T18:21:24Z"
        },
        {
            "Rating": 5,
            "Review": "Princeternships matches you with an alumni who is in a field you are interested in. There are also plenty of abroad internships available. I plan on doing an abroad internship.",
            "Author": "College Freshman",
            "Date": "2013-11-04T18:21:24Z"
        },
        {
            "Rating": 5,
            "Review": "The Mechanical and Aerospace Engineering department from Princeton is the best. The professors are all leaders in their field, and the department is small enough that there is a strong sense of community, not cut throat at all. It's a ton of work though, you really have to love engineering it for it to be worth it!",
            "Author": "College Senior",
            "Date": "2013-06-12T23:41:39.19Z"
        },
        {
            "Rating": 5,
            "Review": "No difficulties getting into my program here.  No application process, other than being accepted to the school.",
            "Author": "College Freshman",
            "Date": "2013-04-16T14:12:02.593Z"
        },
        {
            "Rating": 3,
            "Review": "For my major and minor, most initial internships I'll have will be unpaid but good experience.",
            "Author": "College Freshman",
            "Date": "2013-04-16T14:10:28.197Z"
        },
        {
            "Rating": 4,
            "Review": "I am very happy in my program.  If I could do it all over again, I would because I really enjoy learning.",
            "Author": "College Freshman",
            "Date": "2013-04-16T14:06:48.98Z"
        },
        {
            "Rating": 3,
            "Review": "I am a music major. I don't have a problem with the Department of Music; however, my issue is that I took a big risk by starting with the prerequisite for music majors. I quickly realised that my high school did not give me adequate preparation for my major; just basic college success. Now that I look back, I know that I should have spent this year on the two basic music courses and then proceeded further. (If any of you are wondering, MUS 103 and 104 are the simpler, more basic classes; MUS 105 and 106 are the prerequisites for majoring in music).\r\nMy hope was to become skilled in songwriting and composition, but you have to have adequate experience before entering the field here. (Not just in courses, but even performance ensembles, as well.)\r\nRight now, I'm not as concerned about finding a job as I am with developing my skills.",
            "Author": "College Freshman",
            "Date": "2013-04-01T11:14:50.24Z"
        },
        {
            "Rating": 4,
            "Review": "I'm an engineering student. The work is rigorous and most classes the first two years are requirements.",
            "Author": "College Freshman",
            "Date": "2013-01-20T17:27:14.223Z"
        },
        {
            "Rating": 4,
            "Review": "Becoming an Anthropology major was pretty easy. You declare a major at the end of sophomore year and if you've taken a couple intro classes, you're accepted into the program. The department representatives are really generous and understanding. Their advice is truly invaluable.",
            "Author": "College Junior",
            "Date": "2012-09-27T17:30:35.77Z"
        },
        {
            "Rating": 4,
            "Review": "For the Most Part, Tons of Flexibility and Options – As an engineer, my process with dealing with majors is quite different from the majority of the students here. Even though I am a sophomore, I have already declared my major, and since I knew what I wanted to do before arriving, it was not a problem for me. But if you want to be an engineer, or are even considering an engineering major, make sure you are in the BSE program, or at least taking the prerequisites the very first semester. It is not difficult to switch out of engineering; nearly impossible to switch into it.",
            "Author": "College Junior",
            "Date": "2012-08-29T21:25:02.49Z"
        },
        {
            "Rating": 3,
            "Review": "Its Just Really Hard – Professors are inaccessible but super knowledgeable. \r\nCurriculum is great.  You are very prepared to engage in the real world with the things you learn\r\nRegistration is simple.  \r\nWork never stops.  The load really is ridiculous but what did you expect?\r\nEvery body wants to be an economics major.  Woodrow Wilson school of public affairs is also very popular.  Special study options almost never happen.",
            "Author": "College Junior",
            "Date": "2012-08-05T21:18:20.587Z"
        },
        {
            "Rating": 3,
            "Review": "Just Average, Way Below What You'd Expect from the Best – The best way I can describe my attitude towards academics at Princeton is disappointment.  If you are not the top 5% (and its really hard to be there even if you are hard working, interested, and ambitious simply because you are in a tough pool at Princeton) you don't exist.  We might have world renown faculty but for some of them you need to sign up weeks in advance to get an office hours appointment.  Many are absolute experts in their field and have no idea how to communicate that knowledge to fresh undergrads.  Some are just eccentric and others cocky. A few are genuinely nice and interested in your progress and growth.  When you find these do all you can to keep in touch with them.  Taking smaller classes and seminars is the best way to overcome this.",
            "Author": "College Junior",
            "Date": "2012-08-05T21:08:47.013Z"
        },
        {
            "Rating": 4,
            "Review": "Hard but Rewarding – The engineers at Princeton are super smart (as are most students across all majors) so sometimes it is a little intimidating to be surrounded by such intelligent peers.  But for the most part engineers are not stuck up.  There are good and bad professors but I would not change my major if I could.  I hope to work in sustainable development in the third world, and perhaps go to architecture school eventually.",
            "Author": "College Junior",
            "Date": "2012-07-10T11:51:21.72Z"
        },
        {
            "Rating": 4,
            "Review": "Every Class Imaginable – Every major and class is offered with versatile instruction as well as incredible professor. The classes range from 12 person seminars to 300 person lectures but in all cases you are able to feel close with preceptors, TAs and/or professors.",
            "Author": "College Sophomore",
            "Date": "2012-07-09T22:05:47.257Z"
        },
        {
            "Rating": 4,
            "Review": "Relatively Easy – It was a hard choice, but the Administration was very supportive and hosted many talks. I went to dinner with my advisor, a Professor, to talk about it further.",
            "Author": "College Freshman",
            "Date": "2012-05-30T00:28:49.873Z"
        },
        {
            "Rating": 5,
            "Review": "A Plethora of Opportunities – Princeton has an incredibly loyal alumni base. To get all my internships, I relied upon it. It is called TigerTracks.",
            "Author": "College Freshman",
            "Date": "2012-05-30T00:22:47.077Z"
        },
        {
            "Rating": 5,
            "Review": "Choices...Few but Great – There are not many majors at Princeton but it's because they are teaching the skill sets necessary to go into the real world. It may seem that it's tough to find what you want to major in but you are really prepared to do whatever you want in the future.",
            "Author": "College Freshman",
            "Date": "2012-04-17T10:45:57.183Z"
        },
        {
            "Rating": 5,
            "Review": "Nation's Finest – It's hard to get much better academic focus than Princeton University.  Because there doesn't exist much of a graduate school (no law, medicine, business schools) all of the professors are there primarily to teach which leads to a fantastic undergraduate experience.  Taking classes with professors who are known worldwide for their expertise on a subject is something that you simply can't get very many other places.  Be ready to work incredibly hard and only get mediocre grades at best, however, as the grade deflation policy really makes early A's extremely difficult.",
            "Author": "College Junior",
            "Date": "2012-01-02T12:37:23.47Z"
        },
        {
            "Rating": 4,
            "Review": "Politics Major – One of the largest departments at Princeton, but also one of the best.",
            "Author": "College Junior",
            "Date": "2011-08-22T23:39:22.607Z"
        },
        {
            "Rating": 4,
            "Review": "Difficult, but Rewarding – Princeton gives the rare opportunity to study with incredibly talented faculty. The work provides a challenge that can be stressful, but always rewarding.",
            "Author": "College Junior",
            "Date": "2011-08-21T23:58:40.373Z"
        },
        {
            "Rating": 5,
            "Review": "The great thing about Princeton is that it really is like a liberal arts college within a major university. The faculty are accessible to undergrads, particularly because of undergrad independent work.",
            "Author": "College Sophomore",
            "Date": "2011-07-14T17:32:27.493Z"
        },
        {
            "Rating": 4,
            "Review": "Ok, so maybe I pull an all nighter a week to get everything done, but it's so worth it. Brilliant teachers sit and discuss books with bright and assertive students -- I'm in heaven.",
            "Author": "College Junior",
            "Date": "2011-06-30T19:23:03.733Z"
        },
        {
            "Rating": 5,
            "Review": "I Learned Good Here – But really, the academics are top-notch. Why is Princeton > Harvard? Because you get an equivalently prestigious degree but a much better education at Princeton because of the undergraduate focus.",
            "Author": "College Freshman",
            "Date": "2010-11-05T01:45:08.207Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton professors are nothing short of brilliant. Your teacher may be (probably will be)  pioneers in his or her field. However, some lecturers have their shortcomings, and academic prowess is no guarantee of a good lecturer. Nevertheless, Princeton students are privileged to be the recipients of a vigorous intellectual experience. The workload though is nothing short of Herculean.",
            "Author": "College Freshman",
            "Date": "2010-02-11T16:48:54.193Z"
        },
        {
            "Rating": 5,
            "Review": "-Registration is done online and is fairly easy. \r\n-Workload is very tough and demanding.\r\n-Professors are brilliant\r\n-Wide variety of course offerings",
            "Author": "College Student",
            "Date": "2009-12-20T03:44:37.813Z"
        }
    ],
    "Campus": [
        {
            "Rating": 5,
            "Review": "One of the things that I think every Princeton student can agree on is how pretty the campus is. The campus sprawls but it's neither too big nor too small. Since I've come to campus, there are plenty of new places I've discovered. It's a rather old campus so while it maintains the old style for which it owes its famous (IMO) it also addresses that yeah, we live in the 21st century, silly.",
            "Author": "College Freshman",
            "Date": "2015-01-19T00:19:32Z"
        },
        {
            "Rating": 4,
            "Review": "Princeton seems like a nice town. I would definitely not live here. The town seems defined by the campus which is fine if you like that kind of thing. Personally I don't hang outside of the Princeton Bubble much but I'm sure if you were really into that you could find yourself having a grand old time. Princeton isn't necessarily isolated. There's a train that can take you to New York City in about an hour. Newark and Trenton are pretty nearby. Philly is about an hour south. So it could definitely be worse. However, if you're on the campus for too long you may begin to lose touch with reality, with what's going on outside Princeton.",
            "Author": "College Freshman",
            "Date": "2015-01-18T21:36:36Z"
        },
        {
            "Rating": 3,
            "Review": "Princeton has a little bubble. So other than the main street right by campus, most people don't notice the city that we're in. If anything, a student may take the Saturday shopping bus to go run a couple errands, but that's it.",
            "Author": "College Freshman",
            "Date": "2014-12-07T15:31:00Z"
        },
        {
            "Rating": 4,
            "Review": "I love the Princeton township. It is safe and has so many attractions!",
            "Author": "College Junior",
            "Date": "2014-11-27T07:41:30Z"
        },
        {
            "Rating": 3,
            "Review": "Princeton is a good example of a quiet little Northeastern town.",
            "Author": "College Sophomore",
            "Date": "2014-08-31T17:24:18Z"
        },
        {
            "Rating": 4,
            "Review": "I love Nassau Street. It is quaint and charming, but in reality it is pretty upscale.  As far as nightlife goes, there isn't much beyond the Street with all of the Eating Clubs.",
            "Author": "College Sophomore",
            "Date": "2014-07-29T19:32:44Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton is the most gorgeous campus around. It has started to combine its gothic architecture with more modern buildings, and the blend is quite refreshing. Frist, the campus center, offers a variety of food options, study spaces, and relaxation areas. Dillon gym has plenty of machines and treadmills.",
            "Author": "College Sophomore",
            "Date": "2014-07-29T19:29:34Z"
        },
        {
            "Rating": 4,
            "Review": "The town can get pricey, but it's a pretty area - lots of shops and nice places to walk.",
            "Author": "College Junior",
            "Date": "2014-07-11T00:03:54Z"
        },
        {
            "Rating": 4,
            "Review": "The range of opportunities Princeton provides has to be the most extraordinary aspect. You can get funding to travel the world and study the topic of your choice, engage in diverse service initiatives and receive support for virtually any endeavor you are passionate about.",
            "Author": "Recent Alumnus",
            "Date": "2014-06-27T23:49:48Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton keeps everything nice, tidy and functional for the most part.",
            "Author": "Recent Alumnus",
            "Date": "2014-06-27T23:49:48Z"
        },
        {
            "Rating": 4,
            "Review": "The town of Princeton is very beautiful and peaceful.",
            "Author": "Recent Alumnus",
            "Date": "2014-06-27T23:42:34Z"
        },
        {
            "Rating": 5,
            "Review": "Academically, athletically, monetarily (i.e. financial aid), socially superior.",
            "Author": "Recent Alumnus",
            "Date": "2014-06-17T12:45:37Z"
        },
        {
            "Rating": 5,
            "Review": "Great free gym for working out, safe campus paths for running, beautiful libraries, comfortable and fun campus center with food (convenient store, desserts, icecream, cafe, etc), tables, lounge chairs, study rooms with chalk/marker boards, televisions, piano, etc.",
            "Author": "Recent Alumnus",
            "Date": "2014-06-17T12:45:37Z"
        },
        {
            "Rating": 4,
            "Review": "Princeton is a wealthy, quiet, safe neighborhood.  \r\n\r\nWhat's so great, though, is that NYC is a train ride away, and the school provides insanely discounted tickets to Broadway plays, professional sporting events, and museums/shows.",
            "Author": "Recent Alumnus",
            "Date": "2014-06-17T12:38:56Z"
        },
        {
            "Rating": 3,
            "Review": "The temperature is pretty moderate..",
            "Author": "College Freshman",
            "Date": "2014-05-19T04:01:18Z"
        },
        {
            "Rating": 4,
            "Review": "The speed of the wireless internet connection is incredible. It is extremely fast...",
            "Author": "College Freshman",
            "Date": "2014-05-19T03:59:03Z"
        },
        {
            "Rating": 4,
            "Review": "It was a lovely college town, with great restaurants and shopping. Very safe and walkable.",
            "Author": "Recent Alumnus",
            "Date": "2014-04-21T15:25:28Z"
        },
        {
            "Rating": 4,
            "Review": "I have my own laptop, which I enjoy using just in my dorm room, though I do not think they are necessary. There are plenty of computer clusters around campus.",
            "Author": "College Freshman",
            "Date": "2014-03-25T21:53:15Z"
        },
        {
            "Rating": 5,
            "Review": "As someone who went without a laptop for a while, it's a minor inconvenience to need to use the clusters, but not necessary.",
            "Author": "College Freshman",
            "Date": "2014-01-26T06:51:04Z"
        },
        {
            "Rating": 3,
            "Review": "pretty normal for the area",
            "Author": "College Freshman",
            "Date": "2014-01-03T21:42:17Z"
        },
        {
            "Rating": 5,
            "Review": "Facilities are top-notch; available to everyone and really nice.  If you're willing to ask around or do a tiny bit of research you'll find incredible opportunities worth taking advantage of.",
            "Author": "College Freshman",
            "Date": "2014-01-03T21:33:38Z"
        },
        {
            "Rating": 5,
            "Review": "everything is great--there are options for absolutely anything and Princeton is an incredible opportunity.",
            "Author": "College Freshman",
            "Date": "2014-01-03T21:33:38Z"
        },
        {
            "Rating": 3,
            "Review": "pretty easy to get around, ask friends if you need advice",
            "Author": "College Freshman",
            "Date": "2014-01-03T21:30:38Z"
        },
        {
            "Rating": 5,
            "Review": "lots of availability, but particularly for STEM you need your own computer",
            "Author": "College Freshman",
            "Date": "2014-01-03T21:29:55Z"
        },
        {
            "Rating": 4,
            "Review": "Close to NYC, but not much going on off campus at night",
            "Author": "College Freshman",
            "Date": "2014-01-03T21:23:59Z"
        },
        {
            "Rating": 4,
            "Review": "Most students use the train to either get home or to get to the airport. The Dinky is the two car train that exclusively takes Princeton students from Princeton Junction train station onto campus.",
            "Author": "College Freshman",
            "Date": "2013-11-04T19:57:40Z"
        },
        {
            "Rating": 4,
            "Review": "Really good for the most part. Everything is clean and fairly new on the inside of the buildings.",
            "Author": "College Freshman",
            "Date": "2013-11-04T19:56:18Z"
        },
        {
            "Rating": 5,
            "Review": "It's beautiful! Autumn is beautiful with all the leaves falling. The campus is gorgeous in general.",
            "Author": "College Freshman",
            "Date": "2013-11-04T19:42:36Z"
        },
        {
            "Rating": 3,
            "Review": "Academic buildings are beautiful and top of the line... from more original buildings like McCosh to newer ones like Frick (the chemistry building)! Dorms are a mixed bag... it's all the luck of the (room) draw!",
            "Author": "College Junior",
            "Date": "2013-07-19T22:42:49.14Z"
        },
        {
            "Rating": 3,
            "Review": "The local weather is very variable, so you have to get used to it being warm and sunny one day and cold and rainy the next.",
            "Author": "College Sophomore",
            "Date": "2013-06-12T10:00:56.747Z"
        },
        {
            "Rating": 2,
            "Review": "Your experience with computers will definitely depend on where you are. I live in Whitman College, and we have a library downstairs. However, during peak seasons, the library is always crowded, and you'll be lucky if the two media macs are available. I usually go to Butler, because there are less people. Their computers also work better. In the Whitman Library, computers sometimes freeze up while I'm trying to print.",
            "Author": "College Freshman",
            "Date": "2013-04-01T11:38:30.03Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton is the ideal college town.  Large enough that you aren't assumed to be a student, and with a wide array of restaurants and stores to satisfy every taste, but small enough that it is easy to get around and feels safe.",
            "Author": "Recent Alumnus",
            "Date": "2013-03-20T11:11:41.843Z"
        },
        {
            "Rating": 3,
            "Review": "Sometimes can be rainy or windy. Mostly sunny and mild.",
            "Author": "College Freshman",
            "Date": "2013-01-20T17:22:58.567Z"
        },
        {
            "Rating": 4,
            "Review": "There are very nice, unique boutique shops and restaurants in the local square, which makes for some great conversations and outings with friends. The town is quite small, however, and the square contains a good number of expensive, high-end stores, which does not always fit each \"starving college student's\" budget. There are some amazing historical sites on and around the campus, which is great for times when friends and family visit. Princeton's area is extremely safe. Being a small town that is quite secluded from the rest of New Jersey, there is very little crime in the area. There are world-famous restaurants and eateries here and there, so it's not as if you have few good options when taking out friends. Despite the fact that there may not be the lively vibe of a big city, Princeton's location is perfectly ideal because it sits right in between New York City and Philadelphia, 55 miles in both directions. Say you wanted to go shopping in Manhattan or attend a broadway show, you can hop on a train and be in the city in less than 1.5 hours. It's amazing!",
            "Author": "College Freshman",
            "Date": "2013-01-04T13:09:09.563Z"
        },
        {
            "Rating": 3,
            "Review": "The winters are really harsh but spring and summer are really beautiful.",
            "Author": "College Junior",
            "Date": "2012-09-27T17:41:29.997Z"
        },
        {
            "Rating": 4,
            "Review": "Train Station Right on Campus – A train called the \"Dinky\" takes you from campus to Princeton Station in five minutes.  From there, you can easily transfer to a train to NYC or Philadelphia, for example.",
            "Author": "College Freshman",
            "Date": "2012-08-17T14:21:43.54Z"
        },
        {
            "Rating": 3,
            "Review": "Freshmen and Sophmores are not allowed to have a car on campus, but I think it is fairly straightforward for a junior or senior to obtain a parking permit for a fee.",
            "Author": "College Freshman",
            "Date": "2012-08-17T14:14:33.543Z"
        },
        {
            "Rating": 3,
            "Review": "Sometimes Humid – It is pretty average weather for the north east.  Not much snow, lots of rain.  It sometimes gets very humid and hot in the spring.",
            "Author": "College Sophomore",
            "Date": "2012-08-06T23:02:02.353Z"
        },
        {
            "Rating": 4,
            "Review": "Upper Middle Class Suburb – I like Princeton, its quiet, safe and clean.  I don't worry about anything and feel perfectly fine walking to my dorm alone at 2am.  The shopping is all high price (Ralph Lauren, J Crew, boutiques) but we also have some good food (Chipotle, lots of ice cream places, Triumph Brewery).  You have everything you need in town but its pricy.  A 10 minute bus ride will get you to a complex with a mall or with a Target/Walmart/Bestbuy/Dicks Sporting Goods",
            "Author": "College Junior",
            "Date": "2012-08-05T21:12:28.483Z"
        },
        {
            "Rating": 5,
            "Review": "Rainy Bliss! The weather is generally nice, with frequent rain storms.  The campus looks beautiful covered in snow.  The severe weather can be beautiful and relaxing.  Campus is not that large, so walks are never long.",
            "Author": "College Sophomore",
            "Date": "2012-07-23T20:05:48.45Z"
        },
        {
            "Rating": 4,
            "Review": "Few Options, but Quality Options – Basically your option is NJ Transit if you want to get to Philly or NYC.  As for getting around campus, there is a free bus, but few use it because campus is so small.  I only ever take it from the parking lot to the dorms if it's raining.",
            "Author": "College Sophomore",
            "Date": "2012-07-23T20:03:22.627Z"
        },
        {
            "Rating": 3,
            "Review": "The parking here is rather limited. There are select locations that can be used for free. Anything else will often be taken and require a meter.",
            "Author": "College Sophomore",
            "Date": "2012-07-10T22:57:42.26Z"
        },
        {
            "Rating": 4,
            "Review": "NYC Is Only an Hour Away – NYC is only an hour away and you also have the local town which has plenty of cool coffee shops, tea shops, stores, and parks.",
            "Author": "College Sophomore",
            "Date": "2012-07-09T22:08:55.433Z"
        },
        {
            "Rating": 4,
            "Review": "Safe and Sound – Princeton, NJ might not be the most exciting place on Earth but it is a cute town with lots of shops, restaurants, stores and a picturesque movie theater. The town is remarkably safe, you never have to worry about walking alone at night. The best part is that there is a train station right on campus. Princeton is 1hr on train from New York City and Philadelphia. Plenty of students spend their weekends in these cities to spice up their social life.",
            "Author": "College Freshman",
            "Date": "2012-05-31T19:06:40.56Z"
        },
        {
            "Rating": 4,
            "Review": "The town of Princeton is cute. With so much happening on campus, I rarely go, though. Princeton is 45 minutes from NYC and Philly; last semester, I went to NYC 6 times with friends, trips financial aid covered.",
            "Author": "College Freshman",
            "Date": "2012-05-30T00:14:29.21Z"
        },
        {
            "Rating": 4,
            "Review": "It Could Be Better. I think that the university has a lot to offer with a very diverse assortment of things to take part in. However, it would be nice for there to be more information about these facilities-- more media.",
            "Author": "College Freshman",
            "Date": "2012-05-21T00:59:33.343Z"
        },
        {
            "Rating": 5,
            "Review": "There are so many locations to work on a computer if you don't have one, and they are very up-to-date. If you want a mac or PC, it's available, and there is also free printing. It is definitely convenient.",
            "Author": "College Freshman",
            "Date": "2012-05-21T00:54:40.893Z"
        },
        {
            "Rating": 3,
            "Review": "There is no real need for a car on campus, but people have them. The student parking lot is a bit of a hike, and when people avoid that by parking somewhere on campus or in the faculty lot it's very easy to get ticketed. The fines are not high, but high enough to be annoying. Some students are able to get parking spots in the lots at their eating clubs, which is more convenient.",
            "Author": "Recent Alumnus",
            "Date": "2012-04-20T14:59:55.71Z"
        },
        {
            "Rating": 4,
            "Review": "Quiant Town – Very quaint town with nice shops and attractions nearby. The school has buses and other methods to get around, but there is really no need to get off campus. There are numerous on-campus activities every day.",
            "Author": "College Freshman",
            "Date": "2012-04-17T10:33:56.167Z"
        },
        {
            "Rating": 3,
            "Review": "Not Bad – I'm from California, so I expected the East coast winters to be pretty miserable. However, it doesn't snow that much here; ice is a bigger worry. The fall and spring are wonderful, unless you have allergies. It can get windy.",
            "Author": "College Junior",
            "Date": "2012-04-10T12:21:39.963Z"
        },
        {
            "Rating": 4,
            "Review": "Printing on Campus – I really like how you can print from any computer on campus thanks to the Cluster Printing network. It's very convenient. For the most part, there are printers available throughout campus. It's not as easy to find a color printer, however, and the printer closest to my room often breaks down.",
            "Author": "College Junior",
            "Date": "2012-04-10T12:15:30.253Z"
        },
        {
            "Rating": 4,
            "Review": "Need for a Personal Computer – It is essential to have a personal computer in order to take notes, find course work and complete assignments. Have a computer in class is very helpful.",
            "Author": "College Student",
            "Date": "2012-02-15T18:35:53.133Z"
        },
        {
            "Rating": 4,
            "Review": "Fall and Spring – are the best seasons here. Campus is beautiful. Some snow in the winter--also beautiful.",
            "Author": "College Freshman",
            "Date": "2012-01-25T15:48:00.513Z"
        },
        {
            "Rating": 4,
            "Review": "The facilities are kept up-to-date, are very accessible, have lots of great technology. A lot of time and effort is put into the maintenance of a clean and aesthetically pleasing campus.",
            "Author": "College Sophomore",
            "Date": "2012-01-03T14:56:03.927Z"
        },
        {
            "Rating": 4,
            "Review": "Orange Bubble – The town of Princeton is focused entirely on the university which is very nice, and Nassau street has lots of nice (albeit fairly expensive) places to get a meal or ice cream.  The town is extremely safe and very friendly towards university students.  Another fantastic aspect about Princeton's location is the proximity to New York City and Philadelphia, where you can take a train in for a concert or a night out and still be back to campus late that night.",
            "Author": "College Junior",
            "Date": "2012-01-02T14:50:18.257Z"
        },
        {
            "Rating": 4,
            "Review": "Top Notch – The facilities at Princeton are fantastic.  The student center and gyms are nice and state of the art, and it's hard to get any better resources than what you can find at Firestone Library.  My only complaint is that there isn't any good 24 hour study library, and most libraries close as early as 11:30.",
            "Author": "College Junior",
            "Date": "2012-01-02T14:42:32.353Z"
        },
        {
            "Rating": 5,
            "Review": "Easy to Find – Most people on campus have personal laptops that they use anywhere on campus, as you can find wireless everywhere you go.  If you don't, computer clusters are basically everywhere, so it shouldn't be too difficult to access.",
            "Author": "College Junior",
            "Date": "2012-01-02T14:41:04.417Z"
        },
        {
            "Rating": 4,
            "Review": "Printing on Campus – Printing on campus is free so there is no need for a personal printer.",
            "Author": "College Sophomore",
            "Date": "2011-11-06T15:06:56.94Z"
        },
        {
            "Rating": 4,
            "Review": "Varies Some – The facilities vary, depending on what it is. For example, newer libraries are great, while Firestone clearly needs some updating (it's under renovations now). Overall, it's a beautiful campus, and the facilities are nice",
            "Author": "College Senior",
            "Date": "2011-10-23T18:47:23.157Z"
        },
        {
            "Rating": 3,
            "Review": "New Jersey is warm and muggy during the early fall, fairly cold in winter with some snowfall, and quite warm again in late spring. Temperatures often vary noticeably day by day, especially in fall and spring, which can be difficult to adjust to.",
            "Author": "College Sophomore",
            "Date": "2011-10-16T21:30:19.69Z"
        },
        {
            "Rating": 4,
            "Review": "Computer labs are available around campus 24/7, and I've never had a problem finding a computer except maybe during exam times.  Most people carry around laptops, so it's not really a problem.  The computers themselves generally are up-to-date and run well, plus we have the added bonus of the H: drive, which you can access from any campus computer, or your laptop.  \r\nPrinters are out of commission sometimes, but you can usually find one that works nearby.  More importantly, printing is free as long as you don't go over the absurdly high quota.",
            "Author": "College Senior",
            "Date": "2011-08-29T18:22:31.297Z"
        },
        {
            "Rating": 3,
            "Review": "TON to Do...If You're Willing to Make the Trek – What I love about Princeton is that it is a very small town, but has access to New York and Philadelphia, both an hour away. The town itself is very safe, but there are very little activities to do, even heading to a Target or a grocery store requires a car. Furthermore, the local residents, called \"townies,\" do not have the best of relationships with the students.",
            "Author": "College Sophomore",
            "Date": "2011-08-23T23:01:04.727Z"
        },
        {
            "Rating": 1,
            "Review": "Freshmen and Sophomores aren't allocated any on-campus parking space. Juniors and Seniors must pay a fee to be allowed to park on campus.",
            "Author": "College Sophomore",
            "Date": "2011-08-23T00:07:02.397Z"
        },
        {
            "Rating": 3,
            "Review": "Quaint and Expensive – Princeton is a cute little town. It's got a lot of charm, but it's not a \"college town\" by any means. We literally JUST got our first proper bar. No night clubs or anything like that. There are some dining options off-campus, but nearly everything is expensive.",
            "Author": "College Junior",
            "Date": "2011-08-22T23:34:24.993Z"
        },
        {
            "Rating": 4,
            "Review": "College Town – Princeton is a charming, affluent area that features many high end shops and old-fashioned restaurants.",
            "Author": "College Junior",
            "Date": "2011-08-21T23:56:01.21Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton is beautiful, and its library system is great. Between the two main libraries - Firestone and Lewis - there is probably no resource that can't be found, and no problem finding study spaces",
            "Author": "College Sophomore",
            "Date": "2011-07-14T17:35:38.2Z"
        },
        {
            "Rating": 3,
            "Review": "Coming from Cali, I Like It. It's cold during the winter, but fall and spring are absolutely gorgeous. And the first bout of snow is magical, but it wears a little when there is still snow in March. It's fun to have different seasons though.",
            "Author": "College Junior",
            "Date": "2011-06-30T19:31:20.273Z"
        },
        {
            "Rating": 4,
            "Review": "Academic Calendar Sucks – The academic calendar allows for a fall break, so you're home when none of your friends are home. Then we only get a two week Christmas Break to study for a two week final period and then a one week intersession. So while you're worrying over finals while opening Christmas presents, you're also wondering why they don't just combine the week-long intersession with Christmas break to give you three weeks off. \r\nOther than that the teachers seem very eager to help any students out. The food is really great. The party scene is a bit monotonous. The football team isn't a great one. However, the people you meet here (students and faculty) are the most amazing and interesting people you will ever meet.",
            "Author": "College Freshman",
            "Date": "2011-01-28T22:37:13.813Z"
        },
        {
            "Rating": 3,
            "Review": "Definitely Not California – The summers are sticky, but definitely bearable. The only problem is that many rooms get soooo hot, a fan is a must. Fall is nice, except that by the end of it, it gets very windy. Winter is very nice and definitely not as cold as I thought it would be. I'm from California and I'm ok with the winter, however, my roommate is from California too and she's always freezing. We both agree that it's not that bad. GET RAINBOOTS because there are definitely times when it rains a lot, but it's way too warm to use snow boots.",
            "Author": "College Freshman",
            "Date": "2011-01-28T22:31:56.37Z"
        },
        {
            "Rating": 5,
            "Review": "So Beautiful – And so much to do. Only negative: a lot of activities/clubs are exclusive, based on interviews and/or auditions",
            "Author": "College Freshman",
            "Date": "2010-11-05T01:45:38.063Z"
        },
        {
            "Rating": 5,
            "Review": "Student Center & Libraries – Our main student center offers great food, multiple study spots, lots of places to hang out and a number of free events. The student centers located in each of the dorms are a good place to get some work done and on weekends spend some time with friends. \r\n\r\nThe libraries on campus are great. There are so many to choose from so you never get bored going to just one. If you like natural lighting, there's a library for you, if you prefer complete silence, there's a library for you.",
            "Author": "College Sophomore",
            "Date": "2010-09-28T01:03:41.803Z"
        },
        {
            "Rating": 1,
            "Review": "There is no parking on campus. At all.\r\nThe nearest parking lot is usually crowded, and several blocks away from the rest of campus.  If you need to get around in a hurry, bring your bike.\r\nAnd underclassmen can't even  live off campus or have cars, so that kind of tells you what it's like.",
            "Author": "College Student",
            "Date": "2010-05-19T22:05:02.993Z"
        },
        {
            "Rating": 4,
            "Review": "Ivory Tower – The Princeton campus is the quintessential \"ivory tower\" college and it shows. The Firestone Library, largest on campus, extends three levels up and underground, and looks good while doing it. The student center is spacious, but the aesthetic inside isn't quite in tune with the rest of campus. The campus in general though is wonderfully ornate, studded with arches and gargoyles at every turn.",
            "Author": "College Freshman",
            "Date": "2010-02-11T16:51:20.503Z"
        },
        {
            "Rating": 4,
            "Review": "Computer clusters are like weeds here; in or in close proximity to every dorm, both Mac and Windows. Most students have their own computers though so the competition for clusters is far from cutthroat. Fast and ubiquitous WI-FI is on campus. Printers are often conveniently nestled near to clusters though having one in one's room is always a boon",
            "Author": "College Freshman",
            "Date": "2010-02-09T15:23:05.74Z"
        },
        {
            "Rating": 4,
            "Review": "The Madding Crowd – People often refer, with some disdain and a measure of amusement, to the Princeton Bubble. Though Princeton students are often fixed on and around campus it's easy to see why. The surroundings provide students with food and (flagrantly expensive) clothing and a soupcon of amusement. On campus there are always intramural leagues playing, artistic groups meeting and cultural co-mingling. In fact, in can be hard to duck out from the legions of clubs and events. And if you choose to do so, a quick jaunt to New York is just $20-odd dollars away.",
            "Author": "College Freshman",
            "Date": "2010-02-09T15:00:39.02Z"
        },
        {
            "Rating": 3,
            "Review": "Bring Protection – Today it is balmy, sun gently caressing the snow and people are strutting around coolly in short sleeves. Tomorrow there will be a snowstorm. The weather is nothing short of unpredictable, but not unduly cold or rainy. Nevertheless an umbrella is a must for a Princeton student. Fall is sunny and warm though.",
            "Author": "College Freshman",
            "Date": "2010-02-09T14:38:42.767Z"
        },
        {
            "Rating": 3,
            "Review": "Pump Your Brakes, Kid – Car's on campus are rare and jostle for space. Freshman aren't allowed vehicles and parking is both sparse and inconveniently placed on campus. However, the campus is very compact and there is no real need for a car apart from style points.",
            "Author": "College Freshman",
            "Date": "2010-02-09T14:36:54.897Z"
        },
        {
            "Rating": 4,
            "Review": "Man About Town – The dinky, the local Princeton train, found on campus, ferries students to Princeton Junction. From there they have access to both New York and New Jersey and Newark Airport. Cabs and Princeton will reduce your wallet to a paperweight. The buses however are cheap and afford access to many shopping areas around campus.",
            "Author": "College Freshman",
            "Date": "2010-02-09T14:30:48.167Z"
        },
        {
            "Rating": 4,
            "Review": "Academia and Alumni – Princeton is an academic Nirvana. Classes are taught by the finest academic minds (unlike precepts). That being common to Ivies, what sets Princeton Academics apart is the constant slew of academic lectures on every topic conceivable by famous speakers. Also the strength of the alumni network is unrivaled. The senior thesis experience is also said to be a highlight of the princeton career: the prized proverbial cherry on top.",
            "Author": "College Freshman",
            "Date": "2010-02-09T14:23:59.103Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton is very unique and is different from all the other Ivys. Princeton has its own Eating Club system which I really enjoy and has one of the most beautiful college campuses in the nation. Princeton's alumni are also some of the most enthusiastic and devoted people. Every year, nearly 20,000 alumni come back to campus to march in the P-Rade. With an alumni giving rate of over 60%, it is easy to see why alumni are so loyal to the University and its graduates.",
            "Author": "College Student",
            "Date": "2009-12-20T04:20:34.91Z"
        },
        {
            "Rating": 3,
            "Review": "Weather at Princeton can get kind of crazy sometimes. We will have one week where is is 60-70 degrees in November, and the next week it will be in the 30's. Princeton also tends to have very rainy springs and somewhat cold winters. Overall, the weather isn't too bad, but it can be unpredictable.",
            "Author": "College Student",
            "Date": "2009-12-20T04:14:11.957Z"
        },
        {
            "Rating": 4,
            "Review": "Princeton University has it's own train station called the Dinky. The Dinky runs every 15-20 minutes and takes you to Princeton Junction where you can catch a train to pretty much about anywhere, but students mainly use it to get to New York or Philadelphia.",
            "Author": "College Student",
            "Date": "2009-12-20T04:11:42.683Z"
        },
        {
            "Rating": 4,
            "Review": "The majority of Princeton's facilities are up-to-date and have been recently renovated. My only complaint is that Dillon Gym can seem a little outdated, but other than that, everything on Campus looks brand new.",
            "Author": "College Student",
            "Date": "2009-12-20T03:51:17.63Z"
        },
        {
            "Rating": 4,
            "Review": "Princeton has top notch computer labs spread all over campus. Rarely do I ever see a lab completely filled with students. In the Fall of 2009, the University established a printing quota for the academic year (2100 sheets), which is much more than what the average student uses.",
            "Author": "College Student",
            "Date": "2009-12-20T03:50:13.86Z"
        },
        {
            "Rating": 4,
            "Review": "Small Town – Princeton, NJ is a fairly small town, centered around the University. Nassau street has a ton of different kinds of ethnic restaurants, ice cream shops, or pretty much anything you can imagine. The most convenient/popular establishment in Princeton is the Wawa. As for nightlife, most students stick to the Eating Clubs on Prospect Ave. rather than going out to local pubs.",
            "Author": "College Student",
            "Date": "2009-12-20T03:48:11.31Z"
        }
    ],
    "Value": [
        {
            "Rating": 5,
            "Review": "A Princeton degree is worth a lot. It helps greatly with internships and just about anything else career related.",
            "Author": "College Freshman",
            "Date": "2016-03-31T17:26:48Z"
        },
        {
            "Rating": 5,
            "Review": "I'm sure it's pretty cool. The alumni seem like a great resource.",
            "Author": "College Freshman",
            "Date": "2015-01-18T21:51:58Z"
        },
        {
            "Rating": 4,
            "Review": "Financial aid is great at Princeton. I received more money here than I did at any other school to which I was accepted. Princeton has money to burn (or so I hear) and if you ask the financial aid office for more money they're likely to at least consider your case. I came in with a couple of outside scholarships that definitely helped and I recommend seeking that out rather than completely relying on the Princeton for financial aid (especially if you're stuck in the middle class rut). If your family makes a little less than a certain number (I don't know what exactly), Princeton pays nearly everything.",
            "Author": "College Freshman",
            "Date": "2015-01-18T21:09:56Z"
        },
        {
            "Rating": 4,
            "Review": "We have a very supportive financial aid program.",
            "Author": "College Sophomore",
            "Date": "2014-08-31T17:19:46Z"
        },
        {
            "Rating": 4,
            "Review": "Have a low income? They will pay for everything!",
            "Author": "College Sophomore",
            "Date": "2014-07-29T19:25:52Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton is extremely generous with financial aid. Their no loan policy ensures students are taken care of financially.",
            "Author": "Recent Alumnus",
            "Date": "2014-06-27T23:40:53Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton University probably has the best financial aid gifts/process in the country. If you need aid, they will provide it and work with you. If PU thinks that you are a qualified candidate to attend its institution, they don't want money to stand in the way.",
            "Author": "Recent Alumnus",
            "Date": "2014-06-17T12:35:41Z"
        },
        {
            "Rating": 4,
            "Review": "very generous for need-based aid",
            "Author": "Recent Alumnus",
            "Date": "2014-04-21T15:21:55Z"
        },
        {
            "Rating": 5,
            "Review": "As a lower-middle class student, I've had a great experience with the financial aid office, paying a \"bill\" of about $500 each semester. I haven't had any trouble getting the financial aid that I need and would probably be paying more to attend a community college.",
            "Author": "College Freshman",
            "Date": "2014-01-26T06:42:40Z"
        },
        {
            "Rating": 5,
            "Review": "No other school could offer me as much financial aid. The $15 billion endowment gives students so many options, you just have to ask for money and it will be given.",
            "Author": "College Freshman",
            "Date": "2013-11-04T19:59:48Z"
        },
        {
            "Rating": 5,
            "Review": "One of the best in the country. Just check out the fin aid website.",
            "Author": "College Sophomore",
            "Date": "2013-01-16T13:30:59.067Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton is super generous with financial aid. Just fill out the applications in time and the financial aid office will do its best to assist you as much as you need!",
            "Author": "College Junior",
            "Date": "2012-09-27T17:38:54.137Z"
        },
        {
            "Rating": 5,
            "Review": "Paying for Everything – I am paying nothing for my four years at Princeton. Absolutely nothing. Tuition AND room and board were covered. Princeton has the largest endowment per student of any University in the world and this manifests itself as a substantial advantage in terms of financial aid. It was very easy to get the aid too. I could not be more pleased.",
            "Author": "College Freshman",
            "Date": "2012-05-30T00:13:16.907Z"
        },
        {
            "Rating": 4,
            "Review": "The loan free program has allowed me to attend college so far without taking out any loans. They are pretty generous if you ask them to be.",
            "Author": "College Sophomore",
            "Date": "2012-01-03T15:00:05.88Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton has the best financial aid in the world.",
            "Author": "College Sophomore",
            "Date": "2011-11-06T15:09:53.343Z"
        },
        {
            "Rating": 4,
            "Review": "princeton has a great financial aid system and most of my friends are very satisfied",
            "Author": "College Sophomore",
            "Date": "2011-04-16T22:28:31.26Z"
        },
        {
            "Rating": 5,
            "Review": "I come from a low-income family and Princeton was generous enough to pay everything except for $2,000 which I made up for with work-study. However, even people who I thought were not getting financial aid (because I've seen the size of their houses) and yet Princeton also gave them a percentage of their tuition in financial aid.",
            "Author": "College Freshman",
            "Date": "2011-01-28T22:39:59.793Z"
        },
        {
            "Rating": 5,
            "Review": "The average Princeton grant is 99% of the cost of tuition. Even then, nearly 60% of the student body is on some form of financial aid and there are absolutely no loans given.",
            "Author": "College Student",
            "Date": "2009-12-20T03:42:33.313Z"
        }
    ],
    "Food": [
        {
            "Rating": 4,
            "Review": "What's really great about the food at Princeton is the fact that there are so many options. There are four dining halls to choose from and if you don't like the meal in your res college, you can just go to another. None of them serve exactly the same thing. In my opinion, they all have their own styles. The biggest ones -Rocky/Mathey & Wilcox/Wu- are arguably the best because...well, they're bigger and offer more options.  That's not to say that all the food is great -it's not. There are definitely bad days. The meal plans are pretty nice but aren't really very useable for food off campus. Late Meal at Princeton is great for underclassmen who have an unlimited meal plan (and it's arguably better than the food in the residential colleges) and many students utilize it. If you don't have an unlimited meal plan, it's a bit more difficult but there are still plenty of food options available.",
            "Author": "College Freshman",
            "Date": "2015-01-18T21:26:51Z"
        },
        {
            "Rating": 3,
            "Review": "The town of Princeton isn't exactly known for its affordability. I usually stick with places like Panera and Qdoba just because those are pretty inexpensive. Other places on Nassau Street are a tad bit more expensive and seem to be more catered to tourists rather than Princeton students themselves. Many people save off-campus dining for special occasions. I hardly know anyone who goes to Nassau Street on a regular basis.",
            "Author": "College Freshman",
            "Date": "2015-01-18T21:15:42Z"
        },
        {
            "Rating": 4,
            "Review": "The Town of Princeton is known for its restaurants. The scene for dining is so nice and so many little shops around with home-made icecream etc. People come here from other towns to try out the icecream and dining options here.",
            "Author": "College Freshman",
            "Date": "2015-01-03T13:07:59Z"
        },
        {
            "Rating": 3,
            "Review": "Students rarely eat off campus. The dining services provided by the school don't leave you wanting anything more.",
            "Author": "College Freshman",
            "Date": "2014-12-07T15:35:12Z"
        },
        {
            "Rating": 5,
            "Review": "We have a variety of amazing food every breakfast, lunch, and dinner!",
            "Author": "College Junior",
            "Date": "2014-11-27T07:32:04Z"
        },
        {
            "Rating": 3,
            "Review": "A lot of off-campus dining is pretty expensive.",
            "Author": "College Sophomore",
            "Date": "2014-08-31T17:22:05Z"
        },
        {
            "Rating": 4,
            "Review": "There are lots of restaurants I like, and there is a lot of variety, but most of it is slightly too pricey for a college kid.",
            "Author": "College Sophomore",
            "Date": "2014-07-29T19:40:24Z"
        },
        {
            "Rating": 5,
            "Review": "Late meal is the greatest thing ever. The dining halls cycle through meals every three weeks, so it can get a little repetitive, but late meal food is always great. Plus, if you make friends in eating clubs, you can throw in more variety. Murray Dodge cookies are also incredible!",
            "Author": "College Sophomore",
            "Date": "2014-07-29T19:27:39Z"
        },
        {
            "Rating": 3,
            "Review": "There are plenty of places to eat off campus, but many are quite expensive as a student.",
            "Author": "College Junior",
            "Date": "2014-07-10T23:51:38Z"
        },
        {
            "Rating": 2,
            "Review": "If you like non-bland food, late meal will be your only salvation. Dining hall food sucks. Eating club food is sometimes good but sometimes sucks too.",
            "Author": "Recent Alumnus",
            "Date": "2014-06-27T23:55:45Z"
        },
        {
            "Rating": 5,
            "Review": "There are multiple colleges within the Princeton University umbrella, and each college or pair of colleges has its own dining hall (all dining halls are open to all students).  Eating clubs and the Frist campus center are also food options. With so much food everywhere, you will definitely find what you want to eat.  And the food is great!  People who whine about the food are spoiled by all the choices. Ask those same people who complain how they fair with food after graduation.",
            "Author": "Recent Alumnus",
            "Date": "2014-06-17T12:50:34Z"
        },
        {
            "Rating": 3,
            "Review": "I don't really go out to dine, but the prices are worth it...",
            "Author": "College Freshman",
            "Date": "2014-05-19T04:04:47Z"
        },
        {
            "Rating": 4,
            "Review": "Food is good, but make sure to check menus online to figure out which dining hall has the best food for the night,",
            "Author": "College Freshman",
            "Date": "2014-01-03T21:34:28Z"
        },
        {
            "Rating": 4,
            "Review": "really good options with some variety for a relatively small town",
            "Author": "College Freshman",
            "Date": "2014-01-03T21:31:44Z"
        },
        {
            "Rating": 3,
            "Review": "Prices can be a bit expensive but the food is very worth it.",
            "Author": "College Freshman",
            "Date": "2013-11-04T19:52:38Z"
        },
        {
            "Rating": 3,
            "Review": "Breakfast is awesome. Lots of cereal and sandwiches consumed for dinner and lunch  gets kind of boring.",
            "Author": "College Freshman",
            "Date": "2013-11-04T18:19:10Z"
        },
        {
            "Rating": 3,
            "Review": "There are a bunch of Mom and Pop shops along with affordable, health-conscious options, and some more upscale, expensive dining options . Not a lot of fast-food or places that offer significant student discounts. There is a decent variety for the area.",
            "Author": "College Sophomore",
            "Date": "2013-10-07T18:57:37Z"
        },
        {
            "Rating": 3,
            "Review": "Dining halls have a variety of food and menus and many of the residential colleges have special dinner nights. However choosing where to eat becomes a bit more convoluted when one must decide their sophomore year whether to remain in the dining hall system, join an eating club, go independent, etc. This can cause some anxiety about not being in the same club as friends and being able to have meals with them but otherwise the off-campus options are pretty good and the dining staff here is excellent.",
            "Author": "College Sophomore",
            "Date": "2013-10-07T18:55:05Z"
        },
        {
            "Rating": 5,
            "Review": "Dining halls are consistent, and the eating clubs all have their own specialities.  The options in town are great too - don't miss out on a steak at Witherspoon Grill (for a very special occasion).  Wings from Chuck's are little-known but awesome.",
            "Author": "Recent Alumnus",
            "Date": "2013-03-20T11:17:40.087Z"
        },
        {
            "Rating": 4,
            "Review": "Better Than Average – Wide variety of food across the four dining halls, though Forbes is significantly worse than the others.  After an entire semester it gets somewhat repetitive but there are a lot of options and a large array of vegetarian choices.",
            "Author": "College Junior",
            "Date": "2012-07-10T11:47:38.337Z"
        },
        {
            "Rating": 3,
            "Review": "Pretty Good for Dorm Food – I wouldn't say that the food is fantastic, but there are definitely a ton of options as far as dining goes. Aside from eating clubs, there are four different residential dining halls, and late meals at Frist student center (opportunities to get a meal after lunch and dinner)--so if you feel like the food is getting old, it's probably because you aren't trying out all the different options. Also there are a ton of healthy options, but a ton of unhealthy ones as well; avoiding the freshman 15 is all about control.",
            "Author": "College Sophomore",
            "Date": "2011-09-02T22:05:46.767Z"
        },
        {
            "Rating": 3,
            "Review": "Ice Cream Great...But Lots of Expensive Places – So many wonderful ice cream options (it's a big deal amongst students which is your favorite place).\r\nIf you just need ot grab food, Wawa is the go-to place.  Hoagie Haven a bit of a walk but famously awesome.  \r\nIn general, Princeton has lots of great options if you want to go out for a fancy dinner or get a treat, but not much for cheap food.  Only 'fast' food is Subway or Panera.  Fortunately most people are on dining plans and only go out for special occasions anyway.",
            "Author": "College Senior",
            "Date": "2011-08-29T18:27:32.2Z"
        },
        {
            "Rating": 5,
            "Review": "The food here is great: between the four res college dining halls, the (far-away) grad college and Frist Campus Center, as well as a some non-meal-plan cafes scattered throughout, there are plenty of options. Sunday brunch in the res colleges is amazing. There isn't a 24-hour cafeteria where you can use your meal plan swipes, however, but most res colleges leave snacks out at night for free.",
            "Author": "College Sophomore",
            "Date": "2011-07-14T17:37:50.907Z"
        },
        {
            "Rating": 4,
            "Review": "The food at the cafeterias can get repetitive and boring, but there are other options such as the Frist Campus Center and various cafes that add variety. Also, late meal (look it up) is a life-saver.",
            "Author": "College Freshman",
            "Date": "2010-11-05T01:43:01.787Z"
        },
        {
            "Rating": 3,
            "Review": "Food Network – Campus dining tends towards the monotonous, but that's not necessarily a bad thing. The dining halls offer a range of options, including the ever popular make-your-own panini. The real scoop comes from the eating clubs though; the food there can range from classy to cringe-worthy. Nevertheless the student body rarely complains about the quality of food. Moreover, there is a massive amount of free food available on campus; you can literally live off food provided at open houses and review sessions for weeks!",
            "Author": "College Freshman",
            "Date": "2010-02-11T16:58:12.737Z"
        },
        {
            "Rating": 4,
            "Review": "Food for Thought – Hoagie Haven serves the best hoagies this side of paradise, and Princeton students give it due respect. However, if you want to go for pricier options their are restaurants aplenty immediately outlying the campus. Asian and indian food about but there's plenty diversify one's palette.",
            "Author": "College Freshman",
            "Date": "2010-02-11T16:53:46.267Z"
        },
        {
            "Rating": 3,
            "Review": "Off-Campus dining at Princeton is basically limited to Nassau Street, where there are many, but expensive, restaurants of all types. The most popular off-campus dining would the be Wawa, which is normally filled with students grabbing late-night snacks.",
            "Author": "College Student",
            "Date": "2009-12-20T03:55:21.093Z"
        },
        {
            "Rating": 4,
            "Review": "Dining Is Fantastic – The food at Princeton is fantastic, simple as that. As a freshman and sophomore, you typically eat in one of the residential college dining halls. The food in the dining halls is generally the same across the board and is very good. As an upperclassmen, you can choose to join one of 10 Eating Clubs.",
            "Author": "College Student",
            "Date": "2009-12-20T03:53:44.797Z"
        }
    ],
    "Housing": [
        {
            "Rating": 3,
            "Review": "Some of the buildings are very old. The buildings known as \"the slums\" have tons of cockroaches. You do not really have a choice of where you get placed your first two years, and there is a wide variety of quality of the dorms.",
            "Author": "Recent Alumnus",
            "Date": "2016-05-23T15:48:44Z"
        },
        {
            "Rating": 4,
            "Review": "It's like living in a castle. It's pretty awesome. That being said, your experience varies depending on your res college. The newer the room, the better.",
            "Author": "College Freshman",
            "Date": "2016-03-31T17:20:34Z"
        },
        {
            "Rating": 4,
            "Review": "I got really lucky with my housing this year. As a freshman I was placed randomly in a college resident. I got Whitman which is arguably the best residential college in several ways: it's the newest, many residents have singles and it it's in a nice location. I was lucky enough to have a single. That being said, I've been inside every residential college and all of them have their perks. I won't say that all of them great there are a few halls that leave much to be desired. A couple of the residential colleges, Rocky and Mathey, are pretty old and therefore don't have air conditioning. Compared to some of the dorms of other colleges I've seen, Princeton's are definitely above average.",
            "Author": "College Freshman",
            "Date": "2015-01-18T20:58:12Z"
        },
        {
            "Rating": 4,
            "Review": "The dorms are amazing and spacious. Although you don't spend a lot of time in them, there are other facilities within the building that make you want to spend your time there. There are so many social events and spaces within the dorm buildings to make that possible.",
            "Author": "College Freshman",
            "Date": "2015-01-03T13:10:29Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton invests heavily in their housing. Laundry is free. Students are divided up into six residential colleges which greatly enhances the community feel.",
            "Author": "College Freshman",
            "Date": "2014-12-07T15:33:51Z"
        },
        {
            "Rating": 5,
            "Review": "I live in Forbes residential college and it is like a home away from school. The cost of dorms are going up year to year but it is still at an okay price. The housing process depends on draw-times which are randomly assigned and upper-class men get priority. If you get good draw time you get good rooms. The social atmosphere is amazing. There is always something to do on campus!",
            "Author": "College Junior",
            "Date": "2014-11-27T07:49:30Z"
        },
        {
            "Rating": 3,
            "Review": "Depends on where you live.  There is really great housing, but also some locations are on the older side.",
            "Author": "College Senior",
            "Date": "2014-11-18T14:15:52Z"
        },
        {
            "Rating": 2,
            "Review": "I don't know anyone who lives off-campus because it's expensive and not widely available.",
            "Author": "College Sophomore",
            "Date": "2014-08-31T17:19:05Z"
        },
        {
            "Rating": 4,
            "Review": "The housing is great compared to other schools that I've seen.",
            "Author": "College Sophomore",
            "Date": "2014-08-31T17:18:26Z"
        },
        {
            "Rating": 3,
            "Review": "I think you could find a shortcoming to most of the residential colleges. Wilson is ugly, Forbes, Rocky, and Mathey are all inconveniently located. But you also learn to love your community. Wilson is so centrally located, it makes up for the appearance. Forbesians have their amazing Sunday brunch and the Wa. Rocky/Mathey have the gothic architecture everyone knows and loves Princeton for, and Butler and Whitmanites have newer facilities with nice, clean interiors (and AC!).",
            "Author": "College Sophomore",
            "Date": "2014-07-29T19:35:23Z"
        },
        {
            "Rating": 5,
            "Review": "There are some fantastic dorms at Princeton.  I've had a single room the whole time I've been there.",
            "Author": "College Junior",
            "Date": "2014-07-10T23:53:23Z"
        },
        {
            "Rating": 3,
            "Review": "Very few people live off campus & I'm unaware about the particulars of what it's like.",
            "Author": "Recent Alumnus",
            "Date": "2014-06-27T23:45:00Z"
        },
        {
            "Rating": 4,
            "Review": "Freshman year is a toss-up because you're new and thrown into a dormitory with people you don't know, but after your first year, you are able to room with whomever you choose. This process is done in a fair, random lottery system.",
            "Author": "Recent Alumnus",
            "Date": "2014-06-17T12:42:02Z"
        },
        {
            "Rating": 3,
            "Review": "The dorms are pretty expensive and it is also not air conditioned, so it gets hot during the summer.",
            "Author": "College Freshman",
            "Date": "2014-05-19T04:03:55Z"
        },
        {
            "Rating": 3,
            "Review": "Most campus dorms look beautiful on the outside, but are less than ideal on the inside. There is a big range, however, based on where you're assigned within the residential college system. Forbes is far and the rooms range in quality, but has a great community - Wilson is perfectly located in central campus but the rooms leave much to be desired - Butler/Whitman have top notch amenities, but the people do not seem as close as those in Forbes -- Rocky/Mathey is somewhere in between.",
            "Author": "College Freshman",
            "Date": "2014-03-25T21:50:31Z"
        },
        {
            "Rating": 2,
            "Review": "I happen to live in one residential \"college\" that I was randomly placed in. I am a mile from my nearest class and as a second year student share a 180 sq. ft. double with a roommate. I pay the same rooming fee as someone who lives in central campus with a 300 sq. ft. single.",
            "Author": "College Freshman",
            "Date": "2014-02-10T21:42:35Z"
        },
        {
            "Rating": 5,
            "Review": "The housing here is pretty great. As a freshman, I ended up with a single and my own bathroom, so I personally don't have any complaints. There are some mediocre dorms in Wilson College, but the rest have been renovated somewhat recently and are generally pretty nice.  If you're living in Forbes College, you might not like the walk, but it's not a problem that a bike can't solve.",
            "Author": "College Freshman",
            "Date": "2014-01-26T06:47:24Z"
        },
        {
            "Rating": 2,
            "Review": "Everyone lives on campus; there are good facilities and locations for upperclassmen",
            "Author": "College Freshman",
            "Date": "2014-01-03T21:36:59Z"
        },
        {
            "Rating": 5,
            "Review": "Everyone does, and it can be great with some luck",
            "Author": "College Freshman",
            "Date": "2014-01-03T21:23:06Z"
        },
        {
            "Rating": 4,
            "Review": "It really depends what residential college you are placed into. Some are very old while others are new and have personal bathrooms. Most rooms are better than the average college by far.",
            "Author": "College Freshman",
            "Date": "2013-11-04T20:05:02Z"
        },
        {
            "Rating": 3,
            "Review": "The living situation is okay depending on which residential college you draw into. Butler/Wilson is probably the best location as far as freshman and sophomore dorms go. It's probably the closest to academic buildings. Whitman isn't bad either. Butler is extremely modern. Whitman was built most recently, but it has a pseudo-gothic look. During the day, if you don't keep your light on, especially if you have a single, your room will feel very small and dark. Forbes is beautiful, but it's really far from everything. (I left out Rocky/Mathey because I never lived there). As a freshman and sophomore, regardless of where you live, you will be subjected to sharing a dorm with all people of your chosen gender who live on your floor. Fortunately, if you draw well, upperclass housing will be quite palatable. I don't know what the best option is, but if you know you will be an engineering major, rethink drawing into Forbes because it is the furthest away from the E-Quad. However, if you want to live in one of the best-looking dorms, choose Forbes. The social atmosphere in the residential colleges is good if you are an outgoing person. We have study breaks once a week for the whole community, and College Night on Tuesdays. You will survive these much easier if you have friends who live in your residential college (for me, that's Whitman. If you want one night every couple of weeks to have dinner with students who are only in your residential college, then Whitman is for you). In order to choose housing, you are assigned a specific lottery time. Log in to the housing website at that time and watch in real time as other students make their decisions as well..",
            "Author": "College Sophomore",
            "Date": "2013-10-14T15:40:06Z"
        },
        {
            "Rating": 4,
            "Review": "There is a good amount of different housing options at Princeton such as independent, graduate-housing, and undergraduate housing, each of which have their own benefits and draw-backs. I can personally speak for undergraduate housing though. freshmen and sophomores are divided into 6 residential colleges: Mathey, Butler, and Whitman which are all 4-year colleges and Wilson, Rockefeller, and Forbes which are all 2-year colleges. Mathey and Rocky are the older res-cols located on the upper half of campus and have Gothic architecture. Whitman also has a Gothic feel to it, is located closer to the back of campus, and is the newest among the colleges and therefore it also has air conditioning. Butler and Wilson are in the middle of campus have a mix of newer and older buildings and a few of their dorms have ac. Forbes was once an inn but is now a res-col and is a bit farther away from the majority of campus but has some newer as well as older dorms.",
            "Author": "College Freshman",
            "Date": "2012-12-26T17:03:42.113Z"
        },
        {
            "Rating": 5,
            "Review": "Excellent Dorms – So far, I've had a great experience living on campus.  There are bathrooms down the hall from my room as well as a kitchenette and a study area.  There's also a theater and a dance studio in my college.",
            "Author": "College Freshman",
            "Date": "2012-08-17T14:24:05.293Z"
        },
        {
            "Rating": 4,
            "Review": "Residential College Housing Is Alright – Some rooms are great, while others are cramped and dark.  Freshmen and sophomores can only room with people in their own residential colleges.  But overall the housing is pretty nice.  I gave an A- instead of an A because the kitchens are pretty useless and sparse.  Also the summer housing is a rip-off and you will starve.",
            "Author": "College Sophomore",
            "Date": "2012-07-23T18:20:17.123Z"
        },
        {
            "Rating": 3,
            "Review": "Old but Quality – The dorms at Princeton, most of them at least, have been around since the beginning of the nation but the amenities are superb. There are a lot of private bathrooms on campus and even shared/hall bathrooms don't generally accommodate more than 6-8 people. Rooms range from carpets to hardwood but the size of the rooms is overall quite large. The only issue is that some of the older dorms have bugs but the older dorms also provide a great social experience.",
            "Author": "College Freshman",
            "Date": "2012-05-31T19:08:56.497Z"
        },
        {
            "Rating": 5,
            "Review": "Princeton spends so much money on its housing. Whitman College, for example, has enormous rooms and air conditioning in each one. People complain about the housing, but they do not seem to recognize how incredible they are relative to other colleges.",
            "Author": "College Freshman",
            "Date": "2012-05-30T00:11:04.293Z"
        },
        {
            "Rating": 5,
            "Review": "Butler has the best dorms I've ever seen on a college campus. I live in a suite with three other people, and we have A/C, heat, hardwood floors, and a bathroom to ourselves. No cockroaches.",
            "Author": "College Freshman",
            "Date": "2012-01-25T15:45:14.16Z"
        },
        {
            "Rating": 4,
            "Review": "Great Options – The offcampus housing is a great option for upperclassmen at Princeton.",
            "Author": "College Freshman",
            "Date": "2011-09-26T00:37:10.97Z"
        },
        {
            "Rating": 2,
            "Review": "Limited Selection – There's very few choices for off campus housing, and they are more expensive compared to on- campus housing. Most students live on campus.",
            "Author": "College Sophomore",
            "Date": "2011-04-16T22:24:19.31Z"
        },
        {
            "Rating": 4,
            "Review": "Full Spectrum – It really depends on where you live. Everything has its pluses and minuses, but no one complains - in fact, a lot of people brag.",
            "Author": "College Freshman",
            "Date": "2010-11-05T01:43:57.93Z"
        },
        {
            "Rating": 2,
            "Review": "Housing Horrors – The far flung outskirts of Princeton are home to a smattering of houses and their dreary denizens will tell you that it is both expensive and inconvenient. Dorm housing, though under the beady eye of the administration, is far more prudent.",
            "Author": "College Freshman",
            "Date": "2010-02-09T15:07:56.383Z"
        },
        {
            "Rating": 3,
            "Review": "A Clean and Well-Lit Place...Sometimes – As a freshman you mind find yourself in a frighteningly small double or an expansive 8-person suite. Nevertheless after freshman year, you can choose a group of friends to draw with and with a good draw group you'll swing a swanky dwelling. Wilson College, though very well situated, is something of a Dungeon, and Forbes is in another area code entirely. Rocky/Mathey dorms are pretty palatial though. The architecture of all the buildings range from the baroque to Harry Potter.",
            "Author": "College Freshman",
            "Date": "2010-02-09T15:06:31.803Z"
        },
        {
            "Rating": 1,
            "Review": "98-99% of all undergraduates live on campus. Enough said.",
            "Author": "College Student",
            "Date": "2009-12-20T04:00:18.423Z"
        },
        {
            "Rating": 4,
            "Review": "Great Dorms – The dorms at Princeton have really improved over the last 4-5 years. With the addition of Whitman College, and the complete reconstruction of Butler Colleges, the quality of residential life has exponentially increased. The dorms all have heating, and in some cases air conditioning, and the newer dorms have private bathrooms or bathrooms steps outside of your door. However, in some of the older dorms, you may end having to walk down 3-4 flights of stairs to use the bathroom or do laundry.",
            "Author": "College Student",
            "Date": "2009-12-20T03:59:28.63Z"
        }
    ]
}